{"id":511,"author":"Donald Trump","title":"Speech: Donald Trump in Mobile, AL","date":"2015-08-21","link":"https://factba.se/transcript/donald-trump-speech-mobile-al-august-21-2015","paragraphs":["Wow, wow, wow. Unbelievable. Unbelievable. Thank you, ah, that's so beautiful.","You know, now I know how the great Billy Graham felt because it's the same feeling. We love Billy Graham, we love Billy Graham. You know this all started -- we had a hotel and we were going to have about 250 or 300 people and the hotel was great. They called this -- they said something's happening here, we can't hold this.","This is crazy what's going on. And then we went to the convention center and they can have 10,000 people and we're all set and we're excited, and the next day they said, too many people we can't put them in. So we came here, we came here.","You know, today if you notice we have a stock market not doing so well. We have a country not doing so well, we've been saying it for a long time. We have politicians, other than the few politicians that are with us tonight, right? We'll exclude them, but we have politicians that don't have a clue, they're all talk, they're no action. What's happening to this country is disgraceful.","And you know, when I announced that I was running for president, I brought up -- I brought up the subject of illegal immigration and I took a lot of heat, that I can tell you, Rush Limbaugh, who said, incoming, he got more incoming than anybody I've ever seen. And two weeks later, everybody was apologizing to me. They saw that I was right between what happened in San Francisco to -- to incredible Kate, and her family is such an incredible family and Jameel. And so many people have been so badly hurt the other day in California last week.","A woman, 66 years old, a veteran, was killed, raped, sodomized, tortured and killed by an illegal immigrant. We have to do it, we have to do something, we have to do something. So we're gonna talk. We're gonna have a lot of fun.","I -- you know, the weather's a little dicey, that's okay, but we're gon -- who cares if it rains, right? Right? You know, if it rains I'll take off my hat and I'll prove -- I'll prove once and for all that it's mine, okay? So, so we're gonna talk about a lot of different subjects and -- and you know it's nice Friday night, what the heck, right?","What's better? What's better? What, people? The people that built this country, that's what we have here. I mean, the people that built the country, great people. So, we'll start with a little talk on the illegal immigration, what's going on, we've got to stop it. We're going to build a wall and it's going to be -- you know, it's amazing the politicians ten years ago, fifteen years ago, they all wanted a wall, but it never went, it never happened, because somebody didn't want it, probably a lobbyist.","You know, all these guys like Bush and like Hillary Clinton, they're all taken care of. I don't know if you know, yeah, true. No, but when Hillary has $60 million and when Jeb Bush, uh, when Jeb Bush, who's totally in favor of common core, weak on immigration, right? Very weak on immigration, wants to let people come in, although now he is using anchor baby, you know, he put out a memo, you cannot use anchor baby, now because I used it he's using it. Politicians.","But when they have, in his case, $114 million, in Hillary's case, she's got sixty. Now I don't know that she's going to make it to the gate, what do you think? I don't know. I'm not sure she's making it to the gate. Some bad things came out today.","You know, those classified, you know the word classified? You know, they've destroyed General Petraeus over less. And nothing seems to be happening here. So it'll be very interesting to see what happens ultimately. But we have right now, and I just got these numbers today, I said, what are they, 7.5% of all of the births in this country are illegal immigrants, okay? We can't afford it, and they supposed to stay.","Now I turned out to be right. The 14th amendment, you know, I had these guys are telling, oh, you can't change the 14th amendment it'll take so long, on that I agree. But you know what, an Act of Congress, the 14th amendment, I was right on it, you can do something with it and you can do something fast, you can do something fast. So we have 300,000 babies a year, 300,000 that you have to take care of, we all have to take care of.","And you know, in the case of other countries including Mexico, they don't do that. It doesn't work that way, you know, walk over the border for one day and all of a sudden we have another American citizen, it doesn't work that way. Mexico doesn't do it, other places don't do it, very few places do it, we're the only place just about that stupid enough to do it. So, I decided to run I've gotten an amazing reception, we have to say, has that been -- has this been crazy? Man.","I mean, it's been wild, I'm a non-politician. The other day I served jury duty, right? I told you they had an occupation, I refuse to put down a politician, but I will say this, we have a great politician here. We have a man here who really helped in, he's the one person I sought his counsel because he's been so spot-on, he's so highly respected. Has anybody ever heard of Senator Jeff Sessions, huh? Jeff, come up, where's, Jeff, get over here, Jeff.","Look at him, he's like 20 years old, unbelievable guy. You say hello. Come here, Jeff. You say hello.","Thank you, Jeff.","Thank you, Jeff. He was so great, such a help. So, I go around and I see so many people and I've been treated so well by the people, and you know we're leading in every poll, we're leading in just about every state, including Alabama, big, we're leading in Florida, could you believe it? And we're leading big in Florida and you know it's really amazing. I said well, Florida, I love Florida, it's a great place, right? Right.","But Florida, we have a governor and we have a sitting senator and I'm killing them, explain that. Obviously, they're not doing a very good job, 'cause that shouldn't be happening. But we're winning in Florida, Pennsylvania, Iowa, New Hampshire, South Carolina, North Carolina, Texas and then nationally were -- we're just absolutely way ahead of everybody else. In fact, you know if this were another country we could maybe call for an expedited election, right? I would love to.","Can we do that? Can we do that? I'd like to have the election tomorrow, I don't want to wait. So, the reason that I think we see this receptivity is that I know the game better than anybody, I've been on the other side. You know, I was totally establishment millions of dollars all the time to these characters, right? I was -- I was like the fair-haired. Boy, do I look fair-haired for , but -- but I know the game.","I mean, I understand it. And so many people have come up lobbyists. I said I don't want money from lobbyists. But recently, last week, a man comes up, who's a good guy, I know, that was lobbyists.","Hey, I don't want your money. I don't want your money. Because -- I don't know, maybe I'll rethink it. Should I rethink it? Take it.","Take it. You know what I should do? How about this, how about if I take his money, but in the end, I screw them and don't do anything for him. Is that okay? Can I do that? You know, because I built a great business and I feel sort of stupid I'd say, I don't want your money. Le -- can I take it, please? I promise I won't do anything for him.","I told him, I said, you know I don't want your money because in two years when you come to see me about something I'm not doing it unless it's good and unless it's gonna make America great again, right? Right?. But I'm gonna have to rethink it, I think I'm gonna rethink that because I think I should take a lot of money. Are we allowed to give it to charity or something? I don't know. Give it -- said just take it, just take it.","So what happens is, this guy's come up and I'm lucky, you know, everybody said he's never gonna run, okay. You know that, right? And my wife actually said, you know, if you -- if then she knows me pretty well, and she also sees the reaction. And for a long time whether it's Trump The Art of the Deal, which Obama and Carrie obviously did not read when they did this crazy deal with a real -- oh look, The Art of the Deal, come here, give me that book. I love that book.","You know, I said the other day and it sort of played pretty well. That is my second -- help her over here. Help her over here. That is my -- give me that book, give me that.","There's always The Art of the Deal and that's the real one, that's the original. That's when they used real paper, right? You know, said the other day because so many people they carry around The Art of the Deal because they're begging, they're begging their politicians, please, please read The Art of the Deal when you negotiate with China, and with Japan, and was Mexico, and with Vietnam, and with Saudi Arabia and with everybody. You know, right now we have a problem where North Korea is getting frisky, right? Now recently I ordered 4,000 television sets, I'd like to order them from here like the hats are made in America. Can you believe I was able to find the guy?","I had to do that because you know, these hats are hot as a pistol, you know that and they're made in America and I'm gonna give you your book. Believe me, I haven't forgotten about you, but they're made in America, but the other day and now I see today, it's sort of, pretty hot on the news that our very dear friend from North Korea is acting a little bit rambunctious again. So I ordered 4,000 television sets from South Korea, whether it's, Samsung or Sharp or LG or any of them they're all made in South Korea. I paid a fortune and they're wonderful and they're wonderful people, then they can afford you.","We don't do we have anybody that makes television sets in this country, I almost like don't think so, right? So they're mostly made other than Sony, which is lost its way, prices are too high, but they're mostly made in South Korea. So now I see North Korea is acting up. So I see that we're sending chips and we're getting our troops ready. We have 28,000 troops on them and we're getting ready just in case, Bob we're gonna fight, we're gonna protect, we get nothing.","We get nothing. What do we get? We get nothing. Saudi Arabia and I get along great with all of them, they buy apartments from me, they spend $40 million, $50 million. Am I supposed to dislike them? I like them very much, but you know, Saudi Arabia makes $1 billion a day, a day.","It's all fair decision before the oil went down a little bit, but that's okay, these are minor details. But, let's say they were, so now they're making a half a billion a day, that's not so bad, right? We get nothing, and they wouldn't be there without our protection. Even Germany, Germany's a power who has a Mercedes-Benz, anybody? A lot of people. They're a power.","They pay us nothing. We defend the whole world. We -- all you have to do -- and we want to be nice. Somebody said, oh, that's like the Mafia defense.","I said, don't worry about it, ok, the Mafia is not so stupid. All right? They said that's terrible to ask for money. No, they said it, they said, that's terrible. How could you possibly ask for money to defend a country? I mean, tell me, tell me, how crazy are we? Now we're sending our ships who are sending our everything.","We got -- I'll tell you what those 28,000 troops that we have right now on the border between North and South Korea that's dangerous territory. They're in harm's way, they're in harm's way, and we get nothing, we get nothing other than they're a good competitor. I mean they compete with us, they take our trade, we lose a fortune with them. We lose a fortune with China.","We defend Japan. You know, we have an agreement with Japan, where if somebody attacks Japan, we have to come to their rescue, but if we get attacked, Japan doesn't have to help us. Do you think that's a good deal that's sort of like Sergeant Bergdahl. Has anybody heard of Sergeant Bergdahl? The traitor? No, no, the traitor.","I call Presi -- call President Obama, the five for one president. We get Sergeant Bergdahl, a traitor, who by the way six people, at least, that we know of, six people were killed, trying to get this guy back. Six people, they went after him. They wanted to get him back, so we get Sergeant Bergdahl and they get five people that they desperately wanted for years that are right now back on the battlefield, trying to kill everybody including us.","How stupid are we? How stupid are we? And you know the reason we have crowds and no matter where I go, the other night we're in New Hampshire, we -- we had some -- New Hampshire was so incredible. The crowd, you saw it, it was in tough. You know, every time I go on television, it's got to be live. It's live, I said, oh, can I have a rest, please? Tonight, it's live on FOX, it's live -- who likes FOX? I like FOX.","It's live on CNN. Who likes CNN? And it's -- oh, this gonna be -- and it's live on MSNBC, right? Well, they're still working, they're still working. But I said, you know, how come it always has to be live? Why don't they just cover me like anybody else, where they go the next day and they show a little clip. Every time I speak, it has to be live.","It's not this ridiculous, but it's okay, right? We have to suffer with it. But look, the reason I have this incredible... Really incredible enthusiasm and I really appreciate you being with this weather and this heat and everything else. But the reason I have it is because I do know what I'm doing. And -- and I don't say that in a braggadocious way, you people are looking for somebody that knows what he's doing, whatever it is.","You know you know thank you, darling. I'm, gonna sign her book. I gotta get her the hell out of here, she's so beautiful, I said it the other night, my second favorite book of all time. What's my first favorite book?","The Bible. And as much as I love The Art of the Deal, it's not even close. We take the Bible all the way, right? Right, right, right. So I was saying, so they said I wasn't gonna run and everybody said, oh, he's never gonna run, never gonna run, he's just having fun, just a good time.","His brand didn't like, I care about my brand at this point, you know my brand, I mean, I lose gutless Macy's because I said about illegal immigration. They dropped my brand and I'm supposed to be -- they're, gutless, they're all gutless. I have to sue Univision. Univision, my poor Miss Universe people, the beautiful girl, these beautiful women, summer girls, but beautiful women.","And I get dropped by -- think of it. You have these magnificent women that work all their life to be in the Miss USA contest in the miss -- and two weeks before the contest NBC and Univision drop, because they thought my tone was a little bit strong. And it turned out, I was right. So here's the good news, I sue them both.","And I mean, in the case of Univision, I sued them for $500 million. I want that money. I want that money. So I actually put it on the other day Miss Universe, she or say I put it on because it was only fair to the people and we had it on this small network and it was fine.","But who would do that all because they want to be so politically correct, they actually called and they said, oh, we'll get it back on, soon, we'll get it back on soon. You know in the case of a couple, they said Trump loses NASCAR, it was all over the world a friend of mine called you know because I opened with the strong statement, meaning, illegal immigration. We got to solve the problem. So, all over, one day it was NASCAR, Trump loses NASCAR, I said, I don't have a deal with NASCAR.","It turned out, it turned out that I lost NASCAR, you know what they did. They rented a ballroom at Trump Doral, can you believe it? That was my lawsuit. They had a ballroom. And by the way, I kept their deposit and rented it to somebody else.","The next day, I didn't even know how to deal with them. It turned out they had a -- the ballroom in one of my places, Doral. The next day, ESPN severs ties with Trumpets all over the world, ESPN, I have friends that called me from Paris, he's a great businessman, oh, it's too bad about what happened to ESPN. You know it was a golf outing at one of my courses in Los Angeles.","Can you believe -- this is my big deal, and this was all over the world. I mean, the press, I don't know, maybe they didn't get it, maybe they don't get it. I was very disappointed though with Macy's, you know, shirts and ties, not a big deal, but they heard they're gonna be three pickets in front of the store and they called, oh, we're, gonna have pickets, we're gonna have pickets. I said, look in two hours they'll be gone, I, believe me, they'll go for lunch, they won't come back.","Don't worry about it. I've been through -- it's true, but they said, oh, this is so bad. Can we sever ties? I said I don't care to sever ties, I don't wear ties so much anymore, you know.","I didn't like the ties that much, anyway, you know why? 'cause they were made in China. It always drove me nuts.","True. But they were good, they were good. I just hate gutless people. And so, the reason that we're getting this receptivity, which is like this all over the place is because I filed my papers and they said, never to run.","Then this is never going to sign the big document, which is a one-page document, which basically you're giving your life away, and I signed. And then they say, ah, I can't believe it, the pundits, you know they get paid a half a million dollars a year to sit there and make jerks out of themselves, right? Call them pundits, some are great, some are really incompetent. I could tell you the ones, but you know what, this started to get basic to me. So I think I can.","Now, you know, though he knows he says, I know which one, do we -- there more than one, there's but still about five left. There were about 50 now there's about five, but they're starting to getting there, they're coming around. But what happens is then they said, he'll never file as financials, he'll never file because he's probably not as rich as people think. I said actually one of the reasons I want to wrinkle I want to file my financials they're so good it's true, it's true.","So I have like about 102 pages or 98 pages of stuff and they have all these boxes over 50 million over 50 mill -- And I found my fi -- and they were phenomenal, they were phenomenal, much better and people realized and it was a net worth -- and this is not bragging and I'm gonna tell you why. Over $10 billion, that's good, right? Very little debt, very little debt. In fact, to show you how stupid these fi... It has a line for income, and the income was like, I think it's over $400 million a year. Is that good? My son is here, look at Eric, he can live on that.","So I have -- it says, aligned income, and it's like, you know, varies with different things, but basically over 400 million a year, 365. Is there anybody that would not want to make that much money in one year here. Anybody? Raise your hand. Well, with it comes responsibility, but I will tell you this.","The reason people like what I'm saying is because I want to put that energy, whatever the hell kind of energy is. I don't know if it's screwed up and it's good if it's genius if it's what, whatever it is, I know how to do things. I know -- and I'm not gonna do -- I won't care about, you know, we're building a great building on Pennsylvania Avenue, right opposite -- between -- as you know, The White House and The Old Post Office. You know, in real estate there's a slogan, always get the post office 'cause they were there first, I got the old post office in Washington DC and I got it from the Obama administration, can you believe that? Now, that's called deal-making.","One of the most sought-after buildings in the history of the General Services Administration, and I got it, and you know what, they did the right thing because we're doing a great job and we had a great statement, they want to make sure it gets done, and it'll be opening. And here's a little story, it's now under budget and ahead of schedule, do you ever hear that from the government? And we just finished around a lot of great jobs and my son is here, Eric Trump and Ivanka, has anybody ever heard of Ivanka? Has anybody --","And I'll let them run it, I'm not gonna let then do any big deals, just relax, Eric, just relax, just comment. But you know what? I won't care about that company, my whole energy, who cares that we do a building, it doesn't mean anything my whole energy, my whole being is going to be to make our country rich and to make our country great again, that's what my whole --","And I mean it's my primary -- it's a great aptitude. I've always had an aptitude for making money. Some people would say that's nice one person said, Mr. Trump, that's very crass.","I said, what? You said you're gonna make the country rich, that's very crass, I say, you have to understand in order to make our country great I have to make it rich again, we're a debtor nation, we're a debtor nation. He agreed. Do you agree with me. Yes, he agrees.","I can see that. Anybody with a sign that big has to agree. So, so I will devote 1000%, I couldn't care less about The Old Post Office, I couldn't care less about any of our stuff. My kids are really good they're gonna run it very nicely and I just want to make this country so great and that's what's gonna happen, and that's what's gonna happen","Like, as an example, give me a couple examples, in Alabama, US Steel, big closure, who are essentially a closure, and I said, why, what happened? and I went around and I said, anybody worked there? no, I don't think so, I hope not. But big closure and one of the reasons that China is dumping so much steel into the United States, and other company, really other countries also. But China -- I love that sign. Look at that, huh, Wow, Wow.","Oh, that's true, except the only problem is you're breaking everybody's ear, but the sign is fantastic. Thank you. So, China is dumping tremendous amounts of steel into our country. The government is subsidizing it.","It's almost like they want us to just die, and they have no respect for us. And again, like Saudi Arabia, like -- like Japan, I get along with them great, you know, the largest bank in the world is in one of my buildings, they pay me rent, they buy apartments, they spend so much money. Am I going to dislike them? I love them. The problem is that, I say it all the time, their leaders are really smart, they're really cunning, they're really sharp and we have dummies, right? We have dummies, we have dummies, we have people that don't have a clue, and I don't know, you know, some people say they're bad people, I don't think they're bad people, I think they're incompetent people, a lot of people think they're bad, I don't think they're bad, I think they're incompetent.","So you look at China and what they've done, and you know, last week and I said this, and I've been saying bubble for a long time, you've been hearing it. Last week they devalued their currency and we're having a lot of hard times because of what they did. And when I hear devaluation of the Chinese currency, you know the word, the sucking action, that's called a sucking, like a vacuum cleaner, I have this sucking action. Two things happen, two things get sucked out of us, our jobs and our money.","Now think of it, China sells us our product, takes our jobs, takes our base, does our manufacturing for us and we owe them $1.4 trillion. That's like a magic act, I call it the magic act in reverse. We owe them money. Japan and Japan is back, they have Abe, who's the new Prime Minister, you know, and Abe is really smart.","I mean, he's smart, I met him one time, he's young, and he's negotiating against Caroline Kennedy, Carol -- and I was watching 60 Minutes, I'll give you guys a blood. I was watching 60 Minutes and they're doing a feature in Caroline Kennedy and she's very nice. You know why? I like her because Ivanka Trump likes her, my daughter like -- anybody that my daughter likes right? Anybody my daughter like, we love Ivanka. So, so what happens is that they're doing a feature and they said, how did you become an ambassador to Japan? And with Japan, the Ambassador is a very important position because we negotiate, you know, you need somebody sharp, you need a killer, right? A smart killer, not a dumb killer because there are plenty of dumb killers though, you need somebody sharp.","So they said, how did you get the ambassadorship? She said, well, and this is pretty close. I mean, you can check it out. Well, I don't know, I wanted a job and I had nothing to do, so I went to the White House and I said, could I have a job? Do you have anything for me to do? And they said, how would you like to be ambassador to Japan? And she said, really? This is -- this is -- she said, I'll do it, she couldn't believe she got it and then they show the rest of the show is her being wined and dined by Abe and all of these killers. Wined and dined, she's being feted at a dinner and this and lunches and breakfasts she'll do anything, they want anything.","So I have the smartest, toughest meanest in many cases, most horrible human beings on earth. I know 'em all, they're killers, they're negotiators, some are nice people, very few, some are nice people. But I will put the meanest, smartest, smarter... We have the best in the world, we don't use them. We use political hacks, diplomats, we use people that don't have any business ability.","We have people. We use people that have never done a job. Somebody stole my plane, damn it. People are pointing up to the plane, no it's actually not mine.","And you know, like as an example, Carl Icahn, did anyone ever hear of Carl? He's an -- he's an unbelievably brilliant tough business guy. So I called him, I had dinner with him two nights ago, I said, you know, Carl, I'm doing pretty well, I'm leading every poll. He said you're doing great. He can't believe it either.","And I said, if I ever get there, I want you to oversee the negotiations with China. I can give him to -- he's extraordinary. China and Japan, I'll do, I'll, do it. He's like, I'll do it.","Remember when I said, somebody has blood coming out of her eyes with hatred, right? Well, he had blood coming out him, he will do it. He is unbelievable negotiator, an unbelievable negotiator, and I know others, I know the best, I know the worst, I know the ones that are overrated, I know the ones that you've never heard about or read about that are better than all of them. But Carl's one of the greatest, I mean, he's very famous, very rich and he would love to do it, he would love -- he'd love to give -- give back and he knows what's happening, they're ripping us. So they send their stuff over here.","And actually, somebody the other day said, what China has done to the United States is the greatest single theft in the history of the world, it's an interesting statement. We've rebuilt China, we've rebuilt China. So you know we have free trade. The problem with free trade is when you have free trade, very important, you need competent leaders, that's the one problem with free trade, I like free trade, I'm a free trader.","The problem is you need great negotiators, the great leaders we don't have that. So we're getting killed by everybody. I used these three or four countries. We don't make good deals, everybody's killing us.","So we will have unbelievable deals. A friend of mine is a manufacturer and he's trying to do business with China and what he's going through -- and he's a good manufacturer, makes great product better than what they did. They don't want him sending his stuff. Then he calls because, you know, it's impossible to do business I can't get my product they're dumping stuff over here comes in by the shipload.","He said, it's impossible I can't get my pro... Finally gets a product in there and they judge him a massive tax, which they call a tariff because it sounds a little more sophisticated, right? And he calls me because it's impossible to do business with China. Boeing does business with China and they want all of their Intel, they want all of their copyrights, they want everything, otherwise, we're not buying planes. And they're now building big factories in -- I don't blame China. I mean, I respect them, not angry at them.","I'm angry at our leaders for being so stupid, I'm not angry at China and Mexico is the same thing. You know, Mexico is the new China. The other day, Nabisco, Nabisco, Oreos, right? Oreos. I love Oreos, I'll never eat them again, okay? I'll never eat them again.","No. Nabisco closes a plant -- they just announced a couple of days ago in Chicago and they're moving the plant to Mexico. Now, why? Why? Why? Have you heard my story? My favorite story is Ford. You've heard the story with Ford? Do we want to hear it again or not? Yes, all right.","I mean that's a big one. So Ford, great company, they're building a $2.5 billion car factory in Mexico, now they're closing up places all over the United States, they're building this massive factory in Mexico. So I went to this great school, I was actually -- you know that I was hopefully still am really smart. I went to this great place, the Wharton School of -- the finest school to get into, even then it was hard to get into Wharton.","But I went to this great business school and I get business, and I fully understand, I'm really good at this stuff. So they're building a $2.5 billion plant, they're gonna close factories in here, I said, they're gonna go and they're gonna build this plant, and they're gonna sell cars, they're gonna sell them back to us, they're, gonna sell them all over. Where does that help us? Tell me, explain, explain. There's no tax.","There's no nothing, there's no nothing. So we're closing plants here, they're building this massive plant in Mexico, another plant, also another big foreign car company. There was a plant being built. It was all set to get started, they were going to announce it in Tennessee, you read about it.","And this was a couple of months ago, Wall Street Journal, all set to get started, all of a sudden Mexico took it away and now it's not gonna be built in Tennessee, it's gonna be built in Mexico.","So Ford is building a plant and here's what I did, I said to myself, I give myself this 'cause, it really is sort of right. I give myself this position and I say, let's assume that somebody else becomes president, wouldn't it be horrible? Would that be horrible? So let's assume somebody else becomes president, let's, assume a very low energy person, very, very low energy. So low energy that every time you watch him, you fall asleep, but let's say, he said, Hillary, yeah, Hillary too. So let's, say, Jeb becomes president, not good, not good.","First thing that happens is like I said, your schools go to hell, people flow over the -- but forgetting about that. So let's say that Jeb doesn't want this plant built. So they're, gonna call him the Head of Ford and you're gonna say, Mr. President, we want to build it, he'll say, well, we don't want to build it.","The next day or the next hour he's going to get a call from the lobbyists and the special interests and his donors and they're going to say, hey, Jeb, we gave you $8 million of your $120 million that you raised. We gave you $8 million. We want that thing done. You can't do that to our people.","Oh, well, okay, I'll approve it's gonna get done, okay. The plant will get built that'll be it. Now let's take Trump as president. Okay.","Is that better?","Here's a simple question, who would you rather have negotiating with China, Japan, Mexico, any of them?","Trump or Bush?","Actually.","Oh, what a group. Ah, what a group Well, you know, it's sort of interesting. Thank you. CNN does this big report that came out last week, so I was leading in the polls, so there was a poll, and everybody says, why don't I have a pollster? What the hell do I need a pollster? Every day I wake up there's another poll, right? You know, they pay these guys like $1,000 dollars a month and they can't function because unless they go and have it vetted with their pollster, they can't talk.","And I say, why do I need a pollster when every day there's a new poll and they give like 30 pages. I don't have to get a pollster, what the hell do I need it? Save you money, okay? But -- but CNN did this really very, very expensive, very well done poll, it's only well done because I was leading by a lot, it wasn't -- I'd say, was it? And they had leadership, I was way ahead of everybody. They had -- actually, I was very good in warrior. You know the thing I'll be great at? That people aren't thinking, but the thing -- and I do very well at it, military, I am the toughest guy.","I... I will rebuild our military. It will be so strong and so powerful and so great it will be so powerful and so great that we'll never have to use it. Nobody's going to mess with us folks, nobody, nobody, nobody's gonna mess with us.","Beautiful.","So I look at the various things to do with our country and by the way, one of them, boy, are we gonna take care of our vets, right? They did a poll, another poll, but they did a poll on like, who's one of the most popular with the vets? I was the most popular person, they liked me and I love them because, you know why? Because for 35 years, these senators and these -- other than Jeb, of course, I take Jeb, but these senators, these congressmen, these people in Washington including presidents, they have done nothing for the vets, they have done nothing. And we're gonna take care of our vets. But -- so they do this poll, and in the poll, I score really high marks on almost everything other than they thought I wasn't a nice person. They said, who's the nicest? And I was like, pretty low in that poll, and I'm a nice person, but who cares?","A woman came up to me. She said I'm not sure that you're nice enough to be president. I said, you know what, this is not going to be an election based on a nice person it's going to be based on a competent person, we're tired of the nice people . So, I won on the economy, I won on jobs, I won on leadership by massive numbers, like massive, you've seen it.","I won on all these categories, I said, why do we need an election? We don't need an election, these are such important categories. But I have had an amazing experience because, from the time I announced, almost, other than the first week, it was a rough week, they were hitting me. But the press, which is by the way largely very dishonest, I have to say this, the political media, I actually think -- I actually think that the political media is less popular than Congress. Can you believe it? And Congress is almost -- Congress says almost no rating.","And and in all fairness, because look at all those cameras, they're all live and they're trying to shut off the camera right now. But you know what they're all live and so many live cameras. But look at -- thank you. But I will say this, the media is very dishonest, but there is a certain group that are fantastic people and every once in a while I'll get an honest story and I love it.","I cherish those stories, they're not often, but they cherish those there. But we -- we have -- you have to understand and they have -- they really started treating me much better. Don't forget, when I first ran, I said, you know it's amazing, went to a great school, excellent student, smart guy. My uncle was a professor at MIT.","He was a smart guy, you know, good smart guy, right, good family. Do we believe in the gene thing? I mean, I do. Right? You know, I do. Like they used to say, Secretariat doesn't produce slow horses.","Actually, secretary wasn't one of the best, if you want to know the truth, but in theory that's -- But then I went out, I made a tremendous cop -- build tremendous fortune and great company. I did The Art of the Deal and many books that were bestsellers. The Art of the Deal was one of the biggest selling, maybe the biggest selling business book of all time. I did The Apprentice, we love The Apprentice.","Tremendous. NBC hates me, you know NBC hates me because they renewed The Apprentice and I said, excuse me, I'm not doing it I'm running for president I'm gonna make the country great again. They actually -- they actually came up to my office and the top people, great people from NBC and they said, please, please, run, run. And I said, I'm not running, I mean, I'm not running.","He said, we already renewed the show, they've sold most of the advertising. They renewed the show, I said, I'm gonna run and I'm going to make our country great, we're gonna do something that's nice, we're gonna do something that's nice. I'm hired. You're hired.","So, so I look at the landscape of our country, I look at where we're going, I look at where we've been, we've had a horrible number of years, a horrible number of years. We can't beat ISIS. I watched The General the other day on television who's just retiring, which is fortunate. How do you think will do against ISIS? Oh, I don't know it's gonna be very tough.","Can you believe this? General George Patton, General Douglas MacArthur are spinning in their graves as you listen to this, they're spinning in their graves. He talks about a hard time and I look at what's going on with the landscape and then I get to meet all of the people that I've met over the last period of time and I want to tell you it's been -- it's been amazing, it's been really amazing and I want to finish up with a couple of little points. One of them is, the Ford deal, right? Israel, I love Israel. Oh, by the way the bottom line on Ford, 'cause some of you -- I love this story because there's -- so when I get the call, I say, no, no, no, you're gonna build in the United States, they're gonna say, no, we don't want to do that.","I see, let me tell you, sir, you're gonna build in the United States and I will be called by people, but I will not have any of their money, so I don't care and they're gonna say, and I'll call them in, and I'll say, listen, here's the story, you're building $2.5 billion in Mexico, we're gonna charge you a tremendous little 35% tax, okay, 35%. And that tax is going to be for every car and every part and every truck that comes into the United States. And here's what's going to happen, here's what's going to happen as sure as you're standing or sitting there going to come back to me, the following day, I would say, the following afternoon, let's say it's 12:00, I say by the time the day -- and I don't need Carl Icahn underneath, this one is too easy, and they're going to come back and they're going to say, Mr. President and now then I'm going to het called by the lobbyists, I'm going to get called by this spinster, and I'm gonna say no interest, no intere -- and within 24 hours they will call and they'll say, Mr.","President, what you're doing to us is terrible. We will build the unit into the United States. We will build the plant in the United States. A hundred percent and I'll say the same thing to Nabisco.","It doesn't help us. It doesn't help us. When you look at what's going on when you look at what's going on, where Nabisco's closing in so many places are closing. When you look at the kind of money that these countries are making and I'm naming a few, I mean, so many countries, we don't have anything left, we're running on fumes, we're running on fumes, there's nothing here.","When you look at what happens they're so much sharper, they're so much smarter and we're not going to have a country left, we need to have our borders. We need to make great deals. You know, the man in the back just shouted Israel. How would you like to be Israel right now?","They relied on us, they're a voice of sanity, they're great people and we have a deal that is so incompetent, so bad. Think of the deal, we make a deal. Our chief negotiator goes into a bicycle race at 73 years old, he falls, he breaks his leg that was the good part of our deal. That was the only thing that happened.","No, think of it. And I told people last week because I told this last week, I swear to you, I will never ever ride a bicycle, at least in a race, but I won't ride one anyway. But we have a new thing that just came up yesterday in the deal, we know all about the 24-day period, right? But the 24-day period that doesn't start that clock doesn't start ticking for a long time, for a long time. So that could be forever.","So if they're doing something, believe me by the time we get there. But here's the all-time great, first of all, why aren't they giving us back our prisoners? And second, can you believe this? Can you believe it? And second of all, the other day, it was determined that Iran, in a very important section, may be the most important, right, is going to do their own policing. They are going to the police, they are going to police and they are going to tell us, we swear we're not building anything. It's so -- it's so sad, it's so sad.","Obamacare.","We are going to repeal and replace Obama. We -- we are going to come up with a plan and there are so many different ways. You know you don't know this because you don't think of Obama this way. Do you know who the biggest beneficiaries of Obamacare are? The insurance companies, the insurance companies? Remember I told you, special interests and lobbyists, the insurance companies love it.","We can have such great plans if we'd get rid of the artificial lines around every so -- I have a huge, I have a huge company and when I negotiate it's like get one group, they don't -- you can't, negotiate. Some of the people that own businesses know what I'm talking about. The insurance companies are so protected, they're making a fortune we're gonna end, that we're gonna make it so competitive. We're gonna get rid of the artificial barriers, you're gonna get such great plans.","And Obamacare, I mean, you look at what's happening with your premiums, I mean, look at this, look at what's happening, just take a look at what's happening to the deductibles, they're so high it's impossible, it's, impossible. Trade, we're gonna fix it, health care, we're gonna fix it, women's health issues, we're gonna fix it. You know, my wife came up to me the other day and she said, it's really sad because people don't understand how you cherish women. I want -- I will protect women who are so important to me, so important, and I heard some of the other candidates, Jeb and some of the others the other day, saying we're not going to fund various women's health issues, can you believe this? I said that's the end of his election, women I don't think like that too much, do we agree? And he said, we're not going to fund women's health issues, a few hours later he came back and he said, he misspoke.","Oh, okay, he misspoke. But women's health issues, so important we're going to end up taking our country, we are going to make it so strong, so powerful, so loved by people again. So loved, you know, one of the problems that we have, and you don't see it tonight, but you see, it is a tremendous lack of spirit. And I actually thought that President Obama, the one thing, he was inexperienced, he never produced the job, lots of other things.","But I actually thought that he would be a great -- a really great cheerleader for the country when he was elected, I thought that he would and he's really turned out to be a great divider as opposed to a great unifier, really have. And you look at Baltimore, you look at Ferguson, you look at St. Louis last night, over the last week, you look at all the things that are happening. We're sitting on powder kegs, there's no spirit, there's no jobs, there's no anything.","We are going to take this country, I am going to be the greatest jobs president that God ever created, I will tell you this, I will tell you. You are going to be so proud, you know, I often times say, the American dream is dead, but I'm going to make it bigger and stronger and more powerful than ever before. And and that's what's going to happen. I am going to make this country bigger and stronger and better, and you're going to love it and you're gonna love your president and we're going to turn this place around and you're gonna be so proud.","And you know our whole theme is, Make America Great Again. We are going to make America better than it's ever been and we're gonna love doing it and we're gonna have fun doing it and I just want to thank everybody because this has been really, really special. Thank you. Thank you very much."],"text":" Wow, wow, wow. Unbelievable. Unbelievable. Thank you, ah, that's so beautiful. You know, now I know how the great Billy Graham felt because it's the same feeling. We love Billy Graham, we love Billy Graham. You know this all started -- we had a hotel and we were going to have about 250 or 300 people and the hotel was great. They called this -- they said something's happening here, we can't hold this. This is crazy what's going on. And then we went to the convention center and they can have 10,000 people and we're all set and we're excited, and the next day they said, too many people we can't put them in. So we came here, we came here. You know, today if you notice we have a stock market not doing so well. We have a country not doing so well, we've been saying it for a long time. We have politicians, other than the few politicians that are with us tonight, right? We'll exclude them, but we have politicians that don't have a clue, they're all talk, they're no action. What's happening to this country is disgraceful. And you know, when I announced that I was running for president, I brought up -- I brought up the subject of illegal immigration and I took a lot of heat, that I can tell you, Rush Limbaugh, who said, incoming, he got more incoming than anybody I've ever seen. And two weeks later, everybody was apologizing to me. They saw that I was right between what happened in San Francisco to -- to incredible Kate, and her family is such an incredible family and Jameel. And so many people have been so badly hurt the other day in California last week. A woman, 66 years old, a veteran, was killed, raped, sodomized, tortured and killed by an illegal immigrant. We have to do it, we have to do something, we have to do something. So we're gonna talk. We're gonna have a lot of fun. I -- you know, the weather's a little dicey, that's okay, but we're gon -- who cares if it rains, right? Right? You know, if it rains I'll take off my hat and I'll prove -- I'll prove once and for all that it's mine, okay? So, so we're gonna talk about a lot of different subjects and -- and you know it's nice Friday night, what the heck, right? What's better? What's better? What, people? The people that built this country, that's what we have here. I mean, the people that built the country, great people. So, we'll start with a little talk on the illegal immigration, what's going on, we've got to stop it. We're going to build a wall and it's going to be -- you know, it's amazing the politicians ten years ago, fifteen years ago, they all wanted a wall, but it never went, it never happened, because somebody didn't want it, probably a lobbyist. You know, all these guys like Bush and like Hillary Clinton, they're all taken care of. I don't know if you know, yeah, true. No, but when Hillary has $60 million and when Jeb Bush, uh, when Jeb Bush, who's totally in favor of common core, weak on immigration, right? Very weak on immigration, wants to let people come in, although now he is using anchor baby, you know, he put out a memo, you cannot use anchor baby, now because I used it he's using it. Politicians. But when they have, in his case, $114 million, in Hillary's case, she's got sixty. Now I don't know that she's going to make it to the gate, what do you think? I don't know. I'm not sure she's making it to the gate. Some bad things came out today. You know, those classified, you know the word classified? You know, they've destroyed General Petraeus over less. And nothing seems to be happening here. So it'll be very interesting to see what happens ultimately. But we have right now, and I just got these numbers today, I said, what are they, 7.5% of all of the births in this country are illegal immigrants, okay? We can't afford it, and they supposed to stay. Now I turned out to be right. The 14th amendment, you know, I had these guys are telling, oh, you can't change the 14th amendment it'll take so long, on that I agree. But you know what, an Act of Congress, the 14th amendment, I was right on it, you can do something with it and you can do something fast, you can do something fast. So we have 300,000 babies a year, 300,000 that you have to take care of, we all have to take care of. And you know, in the case of other countries including Mexico, they don't do that. It doesn't work that way, you know, walk over the border for one day and all of a sudden we have another American citizen, it doesn't work that way. Mexico doesn't do it, other places don't do it, very few places do it, we're the only place just about that stupid enough to do it. So, I decided to run I've gotten an amazing reception, we have to say, has that been -- has this been crazy? Man. I mean, it's been wild, I'm a non-politician. The other day I served jury duty, right? I told you they had an occupation, I refuse to put down a politician, but I will say this, we have a great politician here. We have a man here who really helped in, he's the one person I sought his counsel because he's been so spot-on, he's so highly respected. Has anybody ever heard of Senator Jeff Sessions, huh? Jeff, come up, where's, Jeff, get over here, Jeff. Look at him, he's like 20 years old, unbelievable guy. You say hello. Come here, Jeff. You say hello. Welcome to my hometown, Mobile, Alabama. The American people, these people want somebody in the presidency who stands up for them, defends their interests and the laws and traditions of this country. We welcome you here, thank you for the work you put into the immigration issue. I'm really impressed with your plan, I know it will make a difference and this crowd shows a lot of people agree with that. Congratulations. Thank you, Jeff. Welcome, and God bless. Thank you, Jeff. He was so great, such a help. So, I go around and I see so many people and I've been treated so well by the people, and you know we're leading in every poll, we're leading in just about every state, including Alabama, big, we're leading in Florida, could you believe it? And we're leading big in Florida and you know it's really amazing. I said well, Florida, I love Florida, it's a great place, right? Right. But Florida, we have a governor and we have a sitting senator and I'm killing them, explain that. Obviously, they're not doing a very good job, 'cause that shouldn't be happening. But we're winning in Florida, Pennsylvania, Iowa, New Hampshire, South Carolina, North Carolina, Texas and then nationally were -- we're just absolutely way ahead of everybody else. In fact, you know if this were another country we could maybe call for an expedited election, right? I would love to. Can we do that? Can we do that? I'd like to have the election tomorrow, I don't want to wait. So, the reason that I think we see this receptivity is that I know the game better than anybody, I've been on the other side. You know, I was totally establishment millions of dollars all the time to these characters, right? I was -- I was like the fair-haired. Boy, do I look fair-haired for , but -- but I know the game. I mean, I understand it. And so many people have come up lobbyists. I said I don't want money from lobbyists. But recently, last week, a man comes up, who's a good guy, I know, that was lobbyists. Hey, I don't want your money. I don't want your money. Because -- I don't know, maybe I'll rethink it. Should I rethink it? Take it. Take it. You know what I should do? How about this, how about if I take his money, but in the end, I screw them and don't do anything for him. Is that okay? Can I do that? You know, because I built a great business and I feel sort of stupid I'd say, I don't want your money. Le -- can I take it, please? I promise I won't do anything for him. I told him, I said, you know I don't want your money because in two years when you come to see me about something I'm not doing it unless it's good and unless it's gonna make America great again, right? Right?. But I'm gonna have to rethink it, I think I'm gonna rethink that because I think I should take a lot of money. Are we allowed to give it to charity or something? I don't know. Give it -- said just take it, just take it. So what happens is, this guy's come up and I'm lucky, you know, everybody said he's never gonna run, okay. You know that, right? And my wife actually said, you know, if you -- if then she knows me pretty well, and she also sees the reaction. And for a long time whether it's Trump The Art of the Deal, which Obama and Carrie obviously did not read when they did this crazy deal with a real -- oh look, The Art of the Deal, come here, give me that book. I love that book. You know, I said the other day and it sort of played pretty well. That is my second -- help her over here. Help her over here. That is my -- give me that book, give me that. There's always The Art of the Deal and that's the real one, that's the original. That's when they used real paper, right? You know, said the other day because so many people they carry around The Art of the Deal because they're begging, they're begging their politicians, please, please read The Art of the Deal when you negotiate with China, and with Japan, and was Mexico, and with Vietnam, and with Saudi Arabia and with everybody. You know, right now we have a problem where North Korea is getting frisky, right? Now recently I ordered 4,000 television sets, I'd like to order them from here like the hats are made in America. Can you believe I was able to find the guy? I had to do that because you know, these hats are hot as a pistol, you know that and they're made in America and I'm gonna give you your book. Believe me, I haven't forgotten about you, but they're made in America, but the other day and now I see today, it's sort of, pretty hot on the news that our very dear friend from North Korea is acting a little bit rambunctious again. So I ordered 4,000 television sets from South Korea, whether it's, Samsung or Sharp or LG or any of them they're all made in South Korea. I paid a fortune and they're wonderful and they're wonderful people, then they can afford you. We don't do we have anybody that makes television sets in this country, I almost like don't think so, right? So they're mostly made other than Sony, which is lost its way, prices are too high, but they're mostly made in South Korea. So now I see North Korea is acting up. So I see that we're sending chips and we're getting our troops ready. We have 28,000 troops on them and we're getting ready just in case, Bob we're gonna fight, we're gonna protect, we get nothing. We get nothing. What do we get? We get nothing. Saudi Arabia and I get along great with all of them, they buy apartments from me, they spend $40 million, $50 million. Am I supposed to dislike them? I like them very much, but you know, Saudi Arabia makes $1 billion a day, a day. It's all fair decision before the oil went down a little bit, but that's okay, these are minor details. But, let's say they were, so now they're making a half a billion a day, that's not so bad, right? We get nothing, and they wouldn't be there without our protection. Even Germany, Germany's a power who has a Mercedes-Benz, anybody? A lot of people. They're a power. They pay us nothing. We defend the whole world. We -- all you have to do -- and we want to be nice. Somebody said, oh, that's like the Mafia defense. I said, don't worry about it, ok, the Mafia is not so stupid. All right? They said that's terrible to ask for money. No, they said it, they said, that's terrible. How could you possibly ask for money to defend a country? I mean, tell me, tell me, how crazy are we? Now we're sending our ships who are sending our everything. We got -- I'll tell you what those 28,000 troops that we have right now on the border between North and South Korea that's dangerous territory. They're in harm's way, they're in harm's way, and we get nothing, we get nothing other than they're a good competitor. I mean they compete with us, they take our trade, we lose a fortune with them. We lose a fortune with China. We defend Japan. You know, we have an agreement with Japan, where if somebody attacks Japan, we have to come to their rescue, but if we get attacked, Japan doesn't have to help us. Do you think that's a good deal that's sort of like Sergeant Bergdahl. Has anybody heard of Sergeant Bergdahl? The traitor? No, no, the traitor. I call Presi -- call President Obama, the five for one president. We get Sergeant Bergdahl, a traitor, who by the way six people, at least, that we know of, six people were killed, trying to get this guy back. Six people, they went after him. They wanted to get him back, so we get Sergeant Bergdahl and they get five people that they desperately wanted for years that are right now back on the battlefield, trying to kill everybody including us. How stupid are we? How stupid are we? And you know the reason we have crowds and no matter where I go, the other night we're in New Hampshire, we -- we had some -- New Hampshire was so incredible. The crowd, you saw it, it was in tough. You know, every time I go on television, it's got to be live. It's live, I said, oh, can I have a rest, please? Tonight, it's live on FOX, it's live -- who likes FOX? I like FOX. It's live on CNN. Who likes CNN? And it's -- oh, this gonna be -- and it's live on MSNBC, right? Well, they're still working, they're still working. But I said, you know, how come it always has to be live? Why don't they just cover me like anybody else, where they go the next day and they show a little clip. Every time I speak, it has to be live. It's not this ridiculous, but it's okay, right? We have to suffer with it. But look, the reason I have this incredible... Really incredible enthusiasm and I really appreciate you being with this weather and this heat and everything else. But the reason I have it is because I do know what I'm doing. And -- and I don't say that in a braggadocious way, you people are looking for somebody that knows what he's doing, whatever it is. You know you know thank you, darling. I'm, gonna sign her book. I gotta get her the hell out of here, she's so beautiful, I said it the other night, my second favorite book of all time. What's my first favorite book? The Bible. And as much as I love The Art of the Deal, it's not even close. We take the Bible all the way, right? Right, right, right. So I was saying, so they said I wasn't gonna run and everybody said, oh, he's never gonna run, never gonna run, he's just having fun, just a good time. His brand didn't like, I care about my brand at this point, you know my brand, I mean, I lose gutless Macy's because I said about illegal immigration. They dropped my brand and I'm supposed to be -- they're, gutless, they're all gutless. I have to sue Univision. Univision, my poor Miss Universe people, the beautiful girl, these beautiful women, summer girls, but beautiful women. And I get dropped by -- think of it. You have these magnificent women that work all their life to be in the Miss USA contest in the miss -- and two weeks before the contest NBC and Univision drop, because they thought my tone was a little bit strong. And it turned out, I was right. So here's the good news, I sue them both. And I mean, in the case of Univision, I sued them for $500 million. I want that money. I want that money. So I actually put it on the other day Miss Universe, she or say I put it on because it was only fair to the people and we had it on this small network and it was fine. But who would do that all because they want to be so politically correct, they actually called and they said, oh, we'll get it back on, soon, we'll get it back on soon. You know in the case of a couple, they said Trump loses NASCAR, it was all over the world a friend of mine called you know because I opened with the strong statement, meaning, illegal immigration. We got to solve the problem. So, all over, one day it was NASCAR, Trump loses NASCAR, I said, I don't have a deal with NASCAR. It turned out, it turned out that I lost NASCAR, you know what they did. They rented a ballroom at Trump Doral, can you believe it? That was my lawsuit. They had a ballroom. And by the way, I kept their deposit and rented it to somebody else. The next day, I didn't even know how to deal with them. It turned out they had a -- the ballroom in one of my places, Doral. The next day, ESPN severs ties with Trumpets all over the world, ESPN, I have friends that called me from Paris, he's a great businessman, oh, it's too bad about what happened to ESPN. You know it was a golf outing at one of my courses in Los Angeles. Can you believe -- this is my big deal, and this was all over the world. I mean, the press, I don't know, maybe they didn't get it, maybe they don't get it. I was very disappointed though with Macy's, you know, shirts and ties, not a big deal, but they heard they're gonna be three pickets in front of the store and they called, oh, we're, gonna have pickets, we're gonna have pickets. I said, look in two hours they'll be gone, I, believe me, they'll go for lunch, they won't come back. Don't worry about it. I've been through -- it's true, but they said, oh, this is so bad. Can we sever ties? I said I don't care to sever ties, I don't wear ties so much anymore, you know. I didn't like the ties that much, anyway, you know why? 'cause they were made in China. It always drove me nuts. True. But they were good, they were good. I just hate gutless people. And so, the reason that we're getting this receptivity, which is like this all over the place is because I filed my papers and they said, never to run. Then this is never going to sign the big document, which is a one-page document, which basically you're giving your life away, and I signed. And then they say, ah, I can't believe it, the pundits, you know they get paid a half a million dollars a year to sit there and make jerks out of themselves, right? Call them pundits, some are great, some are really incompetent. I could tell you the ones, but you know what, this started to get basic to me. So I think I can. Now, you know, though he knows he says, I know which one, do we -- there more than one, there's but still about five left. There were about 50 now there's about five, but they're starting to getting there, they're coming around. But what happens is then they said, he'll never file as financials, he'll never file because he's probably not as rich as people think. I said actually one of the reasons I want to wrinkle I want to file my financials they're so good it's true, it's true. So I have like about 102 pages or 98 pages of stuff and they have all these boxes over 50 million over 50 mill -- And I found my fi -- and they were phenomenal, they were phenomenal, much better and people realized and it was a net worth -- and this is not bragging and I'm gonna tell you why. Over $10 billion, that's good, right? Very little debt, very little debt. In fact, to show you how stupid these fi... It has a line for income, and the income was like, I think it's over $400 million a year. Is that good? My son is here, look at Eric, he can live on that. So I have -- it says, aligned income, and it's like, you know, varies with different things, but basically over 400 million a year, 365. Is there anybody that would not want to make that much money in one year here. Anybody? Raise your hand. Well, with it comes responsibility, but I will tell you this. The reason people like what I'm saying is because I want to put that energy, whatever the hell kind of energy is. I don't know if it's screwed up and it's good if it's genius if it's what, whatever it is, I know how to do things. I know -- and I'm not gonna do -- I won't care about, you know, we're building a great building on Pennsylvania Avenue, right opposite -- between -- as you know, The White House and The Old Post Office. You know, in real estate there's a slogan, always get the post office 'cause they were there first, I got the old post office in Washington DC and I got it from the Obama administration, can you believe that? Now, that's called deal-making. One of the most sought-after buildings in the history of the General Services Administration, and I got it, and you know what, they did the right thing because we're doing a great job and we had a great statement, they want to make sure it gets done, and it'll be opening. And here's a little story, it's now under budget and ahead of schedule, do you ever hear that from the government? And we just finished around a lot of great jobs and my son is here, Eric Trump and Ivanka, has anybody ever heard of Ivanka? Has anybody -- And I'll let them run it, I'm not gonna let then do any big deals, just relax, Eric, just relax, just comment. But you know what? I won't care about that company, my whole energy, who cares that we do a building, it doesn't mean anything my whole energy, my whole being is going to be to make our country rich and to make our country great again, that's what my whole -- And I mean it's my primary -- it's a great aptitude. I've always had an aptitude for making money. Some people would say that's nice one person said, Mr. Trump, that's very crass. I said, what? You said you're gonna make the country rich, that's very crass, I say, you have to understand in order to make our country great I have to make it rich again, we're a debtor nation, we're a debtor nation. He agreed. Do you agree with me. Yes, he agrees. I can see that. Anybody with a sign that big has to agree. So, so I will devote 1000%, I couldn't care less about The Old Post Office, I couldn't care less about any of our stuff. My kids are really good they're gonna run it very nicely and I just want to make this country so great and that's what's gonna happen, and that's what's gonna happen Like, as an example, give me a couple examples, in Alabama, US Steel, big closure, who are essentially a closure, and I said, why, what happened? and I went around and I said, anybody worked there? no, I don't think so, I hope not. But big closure and one of the reasons that China is dumping so much steel into the United States, and other company, really other countries also. But China -- I love that sign. Look at that, huh, Wow, Wow. Oh, that's true, except the only problem is you're breaking everybody's ear, but the sign is fantastic. Thank you. So, China is dumping tremendous amounts of steel into our country. The government is subsidizing it. It's almost like they want us to just die, and they have no respect for us. And again, like Saudi Arabia, like -- like Japan, I get along with them great, you know, the largest bank in the world is in one of my buildings, they pay me rent, they buy apartments, they spend so much money. Am I going to dislike them? I love them. The problem is that, I say it all the time, their leaders are really smart, they're really cunning, they're really sharp and we have dummies, right? We have dummies, we have dummies, we have people that don't have a clue, and I don't know, you know, some people say they're bad people, I don't think they're bad people, I think they're incompetent people, a lot of people think they're bad, I don't think they're bad, I think they're incompetent. So you look at China and what they've done, and you know, last week and I said this, and I've been saying bubble for a long time, you've been hearing it. Last week they devalued their currency and we're having a lot of hard times because of what they did. And when I hear devaluation of the Chinese currency, you know the word, the sucking action, that's called a sucking, like a vacuum cleaner, I have this sucking action. Two things happen, two things get sucked out of us, our jobs and our money. Now think of it, China sells us our product, takes our jobs, takes our base, does our manufacturing for us and we owe them $1.4 trillion. That's like a magic act, I call it the magic act in reverse. We owe them money. Japan and Japan is back, they have Abe, who's the new Prime Minister, you know, and Abe is really smart. I mean, he's smart, I met him one time, he's young, and he's negotiating against Caroline Kennedy, Carol -- and I was watching 60 Minutes, I'll give you guys a blood. I was watching 60 Minutes and they're doing a feature in Caroline Kennedy and she's very nice. You know why? I like her because Ivanka Trump likes her, my daughter like -- anybody that my daughter likes right? Anybody my daughter like, we love Ivanka. So, so what happens is that they're doing a feature and they said, how did you become an ambassador to Japan? And with Japan, the Ambassador is a very important position because we negotiate, you know, you need somebody sharp, you need a killer, right? A smart killer, not a dumb killer because there are plenty of dumb killers though, you need somebody sharp. So they said, how did you get the ambassadorship? She said, well, and this is pretty close. I mean, you can check it out. Well, I don't know, I wanted a job and I had nothing to do, so I went to the White House and I said, could I have a job? Do you have anything for me to do? And they said, how would you like to be ambassador to Japan? And she said, really? This is -- this is -- she said, I'll do it, she couldn't believe she got it and then they show the rest of the show is her being wined and dined by Abe and all of these killers. Wined and dined, she's being feted at a dinner and this and lunches and breakfasts she'll do anything, they want anything. So I have the smartest, toughest meanest in many cases, most horrible human beings on earth. I know 'em all, they're killers, they're negotiators, some are nice people, very few, some are nice people. But I will put the meanest, smartest, smarter... We have the best in the world, we don't use them. We use political hacks, diplomats, we use people that don't have any business ability. We have people. We use people that have never done a job. Somebody stole my plane, damn it. People are pointing up to the plane, no it's actually not mine. And you know, like as an example, Carl Icahn, did anyone ever hear of Carl? He's an -- he's an unbelievably brilliant tough business guy. So I called him, I had dinner with him two nights ago, I said, you know, Carl, I'm doing pretty well, I'm leading every poll. He said you're doing great. He can't believe it either. And I said, if I ever get there, I want you to oversee the negotiations with China. I can give him to -- he's extraordinary. China and Japan, I'll do, I'll, do it. He's like, I'll do it. Remember when I said, somebody has blood coming out of her eyes with hatred, right? Well, he had blood coming out him, he will do it. He is unbelievable negotiator, an unbelievable negotiator, and I know others, I know the best, I know the worst, I know the ones that are overrated, I know the ones that you've never heard about or read about that are better than all of them. But Carl's one of the greatest, I mean, he's very famous, very rich and he would love to do it, he would love -- he'd love to give -- give back and he knows what's happening, they're ripping us. So they send their stuff over here. And actually, somebody the other day said, what China has done to the United States is the greatest single theft in the history of the world, it's an interesting statement. We've rebuilt China, we've rebuilt China. So you know we have free trade. The problem with free trade is when you have free trade, very important, you need competent leaders, that's the one problem with free trade, I like free trade, I'm a free trader. The problem is you need great negotiators, the great leaders we don't have that. So we're getting killed by everybody. I used these three or four countries. We don't make good deals, everybody's killing us. So we will have unbelievable deals. A friend of mine is a manufacturer and he's trying to do business with China and what he's going through -- and he's a good manufacturer, makes great product better than what they did. They don't want him sending his stuff. Then he calls because, you know, it's impossible to do business I can't get my product they're dumping stuff over here comes in by the shipload. He said, it's impossible I can't get my pro... Finally gets a product in there and they judge him a massive tax, which they call a tariff because it sounds a little more sophisticated, right? And he calls me because it's impossible to do business with China. Boeing does business with China and they want all of their Intel, they want all of their copyrights, they want everything, otherwise, we're not buying planes. And they're now building big factories in -- I don't blame China. I mean, I respect them, not angry at them. I'm angry at our leaders for being so stupid, I'm not angry at China and Mexico is the same thing. You know, Mexico is the new China. The other day, Nabisco, Nabisco, Oreos, right? Oreos. I love Oreos, I'll never eat them again, okay? I'll never eat them again. No. Nabisco closes a plant -- they just announced a couple of days ago in Chicago and they're moving the plant to Mexico. Now, why? Why? Why? Have you heard my story? My favorite story is Ford. You've heard the story with Ford? Do we want to hear it again or not? Yes, all right. I mean that's a big one. So Ford, great company, they're building a $2.5 billion car factory in Mexico, now they're closing up places all over the United States, they're building this massive factory in Mexico. So I went to this great school, I was actually -- you know that I was hopefully still am really smart. I went to this great place, the Wharton School of -- the finest school to get into, even then it was hard to get into Wharton. But I went to this great business school and I get business, and I fully understand, I'm really good at this stuff. So they're building a $2.5 billion plant, they're gonna close factories in here, I said, they're gonna go and they're gonna build this plant, and they're gonna sell cars, they're gonna sell them back to us, they're, gonna sell them all over. Where does that help us? Tell me, explain, explain. There's no tax. There's no nothing, there's no nothing. So we're closing plants here, they're building this massive plant in Mexico, another plant, also another big foreign car company. There was a plant being built. It was all set to get started, they were going to announce it in Tennessee, you read about it. And this was a couple of months ago, Wall Street Journal, all set to get started, all of a sudden Mexico took it away and now it's not gonna be built in Tennessee, it's gonna be built in Mexico. So Ford is building a plant and here's what I did, I said to myself, I give myself this 'cause, it really is sort of right. I give myself this position and I say, let's assume that somebody else becomes president, wouldn't it be horrible? Would that be horrible? So let's assume somebody else becomes president, let's, assume a very low energy person, very, very low energy. So low energy that every time you watch him, you fall asleep, but let's say, he said, Hillary, yeah, Hillary too. So let's, say, Jeb becomes president, not good, not good. First thing that happens is like I said, your schools go to hell, people flow over the -- but forgetting about that. So let's say that Jeb doesn't want this plant built. So they're, gonna call him the Head of Ford and you're gonna say, Mr. President, we want to build it, he'll say, well, we don't want to build it. The next day or the next hour he's going to get a call from the lobbyists and the special interests and his donors and they're going to say, hey, Jeb, we gave you $8 million of your $120 million that you raised. We gave you $8 million. We want that thing done. You can't do that to our people. Oh, well, okay, I'll approve it's gonna get done, okay. The plant will get built that'll be it. Now let's take Trump as president. Okay. Is that better? Here's a simple question, who would you rather have negotiating with China, Japan, Mexico, any of them? Trump or Bush? Actually. Oh, what a group. Ah, what a group Well, you know, it's sort of interesting. Thank you. CNN does this big report that came out last week, so I was leading in the polls, so there was a poll, and everybody says, why don't I have a pollster? What the hell do I need a pollster? Every day I wake up there's another poll, right? You know, they pay these guys like $1,000 dollars a month and they can't function because unless they go and have it vetted with their pollster, they can't talk. And I say, why do I need a pollster when every day there's a new poll and they give like 30 pages. I don't have to get a pollster, what the hell do I need it? Save you money, okay? But -- but CNN did this really very, very expensive, very well done poll, it's only well done because I was leading by a lot, it wasn't -- I'd say, was it? And they had leadership, I was way ahead of everybody. They had -- actually, I was very good in warrior. You know the thing I'll be great at? That people aren't thinking, but the thing -- and I do very well at it, military, I am the toughest guy. I... I will rebuild our military. It will be so strong and so powerful and so great it will be so powerful and so great that we'll never have to use it. Nobody's going to mess with us folks, nobody, nobody, nobody's gonna mess with us. Beautiful. So I look at the various things to do with our country and by the way, one of them, boy, are we gonna take care of our vets, right? They did a poll, another poll, but they did a poll on like, who's one of the most popular with the vets? I was the most popular person, they liked me and I love them because, you know why? Because for 35 years, these senators and these -- other than Jeb, of course, I take Jeb, but these senators, these congressmen, these people in Washington including presidents, they have done nothing for the vets, they have done nothing. And we're gonna take care of our vets. But -- so they do this poll, and in the poll, I score really high marks on almost everything other than they thought I wasn't a nice person. They said, who's the nicest? And I was like, pretty low in that poll, and I'm a nice person, but who cares? A woman came up to me. She said I'm not sure that you're nice enough to be president. I said, you know what, this is not going to be an election based on a nice person it's going to be based on a competent person, we're tired of the nice people . So, I won on the economy, I won on jobs, I won on leadership by massive numbers, like massive, you've seen it. I won on all these categories, I said, why do we need an election? We don't need an election, these are such important categories. But I have had an amazing experience because, from the time I announced, almost, other than the first week, it was a rough week, they were hitting me. But the press, which is by the way largely very dishonest, I have to say this, the political media, I actually think -- I actually think that the political media is less popular than Congress. Can you believe it? And Congress is almost -- Congress says almost no rating. And and in all fairness, because look at all those cameras, they're all live and they're trying to shut off the camera right now. But you know what they're all live and so many live cameras. But look at -- thank you. But I will say this, the media is very dishonest, but there is a certain group that are fantastic people and every once in a while I'll get an honest story and I love it. I cherish those stories, they're not often, but they cherish those there. But we -- we have -- you have to understand and they have -- they really started treating me much better. Don't forget, when I first ran, I said, you know it's amazing, went to a great school, excellent student, smart guy. My uncle was a professor at MIT. He was a smart guy, you know, good smart guy, right, good family. Do we believe in the gene thing? I mean, I do. Right? You know, I do. Like they used to say, Secretariat doesn't produce slow horses. Actually, secretary wasn't one of the best, if you want to know the truth, but in theory that's -- But then I went out, I made a tremendous cop -- build tremendous fortune and great company. I did The Art of the Deal and many books that were bestsellers. The Art of the Deal was one of the biggest selling, maybe the biggest selling business book of all time. I did The Apprentice, we love The Apprentice. Tremendous. NBC hates me, you know NBC hates me because they renewed The Apprentice and I said, excuse me, I'm not doing it I'm running for president I'm gonna make the country great again. They actually -- they actually came up to my office and the top people, great people from NBC and they said, please, please, run, run. And I said, I'm not running, I mean, I'm not running. He said, we already renewed the show, they've sold most of the advertising. They renewed the show, I said, I'm gonna run and I'm going to make our country great, we're gonna do something that's nice, we're gonna do something that's nice. I'm hired. You're hired. So, so I look at the landscape of our country, I look at where we're going, I look at where we've been, we've had a horrible number of years, a horrible number of years. We can't beat ISIS. I watched The General the other day on television who's just retiring, which is fortunate. How do you think will do against ISIS? Oh, I don't know it's gonna be very tough. Can you believe this? General George Patton, General Douglas MacArthur are spinning in their graves as you listen to this, they're spinning in their graves. He talks about a hard time and I look at what's going on with the landscape and then I get to meet all of the people that I've met over the last period of time and I want to tell you it's been -- it's been amazing, it's been really amazing and I want to finish up with a couple of little points. One of them is, the Ford deal, right? Israel, I love Israel. Oh, by the way the bottom line on Ford, 'cause some of you -- I love this story because there's -- so when I get the call, I say, no, no, no, you're gonna build in the United States, they're gonna say, no, we don't want to do that. I see, let me tell you, sir, you're gonna build in the United States and I will be called by people, but I will not have any of their money, so I don't care and they're gonna say, and I'll call them in, and I'll say, listen, here's the story, you're building $2.5 billion in Mexico, we're gonna charge you a tremendous little 35% tax, okay, 35%. And that tax is going to be for every car and every part and every truck that comes into the United States. And here's what's going to happen, here's what's going to happen as sure as you're standing or sitting there going to come back to me, the following day, I would say, the following afternoon, let's say it's 12:00, I say by the time the day -- and I don't need Carl Icahn underneath, this one is too easy, and they're going to come back and they're going to say, Mr. President and now then I'm going to het called by the lobbyists, I'm going to get called by this spinster, and I'm gonna say no interest, no intere -- and within 24 hours they will call and they'll say, Mr. President, what you're doing to us is terrible. We will build the unit into the United States. We will build the plant in the United States. A hundred percent and I'll say the same thing to Nabisco. It doesn't help us. It doesn't help us. When you look at what's going on when you look at what's going on, where Nabisco's closing in so many places are closing. When you look at the kind of money that these countries are making and I'm naming a few, I mean, so many countries, we don't have anything left, we're running on fumes, we're running on fumes, there's nothing here. When you look at what happens they're so much sharper, they're so much smarter and we're not going to have a country left, we need to have our borders. We need to make great deals. You know, the man in the back just shouted Israel. How would you like to be Israel right now? They relied on us, they're a voice of sanity, they're great people and we have a deal that is so incompetent, so bad. Think of the deal, we make a deal. Our chief negotiator goes into a bicycle race at 73 years old, he falls, he breaks his leg that was the good part of our deal. That was the only thing that happened. No, think of it. And I told people last week because I told this last week, I swear to you, I will never ever ride a bicycle, at least in a race, but I won't ride one anyway. But we have a new thing that just came up yesterday in the deal, we know all about the 24-day period, right? But the 24-day period that doesn't start that clock doesn't start ticking for a long time, for a long time. So that could be forever. So if they're doing something, believe me by the time we get there. But here's the all-time great, first of all, why aren't they giving us back our prisoners? And second, can you believe this? Can you believe it? And second of all, the other day, it was determined that Iran, in a very important section, may be the most important, right, is going to do their own policing. They are going to the police, they are going to police and they are going to tell us, we swear we're not building anything. It's so -- it's so sad, it's so sad. Obamacare. We are going to repeal and replace Obama. We -- we are going to come up with a plan and there are so many different ways. You know you don't know this because you don't think of Obama this way. Do you know who the biggest beneficiaries of Obamacare are? The insurance companies, the insurance companies? Remember I told you, special interests and lobbyists, the insurance companies love it. We can have such great plans if we'd get rid of the artificial lines around every so -- I have a huge, I have a huge company and when I negotiate it's like get one group, they don't -- you can't, negotiate. Some of the people that own businesses know what I'm talking about. The insurance companies are so protected, they're making a fortune we're gonna end, that we're gonna make it so competitive. We're gonna get rid of the artificial barriers, you're gonna get such great plans. And Obamacare, I mean, you look at what's happening with your premiums, I mean, look at this, look at what's happening, just take a look at what's happening to the deductibles, they're so high it's impossible, it's, impossible. Trade, we're gonna fix it, health care, we're gonna fix it, women's health issues, we're gonna fix it. You know, my wife came up to me the other day and she said, it's really sad because people don't understand how you cherish women. I want -- I will protect women who are so important to me, so important, and I heard some of the other candidates, Jeb and some of the others the other day, saying we're not going to fund various women's health issues, can you believe this? I said that's the end of his election, women I don't think like that too much, do we agree? And he said, we're not going to fund women's health issues, a few hours later he came back and he said, he misspoke. Oh, okay, he misspoke. But women's health issues, so important we're going to end up taking our country, we are going to make it so strong, so powerful, so loved by people again. So loved, you know, one of the problems that we have, and you don't see it tonight, but you see, it is a tremendous lack of spirit. And I actually thought that President Obama, the one thing, he was inexperienced, he never produced the job, lots of other things. But I actually thought that he would be a great -- a really great cheerleader for the country when he was elected, I thought that he would and he's really turned out to be a great divider as opposed to a great unifier, really have. And you look at Baltimore, you look at Ferguson, you look at St. Louis last night, over the last week, you look at all the things that are happening. We're sitting on powder kegs, there's no spirit, there's no jobs, there's no anything. We are going to take this country, I am going to be the greatest jobs president that God ever created, I will tell you this, I will tell you. You are going to be so proud, you know, I often times say, the American dream is dead, but I'm going to make it bigger and stronger and more powerful than ever before. And and that's what's going to happen. I am going to make this country bigger and stronger and better, and you're going to love it and you're gonna love your president and we're going to turn this place around and you're gonna be so proud. And you know our whole theme is, Make America Great Again. We are going to make America better than it's ever been and we're gonna love doing it and we're gonna have fun doing it and I just want to thank everybody because this has been really, really special. Thank you. Thank you very much."}