{"id":513,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Campaign Speech in Hampton, NH","date":"2015-08-14","link":"https://factba.se/transcript/donald-trump-speech-hampton-nh-august-14-2015","paragraphs":["Beautiful. It's so nice. So nice. So they say, we set a record here tonight. Now I'm going to make the people outside angry, but they love me and I love them. And we have over a thousand people outside. We have hundreds of people in the second auditorium, but you, people, got the good real estate, right?","You got the good real estate. So this has been an amazing period of time. I know it's very early, but the polls have been through the roof. Every one of them. Every one of them. Because -- and I don't know if it's for me or if it's for the message or maybe it's a combination of both. But you know, I brought back a term that hasn't been used in a long time.","It's called the silent majority. There's a tremendous silent majority that that politicians have taken advantage of. I mean they have taken advantage of the people of this country long enough. They're largely incompetent except when it comes to getting re-elected. That's what they do. And look, who knows them better than me? I've contributed to everybody.","And who knows them better than me? They're great at one thing. Don't make any waves. Get re-elected. Serve it out. Then get re-elected again. That's it all the time. I've been watching it for so many years, and I personally am sick and tired of it. So backstage, I met some of the vets, the greatest people we have in this country.","And they've been mistreated. They've been treated like third-class citizens and it's gonna stop. It's gonna stop. As you look at these senators and the congressmen, they ride around. They're like kings. They think Great. Oh, isn't it great. They come. They make speeches. Nothing ever happens. So two weeks ago, on Wednesday, they had the longest waits in reception rooms and reception areas in the history of the Veterans Administration.","People waiting three days, four days, five days to see a doctor. To see a doctor. So we are gonna straighten it out. It's called management. It's called management. That's all it is. The military is going to be so strong in this country that nobody is gonna mess around with the United States. That I can tell you.","That I can tell you. Nobody. You know, over the last few weeks, Jeb Bush, in favor of Common Core, weak on immigration, not good on military, can you believe thought the Iraq war was a good thing. I mean, look, you can make a mistake. I was against it for a long time. I'm the most militaristic person in this room, but you have to know when to use it. You have to know when to use it. Think about it. We spend $2 trillion in Iraq, and by the way, China is taking out a lot of the oil just so you understand.","ISIS may have it and Iran may have it, but China has taken out a lot of the oil. Can you imagine, we spent -- we we never do anything right with China. We spend $2 trillion, thousands of lives of great people, mostly great young beautiful people, wounded warriors, who I love all, over the place, all over the place, not treated properly, by the way.","And we have nothing. And Iran is taking over Iraq and the parts that they want to give up, they are giving oil to ISIS. So ISIS has the oil and you remember when I said, you shouldn't go in and, in fact, just check it. Reuters wrote an article, big article in 2004 that Trump -- don't go in because you're gonna ruin the balance.","You had Iran and Iraq, they were the same. They were twins that have wars for years, wars, boom. One goes this way. One goes that way one. And I said, if you take out one, the other one's gonna take over. Well, we took out one and look at the mess we have. We've destabilized the Middle East and it's a mess.","And Jeb Bush couldn't -- he didn't know the difference. He couldn't answer a question. Was Iraq a good thing or a bad thing? It's all right to say they made a mistake. Finally, after going to his pollster, who he pays a fortune to by the way. After five days, he said it was a bad thing. OK. So let's accept that.","That's OK. Then the other day I'm watching. Yesterday, and he's saying, well, we got Saddam Hussein out didn't we? I mean, I'm not a fan of Saddam Hussein. But he ran the place and he had no weapons of mass destruction. And now instead of Saddam Hussein, we have far more brutal. We have ISIS and we will have Iran because they're already making deals.","Two weeks ago, I read where the leaders of Iraq are visiting the leaders of Iran. What do we get out of this stuff? What do we get? We have stupid leadership. Now, if you remember, so I didn't want to go in. I was right. I didn't want to go and I was right. But then we were in and it was bad, and there were still bombings and all.","But it was bad but we're in. At some point, we have to go out, right? I mean, we can't stay there forever. We have to rebuild this country. We have to rebuild our country. You know, we have to. Our bridges are falling apart. Our roads are a mess. Our schools, our highways, everything, it's a mess. Our infra -- and who's better at infrastructure than Trump?","OK. OK. So look, at some point, we have to get out. They talk about the surge, the surge. Remember Bush's brother? He said, the war is over. We've taken over. You know, like there were two days later, it was a disaster. Now, Obama said it with Yemen. He announced Yemen was a total victory. And then like three months later, it was like a disaster.","And we don't have Yemen. We don't have anything. We send over to our allies. If you call them that. They don't even know what they are. There is no word for it, OK? Iraq isn't even a country. Iraq is a bunch of corrupt people that sort of string something together. It's not a country. But we send over to our allies 2,500 Humvees.","So when I heard 2,500, I thought it was a typo in the New York Times. I said they mean 25. They mean, 2.5. They 250, maybe that's a lot. So these are 2,500 Humvees armor plated all over. So when the bombs go off, you don't lose your legs and you don't lose your life and you don't lose your arms. Really great vehicles.","One shot is fired and these guys run away and the enemy picks up 2,500. Now think of it. Think of it. So we need the right thinking. And I said -- and some people said, what a terrible statement he made. Because when we had to leave -- you had to leave. You know you can talk about surging up but at some point we have to leave.","We can't stay there forever. And if we'd loosen up some of these ridiculous rules, we have so much oil under our own feet. We don't need them anymore for those things because of new technologies. New technology. So we're gonna leave. And I say, leave but take the oil. Do you remember that? Did anyone ever hear me say that?","I'm saying it all the time. I've been saying it for years. Take the oil. And I watch these guys on television, political people, many of them are with the administration. And I think they mean well but they don't have a clue. They'd say, isn't that silly. Mr. Trump says take the oil. Isn't it? Well, you know has the oil now?","Iran, ISIS. Everybody has but us. We're the only ones without the oil. It's hard to believe. We need General Douglas MacArthur who's -- I thought he was great. You know, to this day, the highest academic record -- I'm big into school and academics. I love it. I went to the greatest school. You had to be really smart to get into that school.","The Wharton School of Finance. But you got to be really smart. And that was before I was Trump, you know? That was before I was Trump. But you have to be really smart. That's like the hardest one. But you know even then, by the way. But General Douglas MacArthur to this day was the greatest student in the history of West Point.","Plus he had the look. He had the whole deal. He was a general. I don't see it now so much. I don't want to knock any of the generals but I'll see some of these guys come on. Can we defeat ISIS? I don't think so. No, I don't want to use names but you know, he's sort of retiring this guy. Then you have General George Patton.","So do you think General Patton -- when President Obama, remember not so long ago, he said we're gonna attack a certain city. And he said, in two weeks, we're gonna attack this city and we're gonna attack it from the front. And we'll use drones and we're gonna use this with -- No, at the meantime, the enemy is saying, huh.","Bing, bing and it was brutal. It turned out to be a brutal situation. And I said, you know, that's great. That's camouflage. What a smart thing he's doing because he's probably gonna do the opposite. Well, in two weeks, we attacked. We attack from there. It was the craziest thing I've ever seen. And it was a terrible.","Something that should have taken 24 hours was like months. And I said, I wonder what General MacArthur and General Patton, just to name two of the great ones, are doing right now in their grave. You know they're doing? Spinning. They're spinning. They're saying, I don't believe it. I don't believe it. So we have such a great country, but we've gone down so far.","China yesterday, I'm big for the world of financial. And I tell you what, CNN did a poll and I was through the roof on the economy. I was like really high. I have to be exactly accurate because otherwise, they'll have a front page story that Donald Trump gave false. But I mean I was many times number two.","I was through the roof for leadership. That's a pretty important subject, great leadership. I killed everybody on leadership, right? I did great on the military, and I actually think the military would be just as good as the economic for me. Personally, I think I'd be so good. I know would I be tough? Huh.","These poor people. I would be creating things that nobody would be playing with us. Nobody. Nobody. And I don't necessarily mean soldiers. I mean -- and we love our soldiers. But I mean, you know, we have weaponry that's obsolete. We have nuclear weapons. Can you believe, 60 Minutes they do a show. And the whole show was how bad a condition our nuclear weapons are in. Did anybody see that show?","I said, can you write? I said, even if it's true. Can you believe we're putting this for the world to see. For Putin to see. By the way, two weeks after that show, Putin said they better not mess with us. We have nuclear weapons. Can you imagine Putin said from Russia. And the reason they did that is the president wanted the press to see how weak our nuclear -- remember the telephones?","They don't work. There were 40 years old and they have wires and the wires were rotting. And in order to work the telephones, where our silos are and the silos were all rusty and rotting. And the picket said, nice kids. They said we, don't know if it works. Oh great. Oh. And they're screaming over the phone because the wires are so damaged and so old and this is our nuclear.","Now, assuming that's true, which it is. Who the hell would show that to the enemy? And the reason he did is because he wants some funding to get them fixed up. Oh that's great. So we have to get smart people, tough people, cunning people. China. You probably read -- some of you aren't into this. But basically, yesterday, they did the largest devaluation in the history of China.","Now, they think the history but they actually say only in the last two decades. Oh, OK. Now, I feel much better. Some people said in history, but they actually brought it down to two decades. In other words, 20 years. OK. OK. What that means is you hear that sucking sound. You know what the sucking sound is? That means jobs.","That means money. That means all of this coming out. They did a number on us. And I said -- when they did the last one, which wasn't long ago, like six, seven months ago, but it was a much more modest devaluation. I said, I can't believe that Obama is allowing this to happen and we have all the cards. I just told the press, it's the greatest theft in the history of the United States what China has done to us. We have rebuilt China.","Our money has rebuilt China. You go over to China, there are bridges being built all over the place. I mean bridges that make the George Washington Bridge and other bridges look small and I'm not using the George Washington Bridge for political purposes, OK? Please. Because I wouldn't do that. But it makes like the George like small time.","They're building massive bridges, massive highways, massive roads. I went over -- I was in Dubai, great place. They have an airport. It's like magic. It's the most incredible thing you've ever seen. You go to Qatar. You go to places in China, many cities in China, you go to all these places and then we go home and we land at LaGuardia.","Or we landed Kennedy where they have hangars that are falling down. They're rotting and rusting and there are potholes in the runways. No, it's such a shock. You know, we don't realize it. You know, we go to Kennedy, we go to Florida, we go whatever and we don't -- you know, after a while, you get used to things.","You know what I mean? Like when your house gets dirty or when it needs a paint job, you say it looks OK, right? But these airlines are so bad. Thank you. These airlines, it's so, it's so sad. It's so sad. Then you look at the age of our infrastructure. You look at all of the different things, even the airlines, the airplanes.","I was asked by -- because they're actually a tenant of mine. Qatar, which they call cutter. I've always said Qatar. They've asked me why I call it cutter? But I said, people in this country, they like Qatar better, right? Don't we like it? They say cutter. But I like Qatar. I mean they're very nice people.","And they asked me to go to a dinner and I said, I can't. And they said, we'll pay you a lot of money. As rich as I am, I mean, it was a lot of money to have a dinner. Like, you know, like a tremendous amount of money. So I said, I'll go. It's true. No. You have to understand. You can be really rich, but if you're gonna get hundreds of thousands of dollars to have a dinner two blocks from your house and you don't do it, it's time to retire.","Do we agree? Do we agree? So anyway, so I went. And it was so amazing. And I said to the head man of the airline, what is the average age of your planes? And he said like, oh about a year and a half. A year and a half. And then they showed charts where the average age of like some of our airlines, you know, 32 years, 15 years, 28 years and you see it. And then I said, how do you finance your planes?","And he looked at me like, finance? We don't finance. We pay cash. Saudi Arabia. And it was very impressive. I mean I was impressed. It wasn't a question. And then when I went to Qatar, cutter. I went into an airline terminal. That was the most beautiful terminal I have ever seen ever, the most magnificent.","They had lounges. They had spas. They had spas. Before you get on the plane, you can get a massage. I'm not into that though. I don't like people touching me. It's true. It's true. It's true actually. But they have these magnificent spas. Everything. I said to the head man who is taking me for a tour. I said, this is the most beautiful airline terminal I've ever seen.","It was massive. He goes, no, no, no, Donald. This is temporary. Our new one is being built over there and he pointed. And there must have been 40 cranes, the longest most beautiful thing you've ever seen. This was a tear down. And I said, oh, we're doing it wrong. Saudi Arabia and I have great relationships with Saudi Arabia, as I do with Mexico, as I do with everybody.","You know, they all buy apartments for me. They pay millions and millions of dollars. Am I supposed to dislike them? I love them. China. I sell apartments for $50 million, $30 million, $25 million, $18 million. Some of the cheap ones, like $10 million. OK. Those are the cheap ones. I don't even bother to sign those contracts.","But I get it from Saudi Arabia. I get it from Japan. I get it from everybody. I love these people. The problem is -- Mexico. I love the Mexican people have tremendous spirit. Tremendous spirit. You know when I opened, as Rush Limbaugh said, who's a great guy, Trump has taken more incoming than any human being I've ever seen.","And it was only because the press totally changed my statement. They use a half a sentence. They used a sentence from behind. It turned out I was right because I was talking about illegal immigration. And it turned out that I was right with all of the problems that are happening. But when you look at Saudi Arabia, when you look at Mexico -- by the way, Mexico is becoming the new China.","They are taking our -- you know that Nabisco, Nabisco. Did you see it yesterday? Nabisco is closing a factory in Chicago and then moving to Mexico. This big factory and taking many jobs. I think there are about 1,200 jobs gonna be lost in Chicago. No more Oreos. They make Oreos don't they, right? No more Oreos.","I don't like Oreos anymore. But now they announce and they're doing other things and they're moving Mexico. And it's great. I mean look, Mexico, if you can get away with it, it's great. I have such respect for the leaders of Mexico and their negotiators. So I don't dislike them. The biggest bank in the world is a bank -- a tenant in my building, one of my buildings.","It's an incredible bank. It's the largest bank. Citibank is like a tiny subsidiary compared to this one in size. And I never have to worry about the rent, right? But -- so I love these people. Apartments. This with Mexico, I've hired, as an example, thousands -- over the years thousands of people have worked for me from Mexico and from lots of other places.","They're incredible people. But the problem is their leaders are smarter and sharper and more cunning than our leaders. They're much more cunning. The word cunning is very important because it's like sort of streety. You know, they know what's going on. And they are ripping us left and right. All of these countries.","Frankly, I mean I could mention 100. Every -- we don't make good deals anymore. So one of our great dealmakers, you probably heard of him, Carl Icahn, right? Good smart guy, right? So I had dinner with him the other night. I said, Carl, if I do this and I'm really doing well. I mean, hey, are we leading in every poll?","Every single poll. And it's the talk of politics. I mean, it's really become the talk of politics. It's like a great honor but we got to get there. You know, I don't want to talk about it. I want to get there. I was called by one of the biggest journalists in the world the other day. He said, Mr Trump, could I ask you a question?","What? How does it feel? How does it feel? I said, how's what feel? He said, you have done something that nobody else has ever done. You've taken over television. You've taken over the airwaves. It's the summer of Trump. You know, they're calling it the summer of Trump. No. OK. And I said -- and this is a highly respected guy, an amazing guy.","And I said, I haven't done anything because I haven't won. I mean if this all happens and I don't win -- it starts with winning the primaries, getting the nomination and then going on and winning. I consider it a total waste of time. He said, you're wrong. You've done a great thing. Trust me. I won't be happy, OK? I won't be happy.","But we're all doing well. Think of this. So if you look at Saudi Arabia, they make a billion dollars a day, a billion. We're talking about a billion dollars a day, OK? And when they have a problem, we send over our ships, we send over a plane and I don't mind doing that. But they got to help us out, folks.","They got to help -- they get nothing but money. They're wonderful. They're wonderful. I love they're investing in the United States. I love they're investing in New York and buying -- but they got to help us. We're a debtor nation. We owe $19 trillion. We have massive unfunded liabilities. We're a nation that's in serious trouble.","And it's going up rapidly and Obamacare is a total disaster. It's a catastrophe. It's got to be repealed and replaced. It's got to be. First of all, your premiums. I don't even have to see it. Your premiums have gone way up. Your deductibles are through the roof. Unless you're hit by a tractor, right? It's true.","And the reason I mentioned tractor I'll tell you. So Japan now has a great leader named Abe. He's a killer. Our negotiator is Carolyn Kennedy. Who got the job by going into the White House and saying, I have nothing to do. This was on television. They said, how did you get the job? And she's a nice person.","You know, why I say she's nice because my daughter, Ivanka, likes. My daughter is so great. She's such a great person. My daughter likes her. She said, Daddy, she's such a nice person. I don't want nice. I want a killer. We're tired of the nice people. Somebody said it to me, Mr. Trump -- I don't know -- a woman, who's a fan of mine.","She said, I don't know if you have the personality to get elected because you're not a nice person. I said, actually, I am a nice person. I love helping people. You watch. You watch. I will help on women's health issues more than anybody, including on the Democratic side. Women's health issues. You watch.","You watch. Bush, the other day, didn't want to fund them. He said, I don't want to fund women's health issues. He didn't want to fund. That's worse than Romney's 47%, which probably cost him the election along with other things, like he forgot to campaign for about three weeks at the end, OK? That didn't help.","Forgot to go on television for about three weeks. But we have to do something and we have to do it fast. And if we don't do it fast, we're not gonna have a country. Now speaking of that, speaking of that, you know it's funny I got a great review on a speech the other night. They say his only problem is he speaks through his applause.","You know why? I don't have time to wait for the applause. I want to just do it. It's true. A guy gave me like this great review. He said, he's a great speaker. He does beautifully. He's said, he's not scripted, which is good. Supposing I was reading all this stuff you know with the teleprompters. I actually said, if you're running for president, you should not be allowed to use a teleprompter.","No, it's true. It's true. It's so easy. No. You walk up. You walk. Ladies and gentlemen, hello. No, no. You shouldn't be allowed because you don't know what you're gonna get. Look, what happened with Obama. We used a teleprompter guy. No, it's true. But you're better right. You don't want a scripted president.","And you don't want a politically correct president because it takes too much long. Takes too much time. It's true. It's true. You don't want this political correctness stuff. Now, I hear there's a certain college. I won't say it's in your state. But they don't want you to differentiate between a man and a woman.","You heard about this one, right? If that ever passed, I'm gone. That's dumb. But the things that are happening are so crazy. And you know, you talk about political rigor, you probably heard about the little debate we had just recently. If I were politically correct during that debate, I would have gotten clobbered.","And instead, we won the debate. And you know, after the debate, all the poll numbers went up. But boy, was that a hell of a time. Was that incredible? Was that incredible? So that debate, that debate has always had like 2 million, 3 million people. You know, the first debate, bomb, bomb, bomb, every four years.","They're 24 million people and probably gonna go up much higher than that when the final numbers come in. So do you think they were there for Jeb Bush or Rand Paul? Rand. Rand, I've had you up to here. It's funny, though, because Rand Paul -- sit down. I'll ask a question. Go ahead sit down. I'm thinking he wants a guy.","That's OK. He is a good guy. I've seen his face before. He's been at every rally. I mean, what I'm gonna do not take his question? I'll take your question. No, no wait. So Rand Paul has been hitting me because he's like -- his polls is like going down. He's weak on military. Can you imagine today being weak on the military?","You know what, even Dove is so strong. I have a friend, I mean this friend didn't want to even talk about military. Now, he's become worse than me. I mean, he's become like this total incredible Hulk and that's great. So Rand Paul is weak on the military. He's weak on immigration. He's weak on everything.","He's got no numbers. So all of a sudden, I see him. And you know he called me up. He said, I'd love to -- it's like a year ago. He wants to play a round of golf with me. I said, oh no. Don't. Don't. So I'm actually a good golfer. I killed him, OK? I killed him. If I didn't, I wouldn't say it but I killed.","But more importantly, after the run, he said, do you think you could do me a favor? What? Could you contribute to my eye center? I said, you know what, what do they do? Bam, bam, bam. I said, yes. I will. I gave him a lot of money. I'm not -- I don't want to -- I just give him a lot of money. Then all of a sudden, I see him chirping on the stage.","He's like chirping. I said, who is that over there? That person? Who is he? And now he's going around, you know, saying like weird things, whatever, you know. And the beauty is this, nobody ever attacked me like Senator Lindsey Graham. I mean what he said. And he went from 1% to nothing. It's true. Nobody ever attacked me. Nobody like Perry of Texas.","Who by the way, did a lousy job at the border. I mean, he's talking about the border. The guy was governor and he keeps talking about the border. I say, you're governor of Texas, why didn't you fix it? The new governor is doing much better than him. But we won't say that, OK? Because he's actually a nice man and he didn't like it when I said you have to pass an IQ test to come up on the stage.","He said, no. He said to me, Donald Trump is keeping a senator, by the way, a failed senator off the stage. I said, wait a minute. Went to the best schools. Great student. Went out and made a fortune. Did The Apprentice, one of the most successful shows on television ever. NBC renewed it. I said, I'm not doing it. NBC comes up, renewed -- the biggest people in NBC came to my office four months ago.","Please do it. Please, please. I said, I'm not doing it. I'm gonna make this country great again. I'm gonna run for president. We're gonna make the country great. I wrote many bestsellers, including -- many bestsellers, including Trump the Art of the Deal, which was about the number one selling business book of all time.","There, he's got it. I said the other night, my second favorite book. Did you know what I said it's first favorite book? The Bible. That's true. It's the same thing. And I didn't ask him to stand up. Actually, I got my biggest hand the other night when I said that. I said my favorite book is The Bible. My second favorite book is The Art of the Deal, but it's not even close, the Bible is much.","It's not even. But anyway, so these people they went down. So now, I have, I have a new guy coming. It's Rand Paul and that's OK. And actually Carly was a little nasty to me. Be careful, Carly, be careful. But I can't say anything to her because she's a woman and I don't want to be accused of being tough on women.","I can't do that, right? Can I do that? Women. Am I allowed to fight back? Am I allowed? She's been a little nasty to me. So I promised that I wouldn't say it. And I said it to myself. I promised I wouldn't say that she ran Hewlett-Packard into the ground. I said I will not say it that her stock value tanked, that she laid off tens of thousands of people and she got viciously fired.","I said I will not say that. And that she then went out and ran against Barbara Boxer for the United States Senate in California. And it's a race that should have been won and she lost in a landslide. And I said I will not say that, OK? All right. So I'm not going to say it. So our country has tremendous potential.","We have to take back our jobs from China and all of the other people. We have to renegotiate our trade deals by getting people like Carl Icahn and Henry Kravis and our great deal man. We have the greatest deal makers in the world. Like Carl is very busy. I called him. He said, you're doing great. You're doing great.","Tough guy. You're doing great. Every poll, you're doing amazing. I said, Carl, do me a favor. Just relax. I want to do this. If I win, you take China. I'll get somebody else to take this one. I'll get some -- we will have our best and these people -- Carl, I think he's a nice guy. But some of them are not nice.","Some are horrible human beings, OK? But they're the greatest in the world. Do we want nice people or do we want these horrible human beings negotiating for? Horrible. I want horrible. I want the horrible ones. We will make great trade deals. We will save Social Security without cuts. We will come up with health care plans that will be phenomenal.","Phenomenal. That will be less expensive. We have to get rid of the little artificial circles I call them the insurance company circles. You know what I mean. You're in the business. We have to get rid of the artificial circles wrapping around the states, all paid for by your local insurance companies because they have monopolies.","I have a huge company. And if I'm in New York, I get like no bids. I get one bid, OK? I go to New Jersey, where I have a lot of stuff, I go to California, where I have a lot of stuff, I go to Florida, there's no bids because they have a monopoly in their little state. So they'd rather have a monopoly than be able to negotiate all over the country.","In other words, you'd rather have New York sewed up than have competition where they have to actually go and work for their money. That's over. That's over. That's over. And you'll have phenomenal plans. You'll have them for much less money. The insurance companies will not be happy. But see, they don't give me money they give to Jeb and they give to Hillary and they give to everybody.","I don't want their money. I was called today by the biggest lobbyist and who I've used, scrape, can do anything. He said, Donald, I'd love to make a major contribution to your campaign. I said, I don't want your money. No, no, no, you don't understand. It was like he'd never heard this before. He said, I want to really, you know, give $4 million or $5 million if it's OK. You're leading in all the polls.","You know, they have to protect. You know, if Trump wins, they've got to protect themselves, right? I said, you know, you're a friend of mine. You're a good guy. I don't want your money. Because what he's gonna do is if I win and when one of his companies has a problem -- I'm gonna do what's right for the people of the country.","I'm not gonna do what's right for him and his people. So you have the special interest people and you have all of these lobbyists and you have the donors. And I will tell you, nobody is gonna control us. We're gonna work this together and we're gonna make it so strong and so great. I used the concept of the Ford plant being built in Mexico.","It shouldn't be built there. We want it built in Michigan. We want it built in -- we want it built in New Hampshire. We want it built in Iowa. How does it help us? How does it help us? You go to the great business schools and you do really well. And then you come home and you say, well, look let's figure this out.","They're gonna spend $2.5 billion building a plant in Mexico. They're gonna make cars, trucks and parts and they get to ship it back to the United States. How does that help us? And we get no tax. We get no tax. So when Jeb becomes president, if that ever happens, or when Hillary, if that ever happens, or when -- hey, it could happen, folks.","I hate to tell you. I think it's unlikely. I think, it's unlikely. But if Jeb became president, when they say Mr. President, it's very bad that Ford is building in Mexico. Oh OK, we'll do something. Let me go to sleep first. We'll do something. We'll do something about it. As soon as he says we'll do something.","Hey, he's not stupid. The lobbyists will call him. They gave him some of $114 million and the donors and the special interests. They say, well, wait a minute, we have stock in Ford. We want Ford to do what they want to do. You have to -- and the lobbyist will go up to him and say, Mr. President, you can't do this.","These people gave you $2.5 million. Oh they did. That's right. I can't do it. And they'll build happily and they'll have a nice plant and we'll lose thousands of jobs and you know, terrible. Now what I'd say is different. They will call me too but I wouldn't even take that call. But I might take them because some of them were actually nice guys.","I'll take them say no. I'll start the conversation, no. And I wouldn't use Carl or anybody in this because you know -- and by the way, I hope the press calls Carl Icahn because he feels very strongly about this and he wants to do it. He's so anxious to do it. He's got -- he's wealthy. I think they all want to do it. You know a guy like Carl Icahn is worth many billions of dollars.","He wants to do it. This is more important to him than a deal. He doesn't need another deal. I said, Carl, how many deals can you do? Just make -- the great deal is this country. That's the great deal. We're gonna make this country rich and then we got to make it right. And I've said the same thing to others.","OK, so they come up to Trump and I wouldn't call any of these guys because this is too easy. Too easy. So the head of Ford calls me up and he says, Mr. President, we really want to build this plant in Mexico. I'd say, well, congratulations. But you're not gonna do it. Well, we're gonna go forward. That's OK. Then we're gonna charge you 35% tax on every car and truck and part that comes into our -- every single one 35%. He says, you can't do that.","I said, I could. Trust me I could do it. Trust me. And what happens is probably they fold before five o'clock. It could be they'll play tough and they'll wait till the next day. I say, they fold before five o'clock. And the reason is -- the reason I wouldn't waste the time of the killers I told you about, the great negotiators because it's just too easy.","This is too easy. This is a couple of phone calls. So what happens now is the next day, they'll call up and they'll say, please, Mr. President. I'll say, no. I want you building in the United States. And if you do it, that's the way it is. And they will say, Mr. President, we're building our plant in the United States.","It's that simple. It's that simple. Who would let, who would let Nabisco, Nabisco, who would let Nabisco go to Mexico? Who would let these car companies. In Tennessee, they were expecting a great deal with a major foreign car company. It's gonna be built in Tennessee. It was all set. Gonna be built in Tennessee.","It was gonna be a great deal and all of a sudden, at the last moment, they announced they're not gonna do it in Tennessee. They're doing it Mexico. Who would allow this to happen? That -- Obama. You're right about that. That's a very good answer. It won't happen, believe me, with Trump. It won't happen. It won't happen.","Go ahead. I mean, this guy -- I hope this question is worth it. This guy has been standing up for the entire thing. I hope this is gonna be a good question. Go ahead.","Counterfeits, substandard parts in nuclear plants in the United States. I'm not surprised to hear that. Why am I surprised?","He's a nice guy. Did I do the right thing in letting him ask? By the way, he happens to be right. Look, you don't even have to tell me. I guarantee you they have substandard parts in nuclear and in airplanes because they get it from China. And when you get from China, you don't know what the hell you're getting.","Go ahead, finish your question real fast.","Hey, come on. You know, I got to go.","You know, what I think your question is great. And I can understand. He's talking about basically counterfeit parts just to cut to the chase. We don't have to know that you're in the nursing home business. What are you trying to talk to some of us about joining your little home? Come on. Sit down. We think it's good.","We think your point is good. Yeah. Give it to him. Good. I'll read it tonight around 1:00 in the morning instead of sleeping. All right. It's good. It's good. Go sit. Come on. Come on. Let's go. What a nice guy, right? Nice guy. Hey, he means well. Honestly, he means well. You do. Stand up. You stand up. This guy I love.","Tell me how bad are the vets being treated? Way worse than we understand.","It's a tremendous problem. It's suicide in the vets.","Yeah. I've been hearing about it so much. The suicide rate is unbelievable","It can't be -- great question. It can't be just incompetence because it's so bad what's happening to the vets and the VA. It's so bad that it can't be just incompetence. It's got to be theft and it's got to be a lot more than we're hearing about. So I would do that. Thank you, man. Go ahead. Come on.","OK. I got it. I love it. Thank you. Go ahead. Let's take it. You want to take it? Who wants to leave? Does anybody want to leave? No. I have all night. Let's take a couple of questions. Go ahead. Go ahead.","Well you have to, but not only the VA. How about the EPA? How about the EPA, right? How about our Common Core folks in Washington. How about Common Core in Washington? You think you could get rid of a few there? You're right. Right. Good question. Yes, sir. Go ahead. Young guy here.","You know my uncle was a professor at MIT. So that's good.","He's smart guy. Go ahead.","Right. We have no victories. Do we have victories? When do we beat somebody in trade? We don't, we don't beat anybody. We have so many victories. We're gonna have so many victories, they're gonna be pouring out of your Harvard educated years. You watch. Go ahead.","Yes. Honestly, I think it's wonderful. I want to rebuild our infrastructure first, OK? I think it's wonderful. Go ahead. Yeah. Go ahead. Get wait for that Mike. Go ahead. Come on, let's get with it here. All right, just shout. Go ahead.","It's a total top priority for me. I have so many friends whose family is devastated by Alzheimer's. So it's -- believe me. It's a total priority. That's something that we should be working on and we can get an answer. There is some answers. They made less progress than we had hoped, as you know. But there is some answers.","Yes, ma'am. Yes.","In the people? I mean, honestly, I've had such a great response. So I love the question. Somebody -- one of my friends -- thank you. One of my friends was asking me, what's it like when you go up? Because I've been here a lot. And you know, we've we've done so many town halls and so many different meetings and now we're really we're having so many people.","We need the bigger auditoriums, which work out well. And now you know I'm gonna go see the other auditorium where they didn't have the great real estate, right? And I'm gonna see the people outside that are waiting to see us. But the people of New Hampshire are amazing. They're like the people that built this country.","They work hard. You know, I say, they're smart, they're industrious and they love this country. They want to see it happen. They're great people. And I was so honored, you know, because recently everybody said that Walker would win Iowa, right? And Bush who's falling like a stone because he's sort of like, you know, I don't know Kenny bunk for -- tell me is that really here?","It's not -- that's from a different planet, right? I don't get it. But they said Bush, well, he's being down big. And Walker, you have to remember Walker grew up a little bit in Iowa, became the governor of the adjoining state. But what people don't know is they have tremendous massive deficits. They have very, very poor employment new jobs.","They have a lot of dissension, a lot of problems in Wisconsin, which is a state I love. But they have a lot of problems. With their education, they're having a lot of problems and with their debt. They're putting tremendous amounts of debt. So it was sort of funny. I was very nice to Walker. He came up to my room.","I gave him money for his campaign. I give to everybody. Anybody who wants to run. You know, I give a lot of money to people, right? So I gave him money. He came up to see me about six months ago. He gave me a plaque. He gave me a plaque. You need some money? Here. But he gave me a plaque and it was very nice.","And then I was very nice to him because I can't be mean to somebody that doesn't like -- you know, there are a couple of guys running that have been so nice to me and I cannot say bad about. I want to. And then one of his underlings said something sort of nasty about me. I said, oh finally, I can talk about Wisconsin.","It was so good. And he plunged in Iowa and I'm leading Iowa big. And we're leading -- right? And we're leading New Hampshire big. And you know, we're leading Nevada big. And what I loved about Nevada. They did a second part of the poll. And the second part of the poll you saw it. It came out last week. Everybody was really shocked.","I wasn't because I'm gonna bring jobs back into this country. I'm leading all candidates in the Hispanic vote. Everybody was surprised. I said, why are you surprised? I employ thousands and thousands of Hispanics. They're amazing people. But people were surprised to see that. So I'm leading. North Carolina, we're leading by massive numbers.","South Carolina, we're leading by massive numbers. We're leading everywhere. In a poll came out, 32% nationwide. Another one, 24% Fox. CNN came out, it was a massive poll. We're leading because people are tired of what's happening to our country. They're tired of being ripped off by everybody in the world.","They're tired of it. You know, the American Dream. We talk about it and I use the expression a lot. The American dream and we have -- look at all those cameras blazing back there. This is live all over the place on Fox, on CNN, it's live. I get up to make a speech and I speak from the heart. I really do. I don't have -- look, there's nothing.","I speak from the heart. But but a big portion -- not all of it. But a big portion of the media, the political media in particular is so dishonest. They're really dishonest people. And you probably heard me say, I always say -- I like to say the American dream is dead but I'm gonna make it bigger and better and stronger than ever before, OK? I say it all the time.","The American Dream is dead, but I'm gonna make it bigger, better, stronger than ever. OK. So I say it all the time. So I go home a month ago and my wife saw me speaking on television. And she said, Darling, that was such a horrible thing you said. It was so nasty. I said, what did I say? You said the American dream is dead.","I said no. I said it's dead, but we're gonna make it great, right? So I turn on television, TiVo. I turn on television and I see it and it says, the American dream is dead boom period. I said that's terrible. No, it's so dishonest. But the fact is a lot of people think it is dead and it's got a lot of problems.","There's no question about it. But we are going to make our country great again. We are going to do things with our country that are going to be so good and so smart and so spectacular. And we are going to be respected by the world again and not laughed at like we're all a bunch of stupid people being led by incompetent politicians.","It's not gonna go on any longer. We're not gonna take it any longer. We're going to make America great again. Thank you. And I love you people. I love you people. Thank you. Thank you very much. Thank you. Thank you. Thank you. Thank you."],"text":" Beautiful. It's so nice. So nice. So they say, we set a record here tonight. Now I'm going to make the people outside angry, but they love me and I love them. And we have over a thousand people outside. We have hundreds of people in the second auditorium, but you, people, got the good real estate, right? You got the good real estate. So this has been an amazing period of time. I know it's very early, but the polls have been through the roof. Every one of them. Every one of them. Because -- and I don't know if it's for me or if it's for the message or maybe it's a combination of both. But you know, I brought back a term that hasn't been used in a long time. It's called the silent majority. There's a tremendous silent majority that that politicians have taken advantage of. I mean they have taken advantage of the people of this country long enough. They're largely incompetent except when it comes to getting re-elected. That's what they do. And look, who knows them better than me? I've contributed to everybody. And who knows them better than me? They're great at one thing. Don't make any waves. Get re-elected. Serve it out. Then get re-elected again. That's it all the time. I've been watching it for so many years, and I personally am sick and tired of it. So backstage, I met some of the vets, the greatest people we have in this country. And they've been mistreated. They've been treated like third-class citizens and it's gonna stop. It's gonna stop. As you look at these senators and the congressmen, they ride around. They're like kings. They think Great. Oh, isn't it great. They come. They make speeches. Nothing ever happens. So two weeks ago, on Wednesday, they had the longest waits in reception rooms and reception areas in the history of the Veterans Administration. People waiting three days, four days, five days to see a doctor. To see a doctor. So we are gonna straighten it out. It's called management. It's called management. That's all it is. The military is going to be so strong in this country that nobody is gonna mess around with the United States. That I can tell you. That I can tell you. Nobody. You know, over the last few weeks, Jeb Bush, in favor of Common Core, weak on immigration, not good on military, can you believe thought the Iraq war was a good thing. I mean, look, you can make a mistake. I was against it for a long time. I'm the most militaristic person in this room, but you have to know when to use it. You have to know when to use it. Think about it. We spend $2 trillion in Iraq, and by the way, China is taking out a lot of the oil just so you understand. ISIS may have it and Iran may have it, but China has taken out a lot of the oil. Can you imagine, we spent -- we we never do anything right with China. We spend $2 trillion, thousands of lives of great people, mostly great young beautiful people, wounded warriors, who I love all, over the place, all over the place, not treated properly, by the way. And we have nothing. And Iran is taking over Iraq and the parts that they want to give up, they are giving oil to ISIS. So ISIS has the oil and you remember when I said, you shouldn't go in and, in fact, just check it. Reuters wrote an article, big article in 2004 that Trump -- don't go in because you're gonna ruin the balance. You had Iran and Iraq, they were the same. They were twins that have wars for years, wars, boom. One goes this way. One goes that way one. And I said, if you take out one, the other one's gonna take over. Well, we took out one and look at the mess we have. We've destabilized the Middle East and it's a mess. And Jeb Bush couldn't -- he didn't know the difference. He couldn't answer a question. Was Iraq a good thing or a bad thing? It's all right to say they made a mistake. Finally, after going to his pollster, who he pays a fortune to by the way. After five days, he said it was a bad thing. OK. So let's accept that. That's OK. Then the other day I'm watching. Yesterday, and he's saying, well, we got Saddam Hussein out didn't we? I mean, I'm not a fan of Saddam Hussein. But he ran the place and he had no weapons of mass destruction. And now instead of Saddam Hussein, we have far more brutal. We have ISIS and we will have Iran because they're already making deals. Two weeks ago, I read where the leaders of Iraq are visiting the leaders of Iran. What do we get out of this stuff? What do we get? We have stupid leadership. Now, if you remember, so I didn't want to go in. I was right. I didn't want to go and I was right. But then we were in and it was bad, and there were still bombings and all. But it was bad but we're in. At some point, we have to go out, right? I mean, we can't stay there forever. We have to rebuild this country. We have to rebuild our country. You know, we have to. Our bridges are falling apart. Our roads are a mess. Our schools, our highways, everything, it's a mess. Our infra -- and who's better at infrastructure than Trump? OK. OK. So look, at some point, we have to get out. They talk about the surge, the surge. Remember Bush's brother? He said, the war is over. We've taken over. You know, like there were two days later, it was a disaster. Now, Obama said it with Yemen. He announced Yemen was a total victory. And then like three months later, it was like a disaster. And we don't have Yemen. We don't have anything. We send over to our allies. If you call them that. They don't even know what they are. There is no word for it, OK? Iraq isn't even a country. Iraq is a bunch of corrupt people that sort of string something together. It's not a country. But we send over to our allies 2,500 Humvees. So when I heard 2,500, I thought it was a typo in the New York Times. I said they mean 25. They mean, 2.5. They 250, maybe that's a lot. So these are 2,500 Humvees armor plated all over. So when the bombs go off, you don't lose your legs and you don't lose your life and you don't lose your arms. Really great vehicles. One shot is fired and these guys run away and the enemy picks up 2,500. Now think of it. Think of it. So we need the right thinking. And I said -- and some people said, what a terrible statement he made. Because when we had to leave -- you had to leave. You know you can talk about surging up but at some point we have to leave. We can't stay there forever. And if we'd loosen up some of these ridiculous rules, we have so much oil under our own feet. We don't need them anymore for those things because of new technologies. New technology. So we're gonna leave. And I say, leave but take the oil. Do you remember that? Did anyone ever hear me say that? I'm saying it all the time. I've been saying it for years. Take the oil. And I watch these guys on television, political people, many of them are with the administration. And I think they mean well but they don't have a clue. They'd say, isn't that silly. Mr. Trump says take the oil. Isn't it? Well, you know has the oil now? Iran, ISIS. Everybody has but us. We're the only ones without the oil. It's hard to believe. We need General Douglas MacArthur who's -- I thought he was great. You know, to this day, the highest academic record -- I'm big into school and academics. I love it. I went to the greatest school. You had to be really smart to get into that school. The Wharton School of Finance. But you got to be really smart. And that was before I was Trump, you know? That was before I was Trump. But you have to be really smart. That's like the hardest one. But you know even then, by the way. But General Douglas MacArthur to this day was the greatest student in the history of West Point. Plus he had the look. He had the whole deal. He was a general. I don't see it now so much. I don't want to knock any of the generals but I'll see some of these guys come on. Can we defeat ISIS? I don't think so. No, I don't want to use names but you know, he's sort of retiring this guy. Then you have General George Patton. So do you think General Patton -- when President Obama, remember not so long ago, he said we're gonna attack a certain city. And he said, in two weeks, we're gonna attack this city and we're gonna attack it from the front. And we'll use drones and we're gonna use this with -- No, at the meantime, the enemy is saying, huh. Bing, bing and it was brutal. It turned out to be a brutal situation. And I said, you know, that's great. That's camouflage. What a smart thing he's doing because he's probably gonna do the opposite. Well, in two weeks, we attacked. We attack from there. It was the craziest thing I've ever seen. And it was a terrible. Something that should have taken 24 hours was like months. And I said, I wonder what General MacArthur and General Patton, just to name two of the great ones, are doing right now in their grave. You know they're doing? Spinning. They're spinning. They're saying, I don't believe it. I don't believe it. So we have such a great country, but we've gone down so far. China yesterday, I'm big for the world of financial. And I tell you what, CNN did a poll and I was through the roof on the economy. I was like really high. I have to be exactly accurate because otherwise, they'll have a front page story that Donald Trump gave false. But I mean I was many times number two. I was through the roof for leadership. That's a pretty important subject, great leadership. I killed everybody on leadership, right? I did great on the military, and I actually think the military would be just as good as the economic for me. Personally, I think I'd be so good. I know would I be tough? Huh. These poor people. I would be creating things that nobody would be playing with us. Nobody. Nobody. And I don't necessarily mean soldiers. I mean -- and we love our soldiers. But I mean, you know, we have weaponry that's obsolete. We have nuclear weapons. Can you believe, 60 Minutes they do a show. And the whole show was how bad a condition our nuclear weapons are in. Did anybody see that show? I said, can you write? I said, even if it's true. Can you believe we're putting this for the world to see. For Putin to see. By the way, two weeks after that show, Putin said they better not mess with us. We have nuclear weapons. Can you imagine Putin said from Russia. And the reason they did that is the president wanted the press to see how weak our nuclear -- remember the telephones? They don't work. There were 40 years old and they have wires and the wires were rotting. And in order to work the telephones, where our silos are and the silos were all rusty and rotting. And the picket said, nice kids. They said we, don't know if it works. Oh great. Oh. And they're screaming over the phone because the wires are so damaged and so old and this is our nuclear. Now, assuming that's true, which it is. Who the hell would show that to the enemy? And the reason he did is because he wants some funding to get them fixed up. Oh that's great. So we have to get smart people, tough people, cunning people. China. You probably read -- some of you aren't into this. But basically, yesterday, they did the largest devaluation in the history of China. Now, they think the history but they actually say only in the last two decades. Oh, OK. Now, I feel much better. Some people said in history, but they actually brought it down to two decades. In other words, 20 years. OK. OK. What that means is you hear that sucking sound. You know what the sucking sound is? That means jobs. That means money. That means all of this coming out. They did a number on us. And I said -- when they did the last one, which wasn't long ago, like six, seven months ago, but it was a much more modest devaluation. I said, I can't believe that Obama is allowing this to happen and we have all the cards. I just told the press, it's the greatest theft in the history of the United States what China has done to us. We have rebuilt China. Our money has rebuilt China. You go over to China, there are bridges being built all over the place. I mean bridges that make the George Washington Bridge and other bridges look small and I'm not using the George Washington Bridge for political purposes, OK? Please. Because I wouldn't do that. But it makes like the George like small time. They're building massive bridges, massive highways, massive roads. I went over -- I was in Dubai, great place. They have an airport. It's like magic. It's the most incredible thing you've ever seen. You go to Qatar. You go to places in China, many cities in China, you go to all these places and then we go home and we land at LaGuardia. Or we landed Kennedy where they have hangars that are falling down. They're rotting and rusting and there are potholes in the runways. No, it's such a shock. You know, we don't realize it. You know, we go to Kennedy, we go to Florida, we go whatever and we don't -- you know, after a while, you get used to things. You know what I mean? Like when your house gets dirty or when it needs a paint job, you say it looks OK, right? But these airlines are so bad. Thank you. These airlines, it's so, it's so sad. It's so sad. Then you look at the age of our infrastructure. You look at all of the different things, even the airlines, the airplanes. I was asked by -- because they're actually a tenant of mine. Qatar, which they call cutter. I've always said Qatar. They've asked me why I call it cutter? But I said, people in this country, they like Qatar better, right? Don't we like it? They say cutter. But I like Qatar. I mean they're very nice people. And they asked me to go to a dinner and I said, I can't. And they said, we'll pay you a lot of money. As rich as I am, I mean, it was a lot of money to have a dinner. Like, you know, like a tremendous amount of money. So I said, I'll go. It's true. No. You have to understand. You can be really rich, but if you're gonna get hundreds of thousands of dollars to have a dinner two blocks from your house and you don't do it, it's time to retire. Do we agree? Do we agree? So anyway, so I went. And it was so amazing. And I said to the head man of the airline, what is the average age of your planes? And he said like, oh about a year and a half. A year and a half. And then they showed charts where the average age of like some of our airlines, you know, 32 years, 15 years, 28 years and you see it. And then I said, how do you finance your planes? And he looked at me like, finance? We don't finance. We pay cash. Saudi Arabia. And it was very impressive. I mean I was impressed. It wasn't a question. And then when I went to Qatar, cutter. I went into an airline terminal. That was the most beautiful terminal I have ever seen ever, the most magnificent. They had lounges. They had spas. They had spas. Before you get on the plane, you can get a massage. I'm not into that though. I don't like people touching me. It's true. It's true. It's true actually. But they have these magnificent spas. Everything. I said to the head man who is taking me for a tour. I said, this is the most beautiful airline terminal I've ever seen. It was massive. He goes, no, no, no, Donald. This is temporary. Our new one is being built over there and he pointed. And there must have been 40 cranes, the longest most beautiful thing you've ever seen. This was a tear down. And I said, oh, we're doing it wrong. Saudi Arabia and I have great relationships with Saudi Arabia, as I do with Mexico, as I do with everybody. You know, they all buy apartments for me. They pay millions and millions of dollars. Am I supposed to dislike them? I love them. China. I sell apartments for $50 million, $30 million, $25 million, $18 million. Some of the cheap ones, like $10 million. OK. Those are the cheap ones. I don't even bother to sign those contracts. But I get it from Saudi Arabia. I get it from Japan. I get it from everybody. I love these people. The problem is -- Mexico. I love the Mexican people have tremendous spirit. Tremendous spirit. You know when I opened, as Rush Limbaugh said, who's a great guy, Trump has taken more incoming than any human being I've ever seen. And it was only because the press totally changed my statement. They use a half a sentence. They used a sentence from behind. It turned out I was right because I was talking about illegal immigration. And it turned out that I was right with all of the problems that are happening. But when you look at Saudi Arabia, when you look at Mexico -- by the way, Mexico is becoming the new China. They are taking our -- you know that Nabisco, Nabisco. Did you see it yesterday? Nabisco is closing a factory in Chicago and then moving to Mexico. This big factory and taking many jobs. I think there are about 1,200 jobs gonna be lost in Chicago. No more Oreos. They make Oreos don't they, right? No more Oreos. I don't like Oreos anymore. But now they announce and they're doing other things and they're moving Mexico. And it's great. I mean look, Mexico, if you can get away with it, it's great. I have such respect for the leaders of Mexico and their negotiators. So I don't dislike them. The biggest bank in the world is a bank -- a tenant in my building, one of my buildings. It's an incredible bank. It's the largest bank. Citibank is like a tiny subsidiary compared to this one in size. And I never have to worry about the rent, right? But -- so I love these people. Apartments. This with Mexico, I've hired, as an example, thousands -- over the years thousands of people have worked for me from Mexico and from lots of other places. They're incredible people. But the problem is their leaders are smarter and sharper and more cunning than our leaders. They're much more cunning. The word cunning is very important because it's like sort of streety. You know, they know what's going on. And they are ripping us left and right. All of these countries. Frankly, I mean I could mention 100. Every -- we don't make good deals anymore. So one of our great dealmakers, you probably heard of him, Carl Icahn, right? Good smart guy, right? So I had dinner with him the other night. I said, Carl, if I do this and I'm really doing well. I mean, hey, are we leading in every poll? Every single poll. And it's the talk of politics. I mean, it's really become the talk of politics. It's like a great honor but we got to get there. You know, I don't want to talk about it. I want to get there. I was called by one of the biggest journalists in the world the other day. He said, Mr Trump, could I ask you a question? What? How does it feel? How does it feel? I said, how's what feel? He said, you have done something that nobody else has ever done. You've taken over television. You've taken over the airwaves. It's the summer of Trump. You know, they're calling it the summer of Trump. No. OK. And I said -- and this is a highly respected guy, an amazing guy. And I said, I haven't done anything because I haven't won. I mean if this all happens and I don't win -- it starts with winning the primaries, getting the nomination and then going on and winning. I consider it a total waste of time. He said, you're wrong. You've done a great thing. Trust me. I won't be happy, OK? I won't be happy. But we're all doing well. Think of this. So if you look at Saudi Arabia, they make a billion dollars a day, a billion. We're talking about a billion dollars a day, OK? And when they have a problem, we send over our ships, we send over a plane and I don't mind doing that. But they got to help us out, folks. They got to help -- they get nothing but money. They're wonderful. They're wonderful. I love they're investing in the United States. I love they're investing in New York and buying -- but they got to help us. We're a debtor nation. We owe $19 trillion. We have massive unfunded liabilities. We're a nation that's in serious trouble. And it's going up rapidly and Obamacare is a total disaster. It's a catastrophe. It's got to be repealed and replaced. It's got to be. First of all, your premiums. I don't even have to see it. Your premiums have gone way up. Your deductibles are through the roof. Unless you're hit by a tractor, right? It's true. And the reason I mentioned tractor I'll tell you. So Japan now has a great leader named Abe. He's a killer. Our negotiator is Carolyn Kennedy. Who got the job by going into the White House and saying, I have nothing to do. This was on television. They said, how did you get the job? And she's a nice person. You know, why I say she's nice because my daughter, Ivanka, likes. My daughter is so great. She's such a great person. My daughter likes her. She said, Daddy, she's such a nice person. I don't want nice. I want a killer. We're tired of the nice people. Somebody said it to me, Mr. Trump -- I don't know -- a woman, who's a fan of mine. She said, I don't know if you have the personality to get elected because you're not a nice person. I said, actually, I am a nice person. I love helping people. You watch. You watch. I will help on women's health issues more than anybody, including on the Democratic side. Women's health issues. You watch. You watch. Bush, the other day, didn't want to fund them. He said, I don't want to fund women's health issues. He didn't want to fund. That's worse than Romney's 47%, which probably cost him the election along with other things, like he forgot to campaign for about three weeks at the end, OK? That didn't help. Forgot to go on television for about three weeks. But we have to do something and we have to do it fast. And if we don't do it fast, we're not gonna have a country. Now speaking of that, speaking of that, you know it's funny I got a great review on a speech the other night. They say his only problem is he speaks through his applause. You know why? I don't have time to wait for the applause. I want to just do it. It's true. A guy gave me like this great review. He said, he's a great speaker. He does beautifully. He's said, he's not scripted, which is good. Supposing I was reading all this stuff you know with the teleprompters. I actually said, if you're running for president, you should not be allowed to use a teleprompter. No, it's true. It's true. It's so easy. No. You walk up. You walk. Ladies and gentlemen, hello. No, no. You shouldn't be allowed because you don't know what you're gonna get. Look, what happened with Obama. We used a teleprompter guy. No, it's true. But you're better right. You don't want a scripted president. And you don't want a politically correct president because it takes too much long. Takes too much time. It's true. It's true. You don't want this political correctness stuff. Now, I hear there's a certain college. I won't say it's in your state. But they don't want you to differentiate between a man and a woman. You heard about this one, right? If that ever passed, I'm gone. That's dumb. But the things that are happening are so crazy. And you know, you talk about political rigor, you probably heard about the little debate we had just recently. If I were politically correct during that debate, I would have gotten clobbered. And instead, we won the debate. And you know, after the debate, all the poll numbers went up. But boy, was that a hell of a time. Was that incredible? Was that incredible? So that debate, that debate has always had like 2 million, 3 million people. You know, the first debate, bomb, bomb, bomb, every four years. They're 24 million people and probably gonna go up much higher than that when the final numbers come in. So do you think they were there for Jeb Bush or Rand Paul? Rand. Rand, I've had you up to here. It's funny, though, because Rand Paul -- sit down. I'll ask a question. Go ahead sit down. I'm thinking he wants a guy. That's OK. He is a good guy. I've seen his face before. He's been at every rally. I mean, what I'm gonna do not take his question? I'll take your question. No, no wait. So Rand Paul has been hitting me because he's like -- his polls is like going down. He's weak on military. Can you imagine today being weak on the military? You know what, even Dove is so strong. I have a friend, I mean this friend didn't want to even talk about military. Now, he's become worse than me. I mean, he's become like this total incredible Hulk and that's great. So Rand Paul is weak on the military. He's weak on immigration. He's weak on everything. He's got no numbers. So all of a sudden, I see him. And you know he called me up. He said, I'd love to -- it's like a year ago. He wants to play a round of golf with me. I said, oh no. Don't. Don't. So I'm actually a good golfer. I killed him, OK? I killed him. If I didn't, I wouldn't say it but I killed. But more importantly, after the run, he said, do you think you could do me a favor? What? Could you contribute to my eye center? I said, you know what, what do they do? Bam, bam, bam. I said, yes. I will. I gave him a lot of money. I'm not -- I don't want to -- I just give him a lot of money. Then all of a sudden, I see him chirping on the stage. He's like chirping. I said, who is that over there? That person? Who is he? And now he's going around, you know, saying like weird things, whatever, you know. And the beauty is this, nobody ever attacked me like Senator Lindsey Graham. I mean what he said. And he went from 1% to nothing. It's true. Nobody ever attacked me. Nobody like Perry of Texas. Who by the way, did a lousy job at the border. I mean, he's talking about the border. The guy was governor and he keeps talking about the border. I say, you're governor of Texas, why didn't you fix it? The new governor is doing much better than him. But we won't say that, OK? Because he's actually a nice man and he didn't like it when I said you have to pass an IQ test to come up on the stage. He said, no. He said to me, Donald Trump is keeping a senator, by the way, a failed senator off the stage. I said, wait a minute. Went to the best schools. Great student. Went out and made a fortune. Did The Apprentice, one of the most successful shows on television ever. NBC renewed it. I said, I'm not doing it. NBC comes up, renewed -- the biggest people in NBC came to my office four months ago. Please do it. Please, please. I said, I'm not doing it. I'm gonna make this country great again. I'm gonna run for president. We're gonna make the country great. I wrote many bestsellers, including -- many bestsellers, including Trump the Art of the Deal, which was about the number one selling business book of all time. There, he's got it. I said the other night, my second favorite book. Did you know what I said it's first favorite book? The Bible. That's true. It's the same thing. And I didn't ask him to stand up. Actually, I got my biggest hand the other night when I said that. I said my favorite book is The Bible. My second favorite book is The Art of the Deal, but it's not even close, the Bible is much. It's not even. But anyway, so these people they went down. So now, I have, I have a new guy coming. It's Rand Paul and that's OK. And actually Carly was a little nasty to me. Be careful, Carly, be careful. But I can't say anything to her because she's a woman and I don't want to be accused of being tough on women. I can't do that, right? Can I do that? Women. Am I allowed to fight back? Am I allowed? She's been a little nasty to me. So I promised that I wouldn't say it. And I said it to myself. I promised I wouldn't say that she ran Hewlett-Packard into the ground. I said I will not say it that her stock value tanked, that she laid off tens of thousands of people and she got viciously fired. I said I will not say that. And that she then went out and ran against Barbara Boxer for the United States Senate in California. And it's a race that should have been won and she lost in a landslide. And I said I will not say that, OK? All right. So I'm not going to say it. So our country has tremendous potential. We have to take back our jobs from China and all of the other people. We have to renegotiate our trade deals by getting people like Carl Icahn and Henry Kravis and our great deal man. We have the greatest deal makers in the world. Like Carl is very busy. I called him. He said, you're doing great. You're doing great. Tough guy. You're doing great. Every poll, you're doing amazing. I said, Carl, do me a favor. Just relax. I want to do this. If I win, you take China. I'll get somebody else to take this one. I'll get some -- we will have our best and these people -- Carl, I think he's a nice guy. But some of them are not nice. Some are horrible human beings, OK? But they're the greatest in the world. Do we want nice people or do we want these horrible human beings negotiating for? Horrible. I want horrible. I want the horrible ones. We will make great trade deals. We will save Social Security without cuts. We will come up with health care plans that will be phenomenal. Phenomenal. That will be less expensive. We have to get rid of the little artificial circles I call them the insurance company circles. You know what I mean. You're in the business. We have to get rid of the artificial circles wrapping around the states, all paid for by your local insurance companies because they have monopolies. I have a huge company. And if I'm in New York, I get like no bids. I get one bid, OK? I go to New Jersey, where I have a lot of stuff, I go to California, where I have a lot of stuff, I go to Florida, there's no bids because they have a monopoly in their little state. So they'd rather have a monopoly than be able to negotiate all over the country. In other words, you'd rather have New York sewed up than have competition where they have to actually go and work for their money. That's over. That's over. That's over. And you'll have phenomenal plans. You'll have them for much less money. The insurance companies will not be happy. But see, they don't give me money they give to Jeb and they give to Hillary and they give to everybody. I don't want their money. I was called today by the biggest lobbyist and who I've used, scrape, can do anything. He said, Donald, I'd love to make a major contribution to your campaign. I said, I don't want your money. No, no, no, you don't understand. It was like he'd never heard this before. He said, I want to really, you know, give $4 million or $5 million if it's OK. You're leading in all the polls. You know, they have to protect. You know, if Trump wins, they've got to protect themselves, right? I said, you know, you're a friend of mine. You're a good guy. I don't want your money. Because what he's gonna do is if I win and when one of his companies has a problem -- I'm gonna do what's right for the people of the country. I'm not gonna do what's right for him and his people. So you have the special interest people and you have all of these lobbyists and you have the donors. And I will tell you, nobody is gonna control us. We're gonna work this together and we're gonna make it so strong and so great. I used the concept of the Ford plant being built in Mexico. It shouldn't be built there. We want it built in Michigan. We want it built in -- we want it built in New Hampshire. We want it built in Iowa. How does it help us? How does it help us? You go to the great business schools and you do really well. And then you come home and you say, well, look let's figure this out. They're gonna spend $2.5 billion building a plant in Mexico. They're gonna make cars, trucks and parts and they get to ship it back to the United States. How does that help us? And we get no tax. We get no tax. So when Jeb becomes president, if that ever happens, or when Hillary, if that ever happens, or when -- hey, it could happen, folks. I hate to tell you. I think it's unlikely. I think, it's unlikely. But if Jeb became president, when they say Mr. President, it's very bad that Ford is building in Mexico. Oh OK, we'll do something. Let me go to sleep first. We'll do something. We'll do something about it. As soon as he says we'll do something. Hey, he's not stupid. The lobbyists will call him. They gave him some of $114 million and the donors and the special interests. They say, well, wait a minute, we have stock in Ford. We want Ford to do what they want to do. You have to -- and the lobbyist will go up to him and say, Mr. President, you can't do this. These people gave you $2.5 million. Oh they did. That's right. I can't do it. And they'll build happily and they'll have a nice plant and we'll lose thousands of jobs and you know, terrible. Now what I'd say is different. They will call me too but I wouldn't even take that call. But I might take them because some of them were actually nice guys. I'll take them say no. I'll start the conversation, no. And I wouldn't use Carl or anybody in this because you know -- and by the way, I hope the press calls Carl Icahn because he feels very strongly about this and he wants to do it. He's so anxious to do it. He's got -- he's wealthy. I think they all want to do it. You know a guy like Carl Icahn is worth many billions of dollars. He wants to do it. This is more important to him than a deal. He doesn't need another deal. I said, Carl, how many deals can you do? Just make -- the great deal is this country. That's the great deal. We're gonna make this country rich and then we got to make it right. And I've said the same thing to others. OK, so they come up to Trump and I wouldn't call any of these guys because this is too easy. Too easy. So the head of Ford calls me up and he says, Mr. President, we really want to build this plant in Mexico. I'd say, well, congratulations. But you're not gonna do it. Well, we're gonna go forward. That's OK. Then we're gonna charge you 35% tax on every car and truck and part that comes into our -- every single one 35%. He says, you can't do that. I said, I could. Trust me I could do it. Trust me. And what happens is probably they fold before five o'clock. It could be they'll play tough and they'll wait till the next day. I say, they fold before five o'clock. And the reason is -- the reason I wouldn't waste the time of the killers I told you about, the great negotiators because it's just too easy. This is too easy. This is a couple of phone calls. So what happens now is the next day, they'll call up and they'll say, please, Mr. President. I'll say, no. I want you building in the United States. And if you do it, that's the way it is. And they will say, Mr. President, we're building our plant in the United States. It's that simple. It's that simple. Who would let, who would let Nabisco, Nabisco, who would let Nabisco go to Mexico? Who would let these car companies. In Tennessee, they were expecting a great deal with a major foreign car company. It's gonna be built in Tennessee. It was all set. Gonna be built in Tennessee. It was gonna be a great deal and all of a sudden, at the last moment, they announced they're not gonna do it in Tennessee. They're doing it Mexico. Who would allow this to happen? That -- Obama. You're right about that. That's a very good answer. It won't happen, believe me, with Trump. It won't happen. It won't happen. Go ahead. I mean, this guy -- I hope this question is worth it. This guy has been standing up for the entire thing. I hope this is gonna be a good question. Go ahead. 30 years worth of time. And Fox hasn't touched this. I've been in touch with Kelly too. There's counterfeits, substandard parts in most of the nuclear plants in the United States. Counterfeits, substandard parts in nuclear plants in the United States. I'm not surprised to hear that. Why am I surprised? And some of them have come from China. Now, when I brought this out, the NRC, Nuclear Regulatory Commission, accused me of conspiring to topple their agency. Had me in mass federal court for six years. Well, ideally it was for a short time. Now right now, you could do something for the state of Massachusetts and New Hampshire and I just got back from Chattanooga too and I spoke to some Marines there. That the security book me... He's a nice guy. Did I do the right thing in letting him ask? By the way, he happens to be right. Look, you don't even have to tell me. I guarantee you they have substandard parts in nuclear and in airplanes because they get it from China. And when you get from China, you don't know what the hell you're getting. Go ahead, finish your question real fast. Security -- the security booth at the Seabrook nuclear plant is empty right now. And the NRC said it's not required. OK? Now I got involved because I'm in the nursing home profession. Hey, come on. You know, I got to go. Oh no. Let me finish. You know, what I think your question is great. And I can understand. He's talking about basically counterfeit parts just to cut to the chase. We don't have to know that you're in the nursing home business. What are you trying to talk to some of us about joining your little home? Come on. Sit down. We think it's good. We think your point is good. Yeah. Give it to him. Good. I'll read it tonight around 1:00 in the morning instead of sleeping. All right. It's good. It's good. Go sit. Come on. Come on. Let's go. What a nice guy, right? Nice guy. Hey, he means well. Honestly, he means well. You do. Stand up. You stand up. This guy I love. Tell me how bad are the vets being treated? Way worse than we understand. You've got over 8,000 veterans a year that cannot get access to care and it is. Let me put this in context. 8,000 veterans are committing suicide because of the incompetence and the corruption going on at the VA system. That's just the ones committing suicide. It's a tremendous problem. It's suicide in the vets. Let me put this in context. That is the equivalent of a World War 2 Bataan Death March every year, OK? Yeah. I've been hearing about it so much. The suicide rate is unbelievable 47,000 veterans total for all kinds of other reasons. No one is being indicted. No one is going to jail. The VA OIG has been proven to be covering it up. That's why the OIG head of it just lost his job recently. When you are president, can I have your word that you will bring in the FBI and start investigating this VA because you need to clean it up. It can't be -- great question. It can't be just incompetence because it's so bad what's happening to the vets and the VA. It's so bad that it can't be just incompetence. It's got to be theft and it's got to be a lot more than we're hearing about. So I would do that. Thank you, man. Go ahead. Come on. I have to fight for this because my son is an active duty gunnery -- gunny sergeant in the United States Marine Corps and I will not let him walk into this nightmare like I did. OK. I got it. I love it. Thank you. Go ahead. Let's take it. You want to take it? Who wants to leave? Does anybody want to leave? No. I have all night. Let's take a couple of questions. Go ahead. Go ahead. Do you think you can fire some of these federal employees at the VA? Well you have to, but not only the VA. How about the EPA? How about the EPA, right? How about our Common Core folks in Washington. How about Common Core in Washington? You think you could get rid of a few there? You're right. Right. Good question. Yes, sir. Go ahead. Young guy here. I'm a NASA space technology research fellow at the Massachusetts Institute of Technology. You know my uncle was a professor at MIT. So that's good. So I'm in a joint program in MIT and Harvard Medical School and I'm actually a graduate of company. He's smart guy. Go ahead. When you announce that you're gonna run for president. You said that America needs victories again. Right. We have no victories. Do we have victories? When do we beat somebody in trade? We don't, we don't beat anybody. We have so many victories. We're gonna have so many victories, they're gonna be pouring out of your Harvard educated years. You watch. Go ahead. So in my industry, one of our biggest victories was putting man on the moon. What do you think about putting humans on Mars? Yes. Honestly, I think it's wonderful. I want to rebuild our infrastructure first, OK? I think it's wonderful. Go ahead. Yeah. Go ahead. Get wait for that Mike. Go ahead. Come on, let's get with it here. All right, just shout. Go ahead. My name is I've been a caregiver for nearly 10 years. My husband has younger onset Alzheimer's disease. My mother is almost 89. She's with me. I'm one of 65,000 Alzheimer's caregivers in here in the state of New Hampshire. And Alzheimer's receives $600 million from NIH while we're spending $153 billion in Medicare and Medicaid. So my question for you is what will you do to ensure that this devastating disease is a top priority? It's a total top priority for me. I have so many friends whose family is devastated by Alzheimer's. So it's -- believe me. It's a total priority. That's something that we should be working on and we can get an answer. There is some answers. They made less progress than we had hoped, as you know. But there is some answers. Yes, ma'am. Yes. I'm just curious. Just for a moment you may speak from the heart and tell us what specifically endears In the people? I mean, honestly, I've had such a great response. So I love the question. Somebody -- one of my friends -- thank you. One of my friends was asking me, what's it like when you go up? Because I've been here a lot. And you know, we've we've done so many town halls and so many different meetings and now we're really we're having so many people. We need the bigger auditoriums, which work out well. And now you know I'm gonna go see the other auditorium where they didn't have the great real estate, right? And I'm gonna see the people outside that are waiting to see us. But the people of New Hampshire are amazing. They're like the people that built this country. They work hard. You know, I say, they're smart, they're industrious and they love this country. They want to see it happen. They're great people. And I was so honored, you know, because recently everybody said that Walker would win Iowa, right? And Bush who's falling like a stone because he's sort of like, you know, I don't know Kenny bunk for -- tell me is that really here? It's not -- that's from a different planet, right? I don't get it. But they said Bush, well, he's being down big. And Walker, you have to remember Walker grew up a little bit in Iowa, became the governor of the adjoining state. But what people don't know is they have tremendous massive deficits. They have very, very poor employment new jobs. They have a lot of dissension, a lot of problems in Wisconsin, which is a state I love. But they have a lot of problems. With their education, they're having a lot of problems and with their debt. They're putting tremendous amounts of debt. So it was sort of funny. I was very nice to Walker. He came up to my room. I gave him money for his campaign. I give to everybody. Anybody who wants to run. You know, I give a lot of money to people, right? So I gave him money. He came up to see me about six months ago. He gave me a plaque. He gave me a plaque. You need some money? Here. But he gave me a plaque and it was very nice. And then I was very nice to him because I can't be mean to somebody that doesn't like -- you know, there are a couple of guys running that have been so nice to me and I cannot say bad about. I want to. And then one of his underlings said something sort of nasty about me. I said, oh finally, I can talk about Wisconsin. It was so good. And he plunged in Iowa and I'm leading Iowa big. And we're leading -- right? And we're leading New Hampshire big. And you know, we're leading Nevada big. And what I loved about Nevada. They did a second part of the poll. And the second part of the poll you saw it. It came out last week. Everybody was really shocked. I wasn't because I'm gonna bring jobs back into this country. I'm leading all candidates in the Hispanic vote. Everybody was surprised. I said, why are you surprised? I employ thousands and thousands of Hispanics. They're amazing people. But people were surprised to see that. So I'm leading. North Carolina, we're leading by massive numbers. South Carolina, we're leading by massive numbers. We're leading everywhere. In a poll came out, 32% nationwide. Another one, 24% Fox. CNN came out, it was a massive poll. We're leading because people are tired of what's happening to our country. They're tired of being ripped off by everybody in the world. They're tired of it. You know, the American Dream. We talk about it and I use the expression a lot. The American dream and we have -- look at all those cameras blazing back there. This is live all over the place on Fox, on CNN, it's live. I get up to make a speech and I speak from the heart. I really do. I don't have -- look, there's nothing. I speak from the heart. But but a big portion -- not all of it. But a big portion of the media, the political media in particular is so dishonest. They're really dishonest people. And you probably heard me say, I always say -- I like to say the American dream is dead but I'm gonna make it bigger and better and stronger than ever before, OK? I say it all the time. The American Dream is dead, but I'm gonna make it bigger, better, stronger than ever. OK. So I say it all the time. So I go home a month ago and my wife saw me speaking on television. And she said, Darling, that was such a horrible thing you said. It was so nasty. I said, what did I say? You said the American dream is dead. I said no. I said it's dead, but we're gonna make it great, right? So I turn on television, TiVo. I turn on television and I see it and it says, the American dream is dead boom period. I said that's terrible. No, it's so dishonest. But the fact is a lot of people think it is dead and it's got a lot of problems. There's no question about it. But we are going to make our country great again. We are going to do things with our country that are going to be so good and so smart and so spectacular. And we are going to be respected by the world again and not laughed at like we're all a bunch of stupid people being led by incompetent politicians. It's not gonna go on any longer. We're not gonna take it any longer. We're going to make America great again. Thank you. And I love you people. I love you people. Thank you. Thank you very much. Thank you. Thank you. Thank you. Thank you."}