{"id":518,"author":"Donald Trump","title":"Speech: Donald Trump Addresses the CPAC Convention in National Harbor, MD","date":"2015-02-27","link":"https://factba.se/transcript/donald-trump-speech-national-harbor-md-february-27-2015","paragraphs":["Well thank you very much. It's such an honor to be here at CPAC. We've done this before, the response has been so great. I love you people. You're really my kind of people. You're conservative, you work, you love the country, it's very simple. So a lot of people -- You're fired.","A lot of people think I'm doing this for fun. They think it's good for my brand and I'm here and I'm doing that and I'm a big successful guy. I'm not doing this for fun. I'm doing it because we have to take our country back our country. Our country is in serious, serious problem.","We have a president who's either incompetent, which I think he could be, or he's got his own agenda, which I know he does. I mean he does definitely have the agenda. Washington is totally broken and it's not going to get fixed unless we put the right person in that top position. It's just not going to happen.","Now, the problem I have, I'm not a politician. Thank goodness. Politicians are all talk no action. I've dealt with them all my life. The king of zoning the king of eve -- I deal with politicians. That's what I do. I deal with foreign leaders. I deal with people. In this country, our politicians are all talk, no action.","Now, I'm a conservative, I'm a Republican, but I look at what's going on with the Republicans. I'm almost more disappointed with the Republicans because... And you can go right now. I mean right now they're sitting over there and they're going to make a decision on whether or not to fund and I guarantee the answers we're going to fund, we're going to fund, we're going to keep doing it. Our president broke the law when he did what he did.","And you're going to have to take a tremendously strong action or you're going to have people just flowing into this country worse than it's ever been. They're coming in now by the thousands and it's going to only get worse. So the Republicans have to toughen up. They have to toughen up on the IRS.","They have to toughen up on Benghazi. They have to tough it up on everything. And most importantly perhaps other than immigration they have to toughen up on Obamacare, which is a total lie and which is a total and complete disaster. And when it kicks in, because it really kicks in, in 2016 when it kicks in you are going to see some catastrophic results.","People are getting out of business, companies are closing all because of Obamacare. So they have to do something about that. And they have to do it now. Now, when was the last time you heard something good about our country? Where we won, we beat China, we beat Mexico, we beat somebody. We never win. You don't hear good news about this country.","We are in a position where we just never win. And that's because of our leadership. You need somebody perhaps that wrote The Art of the deal, one of the great business books of all time. Now, you know, a little example; somebody said, \"I can't believe you got the old post office.\", you know, right down the road, meaning on Pennsylvania Avenue.","I wish it were right down the road. Eight down the road, Pennsylvania Avenue, I got a building, the Old Post Office great building. Everybody wanted it. GSA gave it out. We are doing an amazing job with it. It's under construction now for six months. The GSA gave it out. Obama gave it up. Trump got it. Now, is that good negotiating?","That was, in the history of the GSA, one of the most sought after properties ever, and Trump got it and people said to me, \"How the hell did you ever get it when Obama is in charge of the GSA?\" But that's the way it goes, folks. And maybe that's what we need some of. So it's really, really important that we have people at that top position that no -- because the country has such tremendous potential, unbelievable potential.","And we just are not using it. Now, on ISIS. Nobody. If I decide to run and win nobody would be tougher than Donald Trump. Nobody. I would hit them so hard and so fast. That they wouldn't know what happened. I would find a general, remember the old days of General MacArthur and General Patton, and these great generals.","Now we must have somebody in there. But I laugh as I say and it's laughed through tears as you say, \"Look, they're announcing when they're going to attack the other side. How often do you see that? In two weeks from now we're sending soldiers over here, we're going to attack this. General MacArthur is spinning in his grave when he sees what we do. So you got to hit him hard.","You've got to hit him firm and you can't play games. You got to go hard and fast and firm and there's somebody there that's going to do the job. Now, we have a thinking Bowe Bergdahl, we all know Berg -- We we sell. We make a deal. Bowe Bergdahl for five killers, five terrorists who are right now out there trying to kill us. This is the kind of thinking.","And you don't even hear anything about it and what people forget. It's like the one week schedule they forget the Bowe Bergdahl deal is emblematic of what's going on in this country. All our deals are like that and we can't let it continue to happen. Now, Iran. They can not have a nuclear weapon and we must protect Israel.","We must protect Israel. As far as our borders are concerned. We need strong borders. We need a wall. If I run I will tell you, the king of building buildings, the king of building walls. Nobody can build them like Trump, that I can promise you. I can promise you that. Executive order, we've got to knock it out.","We've got to knock it out fast. Common Core is bad. Bad. Second Amendment is good. Now. Really good. Now they want to take away your bullets, folks. I don't know if you've been seeing what's going on. They can't get the guns, now they want to go after the bullets. But the Common Core -- Look, I came down very hard on Mitt Romney because he let us down.","He really let us down. That should have been an election that was won. That was an easy election to win. I actually think probably easier than the next one coming up. There was no excuse for not winning that. I came down very strong. Likewise, Jeb Bush. He's in favor -- he's in favor of Common Core.","He's weak on immigration. Now think of it for a second. In favor of Common Core. He's weak on immigration. You remember his statement with they come over for love? That was his stance on immigration. I don't see him winning. I don't see there's any way you people are going to have to make your own choice.","Who knows. We have to rebuild our infrastructure. I go throughout the world. I'm all over the world. And I see China and I see Abu Dhabi. I see places that you wouldn't believe. You go to Qatar. You go to Saudi Arabia you see bridges and tunnels and airports and just roadways that are so magnificent, they're paved in gold.","And then you come home and you land at LaGuardia or you land at LAX in Los Angeles. You land at Kennedy Airport in New York. And they're like Third World places. Our roads are crumbling, everything's crumbling. And we're rebuilding China. It's got to stop and we have the cards, remember that. We have the cards.","Social Security I'm the only Republican that's going to say this and I don't know people going to love it or not but I think we've got to make this country rich again. We can do it with smart leadership. And when we make it rich we can save Social Security, Medicare, and Medicaid and not cut it like almost every Republican wants to do. Let's cut Social Security, cut Medicare, cut med -- Now, you go after the fraud and abuse but you don't cut it. We make the country rich again.","We take back the jobs from China and other nations. And you're not going to have to cut Social Security, Medicare, etc. And nobody else is going to tell you that. We're at 18 trillion in debt. We're very soon going to be a lot more than that and we're going to reach $24 trillion. When we do that, that's a sacred number because that's a number from which there's almost no recovery.","So we better get going and we better get going fast. I just want to leave this with you. To be a winner, you have to think like a winner. Our country hasn't been thinking like a winner. We're totally on the defense. We're being laughed at all over the world for our stupidity. We're giving things away. ISIS, you know where they have their military?","They take it from -- We leave it for Iraq and ISIS comes in and takes it. I see these trucks and these beautiful tanks. They're all American tanks. They have -- We have to use our head. We need brilliant leadership we can make America great again. There's tremendous potential in this country. And my whole concept is: Make America Great Again.","We can do it. Thank you. Thank you. Thank you. Thank you. Thank you very much. And now we have Sean Hannity. Where is Sean? Come on, Sean. Get out here, Sean.","Thank you, everybody. Thank you.","We'll stand. Let's stand.","Nice to see you.","They do very well buying in Macy's, that's right.","Primarily.","I did. And I thought Romney could do it and he let us down. I did. I love what I'm doing. I mean, look I love building. I'm building all over the world. I love it. More than anything else, I love it. But I love this country. My children now have grown Ivanka, Don, Eric they're very very ensconced in the company.","I have great executives. I can now let them run things and I have no problem. But you know when you're building it it's very hard for a person like me to run because I have a lot of things happening. A politician they run. What do they do? They run, they run, they lose, they win, they run. With me, I give up a lot when I do this.","I already told the Apprentice people. You know, NBC wanted to renew and I said I'm doing something else. It's very important to me. I'm doing something very important. So I'm looking at it very seriously. I don't want what happened to Mitt Romney to happen again because that was a tremendous blow for this country.","One to a hundred, I would say 75 and 80. I am really inclined. I want to do it so badly. You know I have the theme, it's my theme. It's Make America Great Again. That's what I want to do. We can do that in this country if we had people that know what they're doing. If we had people that are competent.","All right.","Right. As I said.","We don't count them. I mean, we have, they say 5.3 and 5.6%. I think it's over 20%. During the speech I said 20%.","You have to take the jobs back from China. You have to take the jobs back from Mexico. Mexico. In Iowa companies are leaving for Mexico. You have to take -- they've given incentive to leave our country and go to places like Mexico. And by the way, Mexico is the next China. Mexico folks is not our friend.","I hate to tell you this, but Mexico -- And I'm not just talking about the border. Mexico is ripping off the United States big, big league. And we'd better do something. But jobs going to China, to Mexico, to Brazil. They're going everywhere but here. And we've lost our manufacturing and we've lost our manufacturing base.","Sean, you hear about, as an example, Apple? Sure it's based here but they do all the work, they make all their product in China. It's wonderful place, wonderful. And I have -- I have tremendous experience with China. I've made a lot of money with China and I had some pretty hard times with China and I was the one that came out on top.","Believe me, this country can come out on top.","OK.","Well I'd start with ISIS. You have to just hit them and hit them hard. You've got to get rid of that whole situation. And you know, if you were going to ask me that question two years ago, three years ago probably it wouldn't have been the first thing on the agenda. But right now it's become so severe, so bad.","And I always said take the oil. They have the oil. ISIS first. Obamacare, I would repeal it and I would get something that would be so much better than Obamacare. So important. You look at every aspect of government. You look at regulation. EPA. You can't move. You can't do anything. Everything you want to do is stopped.","You have to do that. I would build a tremendously strong military. Our military has been -- has been let go and it's been let go badly. And you know being in the real estate business, all the time I get these listings for Army bases that are for sale and they're selling, I mean, I said, \"Are we going to have any army bases left?\" All the time.","So many bases are for sale. I say, \"What are we going to do about it?\" The vets, I would straighten out that whole mess. These vets are great people, amazing people. And I would straighten out that mess like you wouldn't believe and I'd be in there really fast and I would be working on Iran and I would be helping Israel big league.","There wouldn't be speeches made behind my back. I would be helping out Israel, big league. Because they deserve the help. And Iran has very, very bad intentions. When you look at this as negotiating 101. You look at a president who's negotiating and he drops the sanctions. Now I would have said triple up the sanctions.","So now they're not doing anything. They're not coming to a good conclusion. And I hear the deal is terrible. So when Bibi comes here it's gonna be very interesting what happens. But we have a president that truly doesn't know what he's doing.","Defeat. Well with ISIS I'd just hit him really hard and that would probably and, you know, a year ago you wouldn't have said it and nobody would've liked it. Now everybody likes it. You may have to have some boots on the ground for a period of time until you get rid of the cancer. That's number one. You may have to have left.","Look. They are cutting off -- They're cutting off the heads of people. They're burning people at the stake. It's like we're living in medieval times. You have to do something. As far as Iran is concerned. If they respected our leadership they'd negotiate. If we put sanctions all over the place they would negotiate.","They were being very badly hurt by sanctions. Now, they're not all of a sudden it's like they're not taking us seriously. With Iran sanctions all over the place. Believe me you can make the right deal if you have the right negotiator. You know part of the problem we have, Sean, we have people that are diplomats doing our nego -- They know nothing about negotiating.","All they know how to do is keep their job. They know nothing about negotiating. If we had the right people we could solve the ISIS problem and we could solve the Iran problem. And a lot more quickly than you think.","Well I would build a wall. It all starts with a wall. You have to build. You have to stop. And first of all it also has to go with Mexico having some respect for our country. They don't respect us whatsoever. People are flowing through Mexico. And what a lot of people don't realize the hardest country, one of the hardest countries to become a citizen of, you probably couldn't do it, is Mexico.","The people flow right through Mexico. They shove them through our borders and we have no idea. And by the way, you don't know where those people are coming from. They could have very, very bad intentions and they don't necessarily have to be from the areas that you think they are but they just walk into us.","Mexico is one of the hardest countries in this world to become a citizen of. But they just flow them right through our border. And I see it the other night on television. I'm watching and thousands of people they're just walking across the border. You have guards standing there. They just walk right across.","What are we stupid? It's just hard to believe that this can happen.","True.","I understand debt. I understand business better than anybody that's ever run in my opinion for office. Nobody's had the success in a business sense that I've had. I know how to get rid of debt. I would get rid of that debt and I would do it quickly because it's sitting out there and it is a time bomb for this country.","It's fine. But I like two plans. I like making the country rich again taking in tremendous amounts of money stopping China from ripping us etc. And also cutting costs but not cutting them when it comes to the military and not cutting them. When it comes to Social Security either.","OK. Well I'm very pro-life and feel strongly about it and with exceptions. Life of the mother etc. but I am pro-life.","Yes.","Life of the mother, rape, incest.","I'm for traditional marriage. I think it's a state's rights issue, not a judge issue. It's a voter issue but it's a state's rights. But I am for traditional marriage.","I'd say it's bad. Medical marijuana is another thing. But I think it's bad. And I feel strongly about that.","If they vote for it, they vote for it. But you know they've got a lot of problems going on right now in Colorado. Some big, big problems. But I think medical marijuana, 100%.","Like a one word response? I sort of think of Benghazi. I think of a failed Secretary of State, but Benghazi was a disaster. And amazingly, I don't think it resonated like it should have. But Benghazi was a total disaster.","Nice guy. Got a lot of problems coming up in my opinion with the famous island with Jeffrey Epstein. A lot of problems.","Incompetent president.","It's got a great fabric. They have phenomenal people like the people in this room, we have so much going. We need the incentives we can't take away those incentives but we have a country that can be so great again. We have a country that will be absolutely admired by everybody right now it's not admired by other countries and I deal with these countries.","They talk to me Sean and they say I can't believe Chinese. They say, \"They're friends of mine.\" They say, \"I can't believe we're getting away with this.\" In Saudi Arabia they say, \"I can't believe we get away with this.\" They don't put up the money we're fighting wars for them. They don't put up the money.","I know these people. I have nothing against China. Their leaders are just much smarter than us. So if we bring our country back to the grassroots. If we keep the incentives going, I'm telling you the potential of the United States is so incredible if we do it properly and if we have smart, really smart leadership.","Right.","Right.","Well, I did want to see, I still would like to see his college records. I mean, I'd like to see a couple of things, but I'm not looking at his marks. I'd like to see where he put on. Hey, look. He wrote a book when he was a young man and it said born in Kenya. Bah, bah, bah. I don't know where he was born.","I would like to see his college records, I think it's important. Now as far as the birth certificate, Hillary Clinton wanted his birth certificate. Hillary is a birther. She wanted -- but she wasn't unable to get it. John McCain fought really hard and really viciously to get his birth certificate. John McCain failed.","Couldn't get it. Trump comes along and I'm not a sitting senator. I'm not a sitting anything else. I'm a good businessman. [Crowd laughing But Trump comes along and said birth certificate. He gave a birth certificate. Whether or not that was a real certificate because a lot of people question it. I certainly question it but Hillary Clinton wanted it, McCain wanted it, and I wanted it. He didn't do it for them.","He did it for me. So in one sense, I'm proud of it. Now all we have to do is find out whether or not it was real.","Thank you. Thank you. Thank you."],"text":" Well thank you very much. It's such an honor to be here at CPAC. We've done this before, the response has been so great. I love you people. You're really my kind of people. You're conservative, you work, you love the country, it's very simple. So a lot of people -- You're fired. A lot of people think I'm doing this for fun. They think it's good for my brand and I'm here and I'm doing that and I'm a big successful guy. I'm not doing this for fun. I'm doing it because we have to take our country back our country. Our country is in serious, serious problem. We have a president who's either incompetent, which I think he could be, or he's got his own agenda, which I know he does. I mean he does definitely have the agenda. Washington is totally broken and it's not going to get fixed unless we put the right person in that top position. It's just not going to happen. Now, the problem I have, I'm not a politician. Thank goodness. Politicians are all talk no action. I've dealt with them all my life. The king of zoning the king of eve -- I deal with politicians. That's what I do. I deal with foreign leaders. I deal with people. In this country, our politicians are all talk, no action. Now, I'm a conservative, I'm a Republican, but I look at what's going on with the Republicans. I'm almost more disappointed with the Republicans because... And you can go right now. I mean right now they're sitting over there and they're going to make a decision on whether or not to fund and I guarantee the answers we're going to fund, we're going to fund, we're going to keep doing it. Our president broke the law when he did what he did. And you're going to have to take a tremendously strong action or you're going to have people just flowing into this country worse than it's ever been. They're coming in now by the thousands and it's going to only get worse. So the Republicans have to toughen up. They have to toughen up on the IRS. They have to toughen up on Benghazi. They have to tough it up on everything. And most importantly perhaps other than immigration they have to toughen up on Obamacare, which is a total lie and which is a total and complete disaster. And when it kicks in, because it really kicks in, in 2016 when it kicks in you are going to see some catastrophic results. People are getting out of business, companies are closing all because of Obamacare. So they have to do something about that. And they have to do it now. Now, when was the last time you heard something good about our country? Where we won, we beat China, we beat Mexico, we beat somebody. We never win. You don't hear good news about this country. We are in a position where we just never win. And that's because of our leadership. You need somebody perhaps that wrote The Art of the deal, one of the great business books of all time. Now, you know, a little example; somebody said, \"I can't believe you got the old post office.\", you know, right down the road, meaning on Pennsylvania Avenue. I wish it were right down the road. Eight down the road, Pennsylvania Avenue, I got a building, the Old Post Office great building. Everybody wanted it. GSA gave it out. We are doing an amazing job with it. It's under construction now for six months. The GSA gave it out. Obama gave it up. Trump got it. Now, is that good negotiating? That was, in the history of the GSA, one of the most sought after properties ever, and Trump got it and people said to me, \"How the hell did you ever get it when Obama is in charge of the GSA?\" But that's the way it goes, folks. And maybe that's what we need some of. So it's really, really important that we have people at that top position that no -- because the country has such tremendous potential, unbelievable potential. And we just are not using it. Now, on ISIS. Nobody. If I decide to run and win nobody would be tougher than Donald Trump. Nobody. I would hit them so hard and so fast. That they wouldn't know what happened. I would find a general, remember the old days of General MacArthur and General Patton, and these great generals. Now we must have somebody in there. But I laugh as I say and it's laughed through tears as you say, \"Look, they're announcing when they're going to attack the other side. How often do you see that? In two weeks from now we're sending soldiers over here, we're going to attack this. General MacArthur is spinning in his grave when he sees what we do. So you got to hit him hard. You've got to hit him firm and you can't play games. You got to go hard and fast and firm and there's somebody there that's going to do the job. Now, we have a thinking Bowe Bergdahl, we all know Berg -- We we sell. We make a deal. Bowe Bergdahl for five killers, five terrorists who are right now out there trying to kill us. This is the kind of thinking. And you don't even hear anything about it and what people forget. It's like the one week schedule they forget the Bowe Bergdahl deal is emblematic of what's going on in this country. All our deals are like that and we can't let it continue to happen. Now, Iran. They can not have a nuclear weapon and we must protect Israel. We must protect Israel. As far as our borders are concerned. We need strong borders. We need a wall. If I run I will tell you, the king of building buildings, the king of building walls. Nobody can build them like Trump, that I can promise you. I can promise you that. Executive order, we've got to knock it out. We've got to knock it out fast. Common Core is bad. Bad. Second Amendment is good. Now. Really good. Now they want to take away your bullets, folks. I don't know if you've been seeing what's going on. They can't get the guns, now they want to go after the bullets. But the Common Core -- Look, I came down very hard on Mitt Romney because he let us down. He really let us down. That should have been an election that was won. That was an easy election to win. I actually think probably easier than the next one coming up. There was no excuse for not winning that. I came down very strong. Likewise, Jeb Bush. He's in favor -- he's in favor of Common Core. He's weak on immigration. Now think of it for a second. In favor of Common Core. He's weak on immigration. You remember his statement with they come over for love? That was his stance on immigration. I don't see him winning. I don't see there's any way you people are going to have to make your own choice. Who knows. We have to rebuild our infrastructure. I go throughout the world. I'm all over the world. And I see China and I see Abu Dhabi. I see places that you wouldn't believe. You go to Qatar. You go to Saudi Arabia you see bridges and tunnels and airports and just roadways that are so magnificent, they're paved in gold. And then you come home and you land at LaGuardia or you land at LAX in Los Angeles. You land at Kennedy Airport in New York. And they're like Third World places. Our roads are crumbling, everything's crumbling. And we're rebuilding China. It's got to stop and we have the cards, remember that. We have the cards. Social Security I'm the only Republican that's going to say this and I don't know people going to love it or not but I think we've got to make this country rich again. We can do it with smart leadership. And when we make it rich we can save Social Security, Medicare, and Medicaid and not cut it like almost every Republican wants to do. Let's cut Social Security, cut Medicare, cut med -- Now, you go after the fraud and abuse but you don't cut it. We make the country rich again. We take back the jobs from China and other nations. And you're not going to have to cut Social Security, Medicare, etc. And nobody else is going to tell you that. We're at 18 trillion in debt. We're very soon going to be a lot more than that and we're going to reach $24 trillion. When we do that, that's a sacred number because that's a number from which there's almost no recovery. So we better get going and we better get going fast. I just want to leave this with you. To be a winner, you have to think like a winner. Our country hasn't been thinking like a winner. We're totally on the defense. We're being laughed at all over the world for our stupidity. We're giving things away. ISIS, you know where they have their military? They take it from -- We leave it for Iraq and ISIS comes in and takes it. I see these trucks and these beautiful tanks. They're all American tanks. They have -- We have to use our head. We need brilliant leadership we can make America great again. There's tremendous potential in this country. And my whole concept is: Make America Great Again. We can do it. Thank you. Thank you. Thank you. Thank you. Thank you very much. And now we have Sean Hannity. Where is Sean? Come on, Sean. Get out here, Sean. Hey. Here I am. Give it up for Mr. Donald Trump. Y'all doing OK? Thank you, everybody. Thank you. They have chairs. You want to stand? We'll stand. Let's stand. He likes to stand. OK. First question. Oh, it's great to see you. Nice to see you. Don't read into this. This isn't Donald Trump tie. Do not take that as an indication that I am -- I'm committed. I still haven't made up my mind yet. They do very well buying in Macy's, that's right. All right. You know what. The first question. Many of my friends ask, OK. You've kind of flirted with running before but Primarily. Yeah. I did. And I thought Romney could do it and he let us down. I did. I love what I'm doing. I mean, look I love building. I'm building all over the world. I love it. More than anything else, I love it. But I love this country. My children now have grown Ivanka, Don, Eric they're very very ensconced in the company. I have great executives. I can now let them run things and I have no problem. But you know when you're building it it's very hard for a person like me to run because I have a lot of things happening. A politician they run. What do they do? They run, they run, they lose, they win, they run. With me, I give up a lot when I do this. I already told the Apprentice people. You know, NBC wanted to renew and I said I'm doing something else. It's very important to me. I'm doing something very important. So I'm looking at it very seriously. I don't want what happened to Mitt Romney to happen again because that was a tremendous blow for this country. OK. If I had to ask you on a scale of one to a hundred. Where are you on that scale in terms of where you think you are and deciding to run? One to a hundred, I would say 75 and 80. I am really inclined. I want to do it so badly. You know I have the theme, it's my theme. It's Make America Great Again. That's what I want to do. We can do that in this country if we had people that know what they're doing. If we had people that are competent. All right let's talk about -- I just had an opportunity to speak to this great crowd and I talked about the economic problems we have. You're known for being a businessman. All right. Fifty million Americans in poverty, 50 million close to it, 50 million Americans on food stamps, 92 million Americans not working. We don't count them but they're not working. Right. As I said. Right. We don't count them. I mean, we have, they say 5.3 and 5.6%. I think it's over 20%. During the speech I said 20%. How do we get them? How would Donald Trump as president get these people back to work? You have to take the jobs back from China. You have to take the jobs back from Mexico. Mexico. In Iowa companies are leaving for Mexico. You have to take -- they've given incentive to leave our country and go to places like Mexico. And by the way, Mexico is the next China. Mexico folks is not our friend. I hate to tell you this, but Mexico -- And I'm not just talking about the border. Mexico is ripping off the United States big, big league. And we'd better do something. But jobs going to China, to Mexico, to Brazil. They're going everywhere but here. And we've lost our manufacturing and we've lost our manufacturing base. Sean, you hear about, as an example, Apple? Sure it's based here but they do all the work, they make all their product in China. It's wonderful place, wonderful. And I have -- I have tremendous experience with China. I've made a lot of money with China and I had some pretty hard times with China and I was the one that came out on top. Believe me, this country can come out on top. OK. Let me ask. I think everybody's got to have a vision. If I were to ask you that you become president your top five agenda items. OK. What are they? Well I'd start with ISIS. You have to just hit them and hit them hard. You've got to get rid of that whole situation. And you know, if you were going to ask me that question two years ago, three years ago probably it wouldn't have been the first thing on the agenda. But right now it's become so severe, so bad. And I always said take the oil. They have the oil. ISIS first. Obamacare, I would repeal it and I would get something that would be so much better than Obamacare. So important. You look at every aspect of government. You look at regulation. EPA. You can't move. You can't do anything. Everything you want to do is stopped. You have to do that. I would build a tremendously strong military. Our military has been -- has been let go and it's been let go badly. And you know being in the real estate business, all the time I get these listings for Army bases that are for sale and they're selling, I mean, I said, \"Are we going to have any army bases left?\" All the time. So many bases are for sale. I say, \"What are we going to do about it?\" The vets, I would straighten out that whole mess. These vets are great people, amazing people. And I would straighten out that mess like you wouldn't believe and I'd be in there really fast and I would be working on Iran and I would be helping Israel big league. There wouldn't be speeches made behind my back. I would be helping out Israel, big league. Because they deserve the help. And Iran has very, very bad intentions. When you look at this as negotiating 101. You look at a president who's negotiating and he drops the sanctions. Now I would have said triple up the sanctions. So now they're not doing anything. They're not coming to a good conclusion. And I hear the deal is terrible. So when Bibi comes here it's gonna be very interesting what happens. But we have a president that truly doesn't know what he's doing. With ICE. Let me go back to ISIS for a second. Speci -- Let's get the specifics here. We see what the Jordanians are doing, we see what the Egyptians are doing. What would specifically you do to a) Stop Iran's nuclear program and b) to defeat ISIS. Because I don't hear you saying degrade them. I hear you saying defeat them. Defeat. Well with ISIS I'd just hit him really hard and that would probably and, you know, a year ago you wouldn't have said it and nobody would've liked it. Now everybody likes it. You may have to have some boots on the ground for a period of time until you get rid of the cancer. That's number one. You may have to have left. Look. They are cutting off -- They're cutting off the heads of people. They're burning people at the stake. It's like we're living in medieval times. You have to do something. As far as Iran is concerned. If they respected our leadership they'd negotiate. If we put sanctions all over the place they would negotiate. They were being very badly hurt by sanctions. Now, they're not all of a sudden it's like they're not taking us seriously. With Iran sanctions all over the place. Believe me you can make the right deal if you have the right negotiator. You know part of the problem we have, Sean, we have people that are diplomats doing our nego -- They know nothing about negotiating. All they know how to do is keep their job. They know nothing about negotiating. If we had the right people we could solve the ISIS problem and we could solve the Iran problem. And a lot more quickly than you think. You made a statement about immigration, where you said, \"I'm great at building things. I'm great at building fences.\" Well I would build a wall. It all starts with a wall. You have to build. You have to stop. And first of all it also has to go with Mexico having some respect for our country. They don't respect us whatsoever. People are flowing through Mexico. And what a lot of people don't realize the hardest country, one of the hardest countries to become a citizen of, you probably couldn't do it, is Mexico. The people flow right through Mexico. They shove them through our borders and we have no idea. And by the way, you don't know where those people are coming from. They could have very, very bad intentions and they don't necessarily have to be from the areas that you think they are but they just walk into us. Mexico puts them in jail or they they tell them to go home immediately. Mexico is one of the hardest countries in this world to become a citizen of. But they just flow them right through our border. And I see it the other night on television. I'm watching and thousands of people they're just walking across the border. You have guards standing there. They just walk right across. What are we stupid? It's just hard to believe that this can happen. There's so many young people in this room. Obama has -- Well, by the time he leaves office we'll have accumulated more debt than every other president combined. True. What do you say to them about how a President Trump could balance a budget? I understand debt. I understand business better than anybody that's ever run in my opinion for office. Nobody's had the success in a business sense that I've had. I know how to get rid of debt. I would get rid of that debt and I would do it quickly because it's sitting out there and it is a time bomb for this country. Had it specifically though. This is important. Would -- I like the penny plan. Cut a penny out of every dollar. It's fine. But I like two plans. I like making the country rich again taking in tremendous amounts of money stopping China from ripping us etc. And also cutting costs but not cutting them when it comes to the military and not cutting them. When it comes to Social Security either. All right. I see they keep tell -- I always -- Every time I'm up here it says wrap up now. I don't know why. Real quick. Lightning round. Real quick answers. Abortion. OK. Well I'm very pro-life and feel strongly about it and with exceptions. Life of the mother etc. but I am pro-life. Rape and incest, life in the mother. Yes. Those three exceptions. Life of the mother, rape, incest. Gay marriage. I'm for traditional marriage. I think it's a state's rights issue, not a judge issue. It's a voter issue but it's a state's rights. But I am for traditional marriage. Colorado, marijuana, good or bad experiment. I'd say it's bad. Medical marijuana is another thing. But I think it's bad. And I feel strongly about that. Well hang on. What about the states right aspect of it if the people of Colorado decide? If they vote for it, they vote for it. But you know they've got a lot of problems going on right now in Colorado. Some big, big problems. But I think medical marijuana, 100%. OK. Let me mention some names to you in just get a quick response. Hillary Clinton. Like a one word response? I sort of think of Benghazi. I think of a failed Secretary of State, but Benghazi was a disaster. And amazingly, I don't think it resonated like it should have. But Benghazi was a total disaster. We learned today that, in fact, they knew from the first minutes of that attack that it was a terror attack, which I think will become a bigger issue. Bill Clinton. Nice guy. Got a lot of problems coming up in my opinion with the famous island with Jeffrey Epstein. A lot of problems. Barack Obama. Incompetent president. OK. You obviously -- the American Dream has worked in your life and your father's life, your family's life I know a lot about your background. We're now talking a lot about American exceptionalism. In Donald Trump's mind, what makes America exceptional, and why do you so love this country that you want to be its commander in chief? It's got a great fabric. They have phenomenal people like the people in this room, we have so much going. We need the incentives we can't take away those incentives but we have a country that can be so great again. We have a country that will be absolutely admired by everybody right now it's not admired by other countries and I deal with these countries. They talk to me Sean and they say I can't believe Chinese. They say, \"They're friends of mine.\" They say, \"I can't believe we're getting away with this.\" In Saudi Arabia they say, \"I can't believe we get away with this.\" They don't put up the money we're fighting wars for them. They don't put up the money. I know these people. I have nothing against China. Their leaders are just much smarter than us. So if we bring our country back to the grassroots. If we keep the incentives going, I'm telling you the potential of the United States is so incredible if we do it properly and if we have smart, really smart leadership. One last question. You almost single-handedly were out there questioning President Obama's background. You said. \"How can you not show a birth certificate. Right. I'm not bringing up that issue as much. You also wanted to see his college records. Right. Some people have criticized you for asking those questions. What is your response? Well, I did want to see, I still would like to see his college records. I mean, I'd like to see a couple of things, but I'm not looking at his marks. I'd like to see where he put on. Hey, look. He wrote a book when he was a young man and it said born in Kenya. Bah, bah, bah. I don't know where he was born. I would like to see his college records, I think it's important. Now as far as the birth certificate, Hillary Clinton wanted his birth certificate. Hillary is a birther. She wanted -- but she wasn't unable to get it. John McCain fought really hard and really viciously to get his birth certificate. John McCain failed. Couldn't get it. Trump comes along and I'm not a sitting senator. I'm not a sitting anything else. I'm a good businessman. CPAC, give it up. Donald Trump. Thank you. Thank you. Thank you."}