{"id":519,"author":"Donald Trump","title":"Speech: Donald Trump Holds a Town Hall-Style Event in Washington","date":"2014-05-27","link":"https://factba.se/transcript/donald-trump-speech-washington-dc-may-27-2014","paragraphs":["So I think they're going to revisit that. Are you going to revisit that Myron?","You're thinking about it. All right. It's an honor to be with you. I will tell you this, that our country, which I love very dearly, is in serious trouble. But the old Post Office building, right down the road on Pennsylvania Avenue, is not. It is going to be spectacular. We are building something that's going to be amazing.","We're going to be spending more than $200 million. And when it's completed in a very short period of time, probably about 18 months, it'll be one of the great hotels of the world and you'll have it right here in Washington and it's gonna be really something. We're building projects all over the world, Doral, you know about Doral and Miami, and that was sort of -- another thing, we love to buy and fix and make them great, and we like to get the right ones, and Doral is 800 acres right smack in the middle of Miami right next to the airport.","Tiger Woods won the tournament a year ago and he was there again this year. Hurt his back unfortunately but he will be back. I hope Tiger will be back. But we've had tremendous success with Doral and we've rebuilt it and it's been an incredible thing, and I just got back from Dubai and it was sort of interesting.","We were in the Middle East and somebody said -- a very wealthy person over there was smelling the air and you could sort of smell, it had a little sense of like a gasoline smell or an oil smell. And he said, oh Donald, I love that smell. It means money. Now, in this country you're not allowed to have that because the environmentalists don't let you have it. And I, by the way, happened to be, in my own way, an environmentalist.","I've gotten many many awards but we can't go to the extent where the country suffers and the country is suffering very greatly. So we build all over the world. We get to know people all over the world and we have a lot of fun. We have a lot of fun doing it. When I spoke with the National Press Club they asked me, would I speak about branding and talking about branding or what makes branding so -- so special and so important.","And there are a lot of things and it started with me, very early on, just by having success. You know, when you're successful, that sort of creates a little bit of a brand. And then I did a number of buildings. I started in Brooklyn with my father, Brooklyn and Queens, and we had some good successes, and I had some good successes.","It's a little bit -- in sports like if you think that first three footer in golf, you have confidence for the rest of the round or if you get a home run when you're at bat, you have confidence. Well, when you have early success, it gives you confidence and I had a lot of early success. I had a wonderful mentor, a wonderful father, Fred Trump, who loved Brooklyn real estate.","He loved Brooklyn and he spent a lot of his time there. Never wanted to come into Manhattan, and he just loved Queens and Brooklyn because that's what he knew and he was good at it. And I learned negotiation from him and I learned contractors and how they can just rip you off if you don't know what you're doing.","And there is nobody smarter than a contractor who can't read or write. They're smarter than Wharton. They're smarter than Harvard. I shouldn't say that to the Wharton Club but they are. These are geniuses, and you can imagine what's going on because you see what's going on in the country. I hear that the website for Obamacare is up to five billion dollars.","For a website. Now I do websites and they cost $3. You hire some guy or some woman. They can be young they can be old. You know I got in trouble. I said, you hire some young guy and they said, oh well what about older people? You can't hire -- I said, so you can hire anybody to do a website. And you know what?","I have some of the best websites in the world. You can look, every one of my projects has a website. Some are very complex, and they cost us peanuts if you know what you're doing. So we're up to almost five billion dollars and it's really, you know, obviously it's a very, very sad thing. So, in terms of branding, you have success.","Whether it's Doral, whether it's OPO, whether it's many, many jobs that I built. But what happened, about 20 years ago I built a building, Fifth Avenue and 57th Street. It's called Trump Tower and it's been tremendously successful, right next to Tiffany. And I bought the air rights over Tiffany, and in buying the air rights, I had the right to call it Tiffany tower, and that was really pretty much -- probably 25 years ago.","That was before people knew about Trump so much. I was doing really well and real estate guys knew but the world didn't know too much about Trump. And perhaps it was a better place if you think about it. But I had the right to do something and a lot of people said, you have to do it. And that was call it Tiffany tower.","Because I bought that right, so I was going to call it Tiffany tower. And I had a friend, who is a very smart guy and a very streetwise guy. I said, what do you think about calling the building Tiffany tower. He said, when you change your name to Tiffany, call it Tiffany tower. And I said, no kidding. So I gave up a very valuable right and I called it Trump Tower, and it was a tremendous success and then many other buildings all over New York, and then all over the world.","We're doing some incredible things in the Middle East. We're doing some incredible things in China and Asia. We're doing some incredible -- we have a magnificent hotel that opened recently in Panama. And you know, just -- they've been tremendous and they've been successful. And it feeds on itself and perhaps the brand gets better and better.","But I think it all began with the great success of Trump Tower. Best location in New York. Most visible building. Most -- the highest rate retail space anywhere in the world. Gucci is there as my primary tenant and nowhere in the world you get rents like you get on that one block. And I've always heard, the Tiffany location, that's the best location.","And who would have thought that I, someday, would have the Tiffany location. That's what happened. So the success really fed on itself. And then I did a book thinking, you know, what's the big deal with doing a book but I'll do a book, and it was exciting and Random House was the publisher and it was called The Art of the Deal.","Trump: The Art of the Deal. And it became the number one best selling book on the New York Times list and every list for many, many months and almost a full year. And I remember, on the fictional side, it was Bonfire of the Vanities and us. These were the two books. The whole year. Trump: The Art of the deal and Bonfire of the Vanities on fiction.","And it was just a great honor. And it had a lot to do -- it was a great thing, to have a number one selling book. And it turned out to be, probably, according to everybody's count, the biggest selling business book of all time. There's never been a business book that sold like Trump: The Art of the Deal.","So it was such a great honor. So that's branding. And then I had The Apprentice. Now, The Apprentice was really interesting because, Mark Burnett, who was hot at the time, young, smart and he was renting the Wollman Skating Rink, which you know. The city took eight years, they couldn't get it open. I took it over, I got it opened in three months for a fraction of the cost.","You know, that was a pretty well-known thing. That was pretty well known. It tells you about government but -- and I'm talking about all government. But that was a disaster. The rink just wouldn't open. And my daughter here, who's so wonderful, I wanted her -- she was a little girl. I wanted her to go ice skating.","Ivanka, she's here with us today. And you know, she kept saying, daddy, do you think I'll ever be able to go ice skating? Because they're building a rink. Eight and a half years. So I went to see Ed Koch, who was the mayor, I said, do me a favor. Can I build it for you, please?. I'd go down there and watch, and they'd have three or four -- you know, it's a massive space and they'd have three or four hundred people sitting in the rink doing nothing for years.","So I said, let me take it over. I took it over. It's very interesting story about the Wollman Rink. So, when the city designed it, they went to a refrigeration company from Miami. Now who wants refrigerate? They hired a refriger -- and they do refrigerators but they don't do ice skating rinks. So they recommended a -- what's called freon, it's a gas that goes through a copper pipe.","And if you have one little hole -- there's miles of it. One little -- like a pinhole, it doesn't work because the gas escapes. So they couldn't get it to make the ice because they'd have a pinhole, and besides that everybody would steal it. You know they'd put this beautiful copper piping down and the tubing would be all over the rink and they'd go back the next day and it was gone.","People were stealing it. OK. So it wasn't working. They actually poured it down and then finally they poured, and it never worked because they were like 4,000 little holes all over the place. OK. So what did I do? First thing I did is say, well wait a minute, we're got to make it and there must be something wrong.","So I sent up to the Montreal Canadiens. Now, that's a good one. If you want to make ice, you call the Canadians, right? I mean there's nothing wrong with a little Canadian help. So I spoke to somebody at the Montreal Canadiens. They were really nice. They sent somebody down and he said, Mr. Trump, they're using the wrong system.","They're using gas and explained how you can't capture it. He said what we want is brine. Now, brine is water with salt in it. OK? And the tubing isn't copper, that costs a fortune, it's rubber. So we put the tubing down, and then I'll never forget, the surface is so massive. We had cement mixers backed up all the way to Harlem.","We did one pour. They went all the way back up to Harlem. All the way through the park, and I had it built in three months, after eight and a half years. And believe me, most of it was demolition. Most of it was demolition. So, things can be done, you know, if you look at government and if you look at what happens.","So we're at the Wollman Rink and Mark Burnett and CBS leased it because they were having a finale of Survivor and they want it to be -- they built a village in the middle of the Wollman Rink and it was live television, great. And he said, I'd like to see Donald Trump. Is that possible? So I said, sure, let me see.","So we met and he said, I have an idea that I want to do but I'll only do it if it's you. And he turned out to be right about that because they have 15 copies of The Apprentice. And I love it, all of them failed and they failed badly. They failed like you'd never saw. Oh, I love that. Don't we love that, when your opponents fail?","I love it. I don't know about you but I'm not sure our country loves it, you know, but I love it. And what happens is -- so they had 15 copies. I could give you names but maybe I -- maybe I will anyway. But you had Mark Cuban copy. Total failure. Lasted for two nights. You had Martha Stewart copy. You had Richard Branson.","You had Tommy Hilfiger, who's a great guy by the way. But they -- all these copies, Hilton copied. So they had 15 copies altogether and they were all off. And Mark said to me, you know, I'd love to do it. And I had an agent. Do you believe? I had a Hollywood agent, and he's represent the biggest. And he said don't do it. I said, it's too late.","I shook hands with Mark Burnett. He said, what difference does that make? You know, it's Hollywood. Doesn't mean -- handshake doesn't mean anything in Hollywood. I said, but I shook hands. I can't do it. He said, Donald, 97% percent of the shows that go on television fail. I didn't know that. What do I know?","I never did television before. He said, of the ones that make it, they don't make it big and you're gonna have a great embarrassment. And in the history of television, there's never been a business type show that worked. So I said, I still have a problem. I wish I knew this before. I would have never done it. I don't want to do it but I shook his hand.","It means a lot in life and it means a lot even toward branding. So I said, I don't want to do it. I called Mark. I said, Mark, do you think I can get out of it? He said, you shook my hand. I said, you're right. So we did it. So the show opens and it opened at number 10, which is massive. When you're number 10 that's a big show.","So it opens at Number 10. It goes down to number eight. It then goes down to number five in three weeks. It then goes to two and it then goes to one. And I knew how big it was because the head of NBC television and the head of NBC called me up. I never met him. He said -- it was seven o'clock in the morning and he called me up. He said, Donald, hello I just wanted to wish you happy birthday.","I said, I never even spoke this guy, he's called me about happy birthday. So he's showing weakness. You have to remember. Then I get a call from the Chairman of NBC, Bob Wright, who is a fantastic guy, and he calls and he said, you know, happy birthday Donald. Is everything good? Are you feeling good? I said, I'm feeling great, thank you very much.","My wife said, who was that? I said, that was the Chairman of NBC. They wished me a happy birthday before you did. So -- so I knew that I had a big hit. And it went on and on, and the interesting thing is that was in the age of Friends. That was the last year of Friends and then we started and took the place.","And I'm just saying to myself, boy, this is really something. And it just tells you about branding. You never know what's going to happen. You have to take risks in life. You just have to do it. The end result of that story though is the agent called me and he goes, Mr. Trump, I'd like to see you at your earliest convenience.","I said, about what? He said, I think I'm entitled to a commission. Your show just went to number one. You have the number one show on television and I honestly think I'm entitled to a commission. I said, Jim, you didn't want to do the show. You told me, don't do the show. You told me, break the deal. What are you talking about?","I said, by the way, what kind of money are you talking about? He said would three million dollars be fair? I said, Jim, you're fired. I fired him. I find that was the last I've ever heard about the guy. But anyway. But it's all about winning. Like, I'm watching over here and this guy, Buffalo News, he's telling me Buffalo News is doing great.","That's good, right? But I'm seeing these questions -- hundreds of questions are coming. And a couple of them I see -- a couple of them, I said, please don't ask that question, right? But I'm looking at them and I was sort of saying to myself as I'm watching, that leadership and branding and all of that kind of success, to a large extent, it's about winning.","If you don't win, people aren't going to follow you. Now, there are other qualities. And I believe strongly in compassion. A lot of people don't know that about me but I have great feelings of compassion for people and helping people and, you know, making people thrive and love their life and take care of people.","And we need great health care in this country. Obamacare's not working. It's a disaster. We need great health care and you can have great, great health care. Much better than what we have right now, for much, much less money if you have people that really have compassion and really know what they're doing.","But I was thinking to myself, as I was looking at all of these numbers of questions about leadership, because one of them was about leadership, and I said, you know, it's about winning. Vince Lombardi was a great coach and I'll never forget, I was in a room with one of his players, who's four times the size of Vince Lombardi.","And it was at a club and I'm sitting with the player and the player was full of bravado. All of a sudden, Vince Lombardi, who was a small guy in stature, walked in. Boom, boom, boom. And this football player was petrified, petrified. I said, are you okay? He looked like he was ready to have a heart attack.","Young, strong guy. Petrified. Now, you've had other coaches that were rough, tough guys. But you know what happens -- and you see it all the time and you've seen it here. You've seen it right in Washington. When you don't win, they don't get away with being tough. When you win, they can be as tough as they want.","It's about winning. Now, you look at branding and you look at what's happening -- and I told you the story about Trump: The Art of the Deal and I told you the story about The Apprentice and I will tell you, today you have Twitter and you have Facebook and you have Instagram and you have all of these different things that are so amazing.","I have millions of followers. Millions. I don't do press releases anymore. If I want a press release, I just put it on Twitter and I've got a press release. It's so great. It's like owning the New York Times without the losses. If you think about it. No, it is. You have millions of people watching. And if I want to say something, I just put it out and all of a sudden I'm reading stories about it the next day it's really fantastic.","I love it, frankly. I sit there at three o'clock in the morning. Ding, ding, ding, ding. You know, our country is going to hell. We must stop it. We need leadership. I keep saying the same thing. Nobody's listening. But it's largely true. So you look at the United States and let's look at branding. We haven't had a success in years.","Where have we had a success? I mean, I wrote down just a few things coming down. We have nothing. The VA, the Veterans Administration, catastrophic. Benghazi, catastrophic. Russia, I mean, Putin has an 80% popularity in this country, where I thought they didn't even like him a year ago. But he's so outsmarting the United States and all of a sudden the people in Russia like him.","And you have us, we're fighting and another country wants to come in and they love Russia. They say -- now, we send in our pollsters. We say, that's not -- well, you know, guess what? They want to form with Russia. How the hell are we involved? OK? We're involved in all of this. Isn't Europe supposed to be involved in this?","They don't want to get involved because they don't want to anger Russia. So we get it. And why? Why is it us? But then you have China. Now, the all time curse -- and I love politics and I've been studying politics. And despite what Myron was saying, I never said I was running, other than the last time I said I might run.","But I never did. But everybody thinks -- you know, I made a speech in New Hampshire years ago, for a friend of mine. And because I made a speech in New Hampshire, everybody said I was running for -- which I wasn't. I did give it serious consideration. I don't know what happened to Mitt Romney. It looked like he was going to do fine.","I was leading in every poll. I was doing great. But I love what I'm doing. I love building the old Post Office. I love building Doral. I love building Panama. I love building all of these buildings that we're doing. I just love it. I love what I'm doing. It's why I do it well. I tell that to people. They say, what's the secret to success?","I said, you got to love what you doing. I love what I'm doing. So I would prefer not running and I did prefer not running. In fact, I'm the only person -- people said, you know, I'm a private company. So nobody knows what I'm worth. Nobody has any idea. Forbes doesn't know. Nobody knows. Some people say 10 billion.","They say two billion. They say three point nine billion. So accurate, three point nine. I think Forbes, last time, said three point nine. They have no idea. And I'm the only candidate in history -- because there were a lot of people say, oh do you think Trump is really rich? So I'm the only candidate in history that filed a financial disclosure statement that wasn't running.","Think of it. I'm not running. Because a lot of people said, oh he'll never run because he doesn't want to reveal his finances. I said, hey, I'll reveal them. I'm so proud of what I've done. I built a great company. I'm really proud of it. One of the reasons -- I think Ivanka can tell you this even better than me, that we won for the old Post Office.","I think we had a better concept because that was a highly sought after project. Every developer wanted it. Every hotel company wanted. But, I mean, obviously it's Pennsylvania Avenue it's an amazing building. I think it's the tallest building in Washington because they have the zoning restrictions now. That was before, that was in the 1880's. But, you know, one of the reasons that we won is because my financial statement was so strong.","They want to make sure it gets done. And the GSA did a very professional job, I have to tell you. They want to make sure it gets done. And for us it's a very easy project. So you had people bidding that couldn't have handled it. You had other people building that could have but -- bidding they could but we, really, are going to do a fantastic job there.","But when I look at what's going on and when I see the country, so where? Just tell me. Where? I wrote a couple of other things down. China, Russia. Now, they just got together. I've always heard the big curse on this country will always be if China and Russia unify and get together. They just made one of the biggest deals ever made.","China, our great friend -- and by the way, I have great respect for China. I have many Chinese friends. They live in my buildings all over the place. I mean, they buy apartments. They give me 30 million, 40 million. Am I supposed to dislike them? I like them very much. Same with the Russian. I've got more oligarchs living in my buildings.","I bought a house. I bought a house in Palm Beach. Ivanka, can tell you. And I've bought $40 million and I fixed it. You know, call it, can you have a $40 million fixer-upper? Because that's what I had. I bought it as a real estate deal. I have Mar-a-Lago, which is the Mar-a-Lago Club, which is great. But a mile down the road there was a house of a man who fell on very hard times.","Nice guy but he fell on very, very hard times. Went down the tubes, to put it mildly. And his house was sold by the banks. It was sold in a bankruptcy auction. I bought it. I paid $40 million. I sold it for $100 million and I sold it to a Russian, who then announced his wife is suing him for divorce and wants the house.","It's going to be very interesting to see. In fact, she just won four billion dollars, supposedly, in the in the proceedings. You all saw that. So I looked at it and I see that and I say to myself, where is the United States doing well? So Russia and China now are unifying and they're getting together. Then you have Iraq OK? We spend two trillion dollars in Iraq.","Two trillion. Think of this number. This number is even -- not even a number that you -- honestly, ten years ago you didn't hear the word trillion. So we spent two trillion. And more importantly, thousands of lives, including lives on the other side by the way. I mean, OK? Some people say, oh who cares? I care.","OK? Destroyed. And what we did is we took this country and so weakened it. You know, it was always Iran and Iraq and they'd fight. One country would go two feet over here, the other country would two feet -- then they'd have to like -- 10 years they'd settle and then start all over again. You know. It was -- they had -- well we've destroyed that country.","We've destroyed that country. But we spent two trillion dollars, thousands of lives, tens of thousands of wounded warriors. All over the streets you'll see them. We can't even call them. They won't even return our call. Because China's buying their oil. China thinks we are, truly, the dumbest people on Earth.","China now is buying a big portion of their oil. They're being controlled by Iran, which I said, a long time ago. And then when I made the statement, because it looked to me like it was going down the tubes. Why don't we take their oil. You know, we are at war. People said, what a terrible thing to say. Now, you call Iraq, they won't even take our phone call.","Think of it. They won't even take our call. Now, an interesting thing happened in Afghanistan. Nobody knew that Afghanistan has tremendous minerals, and tremendous wealth and minerals. Everyone thought this was a country that didn't have that. But they have tremendous wealth and minerals. Well, we're fighting over here and on the other side of the mountain, China is brilliantly -- I don't say negatively.","They're smart. They're brilliantly taking all the minerals. So we're fighting here, big mountains, we're fighting here, China's taking the minerals on the other side. And I say to myself, how is it possible that we can be so stupid? An interesting thing happened the other day. I'm reading the front page of The New York Times, number one story, number one column, that we can't make a deal with Japan for agriculture.","Now think of this. We can't make a deal. Japan will not allow our farmers to put food and sell food in Japan. Hey, I like the Japanese too. I like everybody that buys apartments from Trump, OK? Very interest -- but I do. But I respect them. I respect people. You know, the fact that their leaders are much smarter than our leaders, that doesn't make me dislike them.","It makes me respect them. So I'm reading this article, that Japan won't let us even think about putting our food in Japan. And then I'm looking at boats with millions of cars pouring into this country, tax free, made in Japan. And I'm saying, who are our negotiators? I mean, if I was negotiating I'd say, fellas, you're going to take our food and you're going to love it. You're going to love our food.","I mean, the food is peanuts compared to what we're talking about. Peanuts. So you say to yourself, how is it possible that Japan would have the nerve to say we're not going to take small potatoes, some farming goods from the United States farmers. It's great product. Everybody admits that. It's not like it's tainted or problems.","It's great product. Better than what they can do. So they say, we're not taking your product but by the way we're selling you millions of cars. Look at the size of these massive car companies. And it's because of the United States. No tax. Tax free. So all you'd have to do, if you're sitting down -- I guarantee you this, if I was the negotiator for that deal, you'd be -- you'd have so much food pouring into Japan right now they wouldn't know what to do with it. They wouldn't know what to do with it. So I say to myself, why aren't we smart?","We used to be brilliant. We used to be a brilliant country. We're not a brilliant country anymore. We're a foolish country. We're a dumb country. We have leadership that is either something wrong with them or they're not intelligent or there's something wrong. Maybe it's lobbyists. You know, I hear the lobbyists are so powerful in Washington.","Maybe it's lobbyists. Maybe you have to do something about that, because maybe Japan and maybe the Middle Eastern states -- I mean, look at this, I heard a number today that, since 1931 we have more oil reserves in this country, in terms of storage reserves, that we've had since 1931. Think of that. And yet the price is at an all-time high.","Now, I went to Wharton. Greatest school. Greatest business school in the world, OK? Did I say a good thing? Yes? The Wharton Club, which is a great club. But I went to Wharton and I will tell you that the very basics of that are that prices come tumbling down. So here we have -- and we're buying from OPEC and we're buying from Saudi Arabia.","Also, great relationships with the people in Saudi Arabia. They cannot believe, by the way -- because they're friends of mine. They can't believe how stupid we are. They tell me, hey, Donald, we're getting away with it. What do you -- I say, you're right. Saudi Arabia's making, think of this, a billion dollars a day.","A billion a day. So much money. What they're doing there is unbelievable. You look at our airports. You look at your airport here. You look at your airport, LaGuardia and Kennedy and Newark and LAX in Los Angeles. They're like third world country airports. Falling apart. They have Terrazzo floors inside that is so old.","And when they fix them, they don't fix them with Terrazzo, which would be terrible. Should rip them out, put down a new floor, right? They fix them with asphalt. So you walk in, you got Terrazzo, that's really tired, in the main terminal and then they put black asphalt from a road, an exterior road. And this is our -- our roads are falling apart.","Our bridges are falling apart. In China they're building 24 bridges, most of which are bigger than the George Washington Bridge. I mean, just massive bridges, massive construction. They're taking our jobs and we don't even know it. Then the President of China comes over and we have a state dinner for him, honoring him, what a wonderful guy.","And he's laughing all the way back to China. So it's all branding. But when you look at the things that are going on -- now, in Afghanistan, we're spending tremendous amounts of money. And President Karzai, as you know, our President flew into Afghanistan. And President Karzai, who's getting sacks and sacks of cash -- you know, they're getting 50 million in cash and this is -- I mean green.","And I want to know, who is the soldier that's delivering the cash? That's what I want to know. Can you imagine? Do you trust somebody to hand -- they're carrying satchels of cash because they're paying off the tribal leaders and the warlords and it's -- it's -- 50 million. I wonder who are these people that are doing this.","But Karzai said, I won't meet with the President and I won't meet him at the plane. So you have the President of the country who spent, I guess we're close to a trillion dollars there also, lands and the President doesn't have the decency to come and pay his respects, even to just shake his hand. And I say to myself, that's very bad branding.","Because when you get right down to it, that's what we're talking about that's pretty bad. It's pretty sad. So you look at Libya. You look at Syria. The line in the sand. Remember the famous line in the sand? And then nothing was done. Not that it should be done, and not that we should be involved, because we shouldn't be involved.","But you don't say, we're going to do this or we're going to do that and don't do -- and then they do it and then you don't follow up. And by the way, I don't want them to follow up but you should have never made the statement. So we are in very, very serious trouble. And I just ask you what positive thing has happened to this country in the last 10 years, and that includes Bush.","I'm not a Bush fan. Believe me, I am no Bush fan. He got us into Iraq. I think Obama should have gotten us out a lot faster but Bush got us into Iraq. I am no Bush fan and anybody that knows me knows that. But what's happened good. I mean, can we say that the economy's booming? No. Can we say unemployment -- I mean unemployment is a totally phony number.","Massive unemployment all over the place. If you stop looking for a job they take you off the unemployment rolls like you've got the job. We have massive unemployment, where we don't make up products anymore. They're made mostly in China and other countries. Mexico is doing phenomenally well. Phenomenally.","That's going to be the new China, as far as making products. Look what's going on in Mexico. And you say to yourself, isn't that sad. Isn't that a shame. Now, the good news is we have tremendous potential. Tremendous potential. We have power over China that you wouldn't believe. China sells their product to us, no tax.","No tax. And yet they'll manipulate their currency so that our people cannot compete with their product. We make better products than them by the way, but we can't compete because of the manipulation, which is in the history of the world, there has never been a better or smarter currency manipulation than that done by China.","All you have to do is say, folks, it's going to end. It's going to end now. And if it doesn't end, we're going to throw a little tax on you that every product you sell in this country, it's gonna be a 25% tax. By the way, the number should be 48% based on their manipulation. But I want to be nice. We will start with 25. You wouldn't even have to do the tax because everything would stop.","Same thing with Japan, with the cars. I mean, it's the same thing. It's so simple. But we don't have the right people. I don't know who these people are. Where do they find these people? I assume they're diplomats. They're incompetent. We have incompetent people running the country. Now, Obamacare is having a devastating effect on the country.","And you know they say, whoever becomes President, 2016 is going to be a catastrophic year for the economy. Because you know all of the problems of Obamacare and other things were delayed till 2016. Somebody's going to have a real problem. And they better get smart. And the Republicans better get smart because they're going to inherit a mess like has never been inherited before.","Ever. Ever before. So, the good news is that we have tremendous potential with proper leadership. Tremendous. We can turn it around so fast. We're sitting on energy that's bigger than all of them, almost. We're sitting on massive amounts of dollars coming out of the ground. We don't use that. Even the pipeline, the Keystone pipeline -- the Keystone pipeline, I don't even care that much about it. I'd say build it because it's jobs and good and all that.","But we don't need Canada's oil. We don't need Canada's oil and gas. We don't need anything from anybody. But build it anyway. It's jobs. It's environmentally very good and it should be built. And it's amazing that it hasn't been built. And Obama's having a hard time with it. And some of the people that don't want it to be built, they're people on Wall Street.","I know them. You know why they don't want it to be built? Because they're invested in oil and gas and they don't want to bring down the price. It's not that they're great environment -- take a look at these people. Look at their right -- these people couldn't give a crap about the environment. They're invested heavily in oil and gas.","They don't want the competition. And our politicians sit back and they say, oh wow, he gave a lot of money to the Democratic Party. In this case, the Democratic Party, but gave a lot of money to the Democratic Party and we have to be nice to him and others. So it's a very, very sad thing. I would say that I'm very proud of this country.","But I would say that if we don't act quickly, it's going to be very, very hard to bring it back. We're very, very far out on a limb. Something has to take place and it has to take place quickly. Our people have to be taken care of. In order to take care of people, we need wealth. We don't want to cut Social Security.","We don't want to cut Medicare or Medicaid. And I'm, you now, different from a lot of Republicans. They keep talking about cutting. I keep saying, build the country up so you don't have to worry about Social Security. It's peanuts compared to the kind of numbers you're talking about if we knew what we're doing.","We have to take our business back from China and other countries. We have to take it back. And you will see and I -- I said it, winning. It's about winning. We've got to start winning. Not one good. And I searched everything. We haven't had one good story about this country being great for years and it's about time that we started getting the good stories.","And we can do it but you need proper leadership. And with that, I will take some of these killer questions that I've been viewing. And let's go. Go ahead Myron. Thank you. Thank you very much.","OK. Well, I -- again, I didn't flirt. People were asking me to run. They wanted me to run for a lot of things, including Governor. I said, no, no, no and I kept saying no, no. They wanted me to run for Governor of New York. I never wanted to do it. I said it would -- and finally I just said, I'm not doing it. But I didn't flirt.","People wanted me to run. We're going to see what happens in '16. We're going to see what happens. I want to see what's going on. This country is in serious trouble and I'm going to see what's going on. But I didn't flirt and I think I, probably during the speech, cleared it up pretty much. I love what I'm doing.","I would rather do what I'm doing than do that. But I also love, more than what I'm doing, more than virtually anything else, other than family, which includes my beautiful Ivanka who's here. I mean, I love this country. I love this country and I hate to see what's happening. And if I don't see the right person, I will do something in '16. I will do it as sure as you're sitting here.","Thank you.","Well, Chris is a friend of mine and he's a good guy but he's got to get his problem cleared up. There's no question about it. I mean, you have to get that cleared up and it has to come out very, very good and obviously it was foolish. And I've spoken to him about it and it was a crazy set of events that took place.","And I would say that Chris -- and I'll say it to anybody, I mean he has to get that whole thing straightened out and behind him, in which case he would be a viable candidate. But, certainly, he's been devastated by it and he's been hurt very badly by it. You just have to look at the polls. But, at some point, it'll come out.","I mean, there are many people looking. And I made the statement and I didn't mean it as a negative statement or positive, true. I mean, he's one email away from having a big problem. That has to disappear. It has to go away and then, certainly, he'd be viable.","Not even a little bit. I don't regret it. Why would I regret it? He came out with a book that wasn't published. You remember the famous book and it said, a young man -- on the cover, a young man from Kenya. He -- I was offered -- I offered him a tremendous amount of money just to show his -- I didn't want to see his marks.","I didn't want to see -- I just want to see place of birth. So look, there are three things that could happen, and one of them did happen. He was, perhaps, born in Kenya. Very simple. OK? He was, perhaps, born in this country but said he was born in Kenya. Because if you say you were born in Kenya, you got aid and you got into colleges, and people were doing that.","So perhaps he was born in this country, and that has a very big chance or, you know, who knows? Maybe it was all right. Now I offered five million dollars to just see the records. And I'll tell you what, he would have done a great service because there are millions of -- there are people in this country -- I walk down the street and they're saying, please, don't give up. Please don't give up on the whole thing with the birth certificate.","Now I hope that it's 100% fine. A lot of people are questioning the birth certificate. They're questioning its authenticity. But I do say this, I offered five million dollars just to see some basic records. Not the marks. Not the this. Nothing. Just some basic things on applications to colleges. I'd love to see what's put down.","Why didn't a man take five million dollars for his favorite charity. Now then, what wasn't reported by the press is, some time just prior to the expiration date of that offer, I raised the offer to $50 million. 50 million for charity. Pick your charity. $50 million. Let me see your records. And I never heard from him.","So, I would take it. I mean, I would take it and I'd give it to Chicago charities and I'd give it to all sorts of charities, and they can use the money. So, it's one of those three things. Either it's fine or he was born in Kenya or, in my opinion, there's a very good chance, he was born here and said he was born in Kenya.","Because, if you were born in Kenya, you got into colleges and you got aid. Very simple.","Well, in negotiation, the primary thing that you have to do is to get the other side to respect you, and President Putin does not respect or like President Obama. So you have a problem. I'm not sure that's a problem that's easily solvable. There's a dislike but Russia does not respect our country any longer.","They see that we've been greatly weakened, both militarily and otherwise, and he certainly does not respect President Obama. So, what I would do would be -- as an example, I own the Miss Universe. I was in Russia. I was in Moscow recently and I spoke indirectly and directly with President Putin, who could not have been nicer and we had a tremendous success.","The show was live from Moscow and we had a tremendous success there and it was amazing. But to do well, you have to get the other side to respect you, and he does not respect our President, which is very sad.","Well, I have no idea. I mean, I have no idea if I'll be able to. I would keep it in Buffalo. We're just discussing that. We've had a great discussion and Buffalo News is a terrific paper and they've treated us very fairly, I will tell you that. And we -- we are going to put in a bid. If the bid's not the right bid -- I just bought Turnberry, in Scotland, one of the great places of the world.","I just bought -- I buy a lot of things. But I buy them if the price is a reasonable price or a fair price. I don't know what's going to happen with Buffalo. If the price isn't the right price then I won't get it and I won't be ashamed of not getting it all. I'm not going to be forced into pay too much. But if I did, I do probably a good job and I think the people in Buffalo, they already like me. I have a great relationship with the people of Buffalo but we'll see what happens.","It's about price. I don't know how many bidders there's going to be. There'll probably be at least a few. But we will probably put in a bid and we'll see how that goes.","Well, as far as USFL, I did a great job but the league was failing. A lot of people don't know. I came in way late, when the league was failing, and got a team for -- for peanuts. It was a very small price because it was failing. It was a failure, and people don't know that. And because I came in, it became really hot and people started seeing it. But I came in on the basis that you'd go to fall football.","And I said, I'm only doing it if it's gonna be first class football. And I consider spring football not to be first class football. I don't think it can ever work in the spring because your television audiences in the spring are not -- I've learned a lot about ratings through The Apprentice and your television audience disappears in the spring.","Really just disappears. And I said to them, I will do this but I want to make sure you're going -- so when I wanted to go to the spring and when they wanted to go to the spring and keep it in the spring and stay that way. I think the opposite. I think that the NFL owners, there aren't too many of them around that remember that because -- I think there's six or seven.","But I think they gained a lot of respect for me. I actually think -- I've been told by a couple of them, that it was amazing, the job I did. Remember, I got Lawrence Taylor and then sold him back to the NFL. I got Lawrence to sign a contract, who's one of the great linebackers of all-time, and I sold him back to the NFL.","I actually think they respect what I did and I think they respect it a lot. So I don't see that as a problem. As far as the casino business, we get out of Atlantic City about five years ago. We sold -- our timing was good. Atlantic City is having some tough times right now but our timing was very good. And, essentially, I'm not too much into gaming.","You know, would I go in it later on? Yes, but if I did an NFL team, I wouldn't.","I don't worry about it. I mean, if it happens, it happens. It's sort of interesting. I always fight though. You know, it's -- the beautiful thing -- and again, we'll go back to Twitter and Facebook and Instagram. Somebody says something about me that's false, I will hit them hard. And a lot of times they disappear.","It's amazing. I mean, I'll have these wise guy reporters, you know, probably members of the National Press Club but some of these real wise guys. Like they always say, oh but Trump filed for bankruptcy. Well, excuse me. Buffet's used bankruptcy. Kravis has used bankruptcy. Carl Icahn, with TWA, he used bankruptcy.","It's a tool. It's just a tool. But when I use it, I buy a company, I throw it into a chapter. I then negotiate the hell out of loans and all the problems they have. It comes out and it's a good company, and they say Trump files bankruptcy. They don't say that with these other guys. So I let people know it's -- it's not right, what you're saying.","They attack my hair. My hair -- it's mine. Come here. Would anybody like to inspect? Is there a nice woman that would like to inspect it in the -- no, I mean, it's actually -- it's actually my hair. They say you wear the worst hair piece I've ever seen. What a horrible wig. So I put on Twitter, I don't wear -- but, of course -- you know, it's funny, when people don't want to --when they want to keep going, they just keep going.","But I like to defend myself. And the beautiful thing about the new media is that you actually can. I mean, if you have enough followers, and I certainly have a lot of them. Many, many millions. And you can sort of protect -- it's interesting, sometimes I'll be attacked and then I'll attack back really viciously.","I never hear from that person again. Especially if it's a famous person. If it's not a famous person they continue because what do they have to lose? But I was attacked, like, by Cher. She didn't like my politics and I hit her so hard, she still doesn't know what happened. It's the last I've heard of her.","I don't know. Like, Rosie O'Donnell has gone around saying, the worst thing I ever did was to attack Donald Trump. She attacked me. I had a young woman, a Miss USA, lovely young woman. She had an alcohol and a drug problem. She was going to be fired from Miss USA. They came into my office to get the final blessing.","There was a news conference downstairs, which was packed. Because it was a big event actually. And I met the girl, and she was a nice girl and I said, don't fire her, you'll destroy her life. I mean you'll -- it's never happened, where we fired the winner. They're going to take her crown away, fire her, humiliate her and she's already got a problem with drugs and with alcohol.","I said, don't fire. So Rosie O'Donnell's on The View, who is he to give somebody a second chance? Who is he to -- and I get a call from Entertainment Tonight and they said, did you hear about Rosie O'Donnell. I said, no, I have other things to do. What? Tell me about -- and they told me about this. And I hit her like nobody's ever hit her before, and that was it. And she goes around telling people that was a mistake that she made.","But you know, when somebody attacks you, attack them back. Stop it. Get it stopped. It's so important. In my opinion, it's so important. So that's the way it is. Go ahead. Next question.","I build buildings. It's true. You know it's funny, Ivanka, said to me the other day, do you ever go away daddy? Because, you know, we -- I do a thing in Dubai but we're doing a massive job in Dubai. Phenomenally successful job. And I was in Scotland, where we're doing something big and we were in Ireland where I bought a lot of property, and different places.","And that's for me relaxation. You know, when you love what you're doing -- If somebody said you are going to take an enforced vacation for two weeks, and you're going to go to some beach and you can't use your phone and I would -- it would not be good for me. It would actually not be healthy for me. So what I do, and what I really like doing, is working.","And it's been a lot of fun. And you know what, the great thing? I put a lot of people to work. I have thousands and thousands of people do -- that work for me. Health care, education. They're not worried about Obamacare because I take so good care of my people. But so many different people are working because I love to work.","So that's really the thing I like doing the most.","Thank you. Thank you.","This is such an easy one isn't it? But I won't do it. OK? I won't do it. Too corny. Look, we're a great country. We have great potential. Let's live with that potential and let's make that potential come true. We need fantastic leadership. We have the people in this country that have the potential to be fantastic leaders.","Let's use our great minds. We're smarter than anyone. We're better -- we we can do what nobody has ever done before but we need great leadership and we need it quickly before it's too late. Thank you very much. Thank you everybody.P23NMo3GT8w"],"text":" So I think they're going to revisit that. Are you going to revisit that Myron? We'll consider it. You're thinking about it. All right. It's an honor to be with you. I will tell you this, that our country, which I love very dearly, is in serious trouble. But the old Post Office building, right down the road on Pennsylvania Avenue, is not. It is going to be spectacular. We are building something that's going to be amazing. We're going to be spending more than $200 million. And when it's completed in a very short period of time, probably about 18 months, it'll be one of the great hotels of the world and you'll have it right here in Washington and it's gonna be really something. We're building projects all over the world, Doral, you know about Doral and Miami, and that was sort of -- another thing, we love to buy and fix and make them great, and we like to get the right ones, and Doral is 800 acres right smack in the middle of Miami right next to the airport. Tiger Woods won the tournament a year ago and he was there again this year. Hurt his back unfortunately but he will be back. I hope Tiger will be back. But we've had tremendous success with Doral and we've rebuilt it and it's been an incredible thing, and I just got back from Dubai and it was sort of interesting. We were in the Middle East and somebody said -- a very wealthy person over there was smelling the air and you could sort of smell, it had a little sense of like a gasoline smell or an oil smell. And he said, oh Donald, I love that smell. It means money. Now, in this country you're not allowed to have that because the environmentalists don't let you have it. And I, by the way, happened to be, in my own way, an environmentalist. I've gotten many many awards but we can't go to the extent where the country suffers and the country is suffering very greatly. So we build all over the world. We get to know people all over the world and we have a lot of fun. We have a lot of fun doing it. When I spoke with the National Press Club they asked me, would I speak about branding and talking about branding or what makes branding so -- so special and so important. And there are a lot of things and it started with me, very early on, just by having success. You know, when you're successful, that sort of creates a little bit of a brand. And then I did a number of buildings. I started in Brooklyn with my father, Brooklyn and Queens, and we had some good successes, and I had some good successes. It's a little bit -- in sports like if you think that first three footer in golf, you have confidence for the rest of the round or if you get a home run when you're at bat, you have confidence. Well, when you have early success, it gives you confidence and I had a lot of early success. I had a wonderful mentor, a wonderful father, Fred Trump, who loved Brooklyn real estate. He loved Brooklyn and he spent a lot of his time there. Never wanted to come into Manhattan, and he just loved Queens and Brooklyn because that's what he knew and he was good at it. And I learned negotiation from him and I learned contractors and how they can just rip you off if you don't know what you're doing. And there is nobody smarter than a contractor who can't read or write. They're smarter than Wharton. They're smarter than Harvard. I shouldn't say that to the Wharton Club but they are. These are geniuses, and you can imagine what's going on because you see what's going on in the country. I hear that the website for Obamacare is up to five billion dollars. For a website. Now I do websites and they cost $3. You hire some guy or some woman. They can be young they can be old. You know I got in trouble. I said, you hire some young guy and they said, oh well what about older people? You can't hire -- I said, so you can hire anybody to do a website. And you know what? I have some of the best websites in the world. You can look, every one of my projects has a website. Some are very complex, and they cost us peanuts if you know what you're doing. So we're up to almost five billion dollars and it's really, you know, obviously it's a very, very sad thing. So, in terms of branding, you have success. Whether it's Doral, whether it's OPO, whether it's many, many jobs that I built. But what happened, about 20 years ago I built a building, Fifth Avenue and 57th Street. It's called Trump Tower and it's been tremendously successful, right next to Tiffany. And I bought the air rights over Tiffany, and in buying the air rights, I had the right to call it Tiffany tower, and that was really pretty much -- probably 25 years ago. That was before people knew about Trump so much. I was doing really well and real estate guys knew but the world didn't know too much about Trump. And perhaps it was a better place if you think about it. But I had the right to do something and a lot of people said, you have to do it. And that was call it Tiffany tower. Because I bought that right, so I was going to call it Tiffany tower. And I had a friend, who is a very smart guy and a very streetwise guy. I said, what do you think about calling the building Tiffany tower. He said, when you change your name to Tiffany, call it Tiffany tower. And I said, no kidding. So I gave up a very valuable right and I called it Trump Tower, and it was a tremendous success and then many other buildings all over New York, and then all over the world. We're doing some incredible things in the Middle East. We're doing some incredible things in China and Asia. We're doing some incredible -- we have a magnificent hotel that opened recently in Panama. And you know, just -- they've been tremendous and they've been successful. And it feeds on itself and perhaps the brand gets better and better. But I think it all began with the great success of Trump Tower. Best location in New York. Most visible building. Most -- the highest rate retail space anywhere in the world. Gucci is there as my primary tenant and nowhere in the world you get rents like you get on that one block. And I've always heard, the Tiffany location, that's the best location. And who would have thought that I, someday, would have the Tiffany location. That's what happened. So the success really fed on itself. And then I did a book thinking, you know, what's the big deal with doing a book but I'll do a book, and it was exciting and Random House was the publisher and it was called The Art of the Deal. Trump: The Art of the Deal. And it became the number one best selling book on the New York Times list and every list for many, many months and almost a full year. And I remember, on the fictional side, it was Bonfire of the Vanities and us. These were the two books. The whole year. Trump: The Art of the deal and Bonfire of the Vanities on fiction. And it was just a great honor. And it had a lot to do -- it was a great thing, to have a number one selling book. And it turned out to be, probably, according to everybody's count, the biggest selling business book of all time. There's never been a business book that sold like Trump: The Art of the Deal. So it was such a great honor. So that's branding. And then I had The Apprentice. Now, The Apprentice was really interesting because, Mark Burnett, who was hot at the time, young, smart and he was renting the Wollman Skating Rink, which you know. The city took eight years, they couldn't get it open. I took it over, I got it opened in three months for a fraction of the cost. You know, that was a pretty well-known thing. That was pretty well known. It tells you about government but -- and I'm talking about all government. But that was a disaster. The rink just wouldn't open. And my daughter here, who's so wonderful, I wanted her -- she was a little girl. I wanted her to go ice skating. Ivanka, she's here with us today. And you know, she kept saying, daddy, do you think I'll ever be able to go ice skating? Because they're building a rink. Eight and a half years. So I went to see Ed Koch, who was the mayor, I said, do me a favor. Can I build it for you, please?. I'd go down there and watch, and they'd have three or four -- you know, it's a massive space and they'd have three or four hundred people sitting in the rink doing nothing for years. So I said, let me take it over. I took it over. It's very interesting story about the Wollman Rink. So, when the city designed it, they went to a refrigeration company from Miami. Now who wants refrigerate? They hired a refriger -- and they do refrigerators but they don't do ice skating rinks. So they recommended a -- what's called freon, it's a gas that goes through a copper pipe. And if you have one little hole -- there's miles of it. One little -- like a pinhole, it doesn't work because the gas escapes. So they couldn't get it to make the ice because they'd have a pinhole, and besides that everybody would steal it. You know they'd put this beautiful copper piping down and the tubing would be all over the rink and they'd go back the next day and it was gone. People were stealing it. OK. So it wasn't working. They actually poured it down and then finally they poured, and it never worked because they were like 4,000 little holes all over the place. OK. So what did I do? First thing I did is say, well wait a minute, we're got to make it and there must be something wrong. So I sent up to the Montreal Canadiens. Now, that's a good one. If you want to make ice, you call the Canadians, right? I mean there's nothing wrong with a little Canadian help. So I spoke to somebody at the Montreal Canadiens. They were really nice. They sent somebody down and he said, Mr. Trump, they're using the wrong system. They're using gas and explained how you can't capture it. He said what we want is brine. Now, brine is water with salt in it. OK? And the tubing isn't copper, that costs a fortune, it's rubber. So we put the tubing down, and then I'll never forget, the surface is so massive. We had cement mixers backed up all the way to Harlem. We did one pour. They went all the way back up to Harlem. All the way through the park, and I had it built in three months, after eight and a half years. And believe me, most of it was demolition. Most of it was demolition. So, things can be done, you know, if you look at government and if you look at what happens. So we're at the Wollman Rink and Mark Burnett and CBS leased it because they were having a finale of Survivor and they want it to be -- they built a village in the middle of the Wollman Rink and it was live television, great. And he said, I'd like to see Donald Trump. Is that possible? So I said, sure, let me see. So we met and he said, I have an idea that I want to do but I'll only do it if it's you. And he turned out to be right about that because they have 15 copies of The Apprentice. And I love it, all of them failed and they failed badly. They failed like you'd never saw. Oh, I love that. Don't we love that, when your opponents fail? I love it. I don't know about you but I'm not sure our country loves it, you know, but I love it. And what happens is -- so they had 15 copies. I could give you names but maybe I -- maybe I will anyway. But you had Mark Cuban copy. Total failure. Lasted for two nights. You had Martha Stewart copy. You had Richard Branson. You had Tommy Hilfiger, who's a great guy by the way. But they -- all these copies, Hilton copied. So they had 15 copies altogether and they were all off. And Mark said to me, you know, I'd love to do it. And I had an agent. Do you believe? I had a Hollywood agent, and he's represent the biggest. And he said don't do it. I said, it's too late. I shook hands with Mark Burnett. He said, what difference does that make? You know, it's Hollywood. Doesn't mean -- handshake doesn't mean anything in Hollywood. I said, but I shook hands. I can't do it. He said, Donald, 97% percent of the shows that go on television fail. I didn't know that. What do I know? I never did television before. He said, of the ones that make it, they don't make it big and you're gonna have a great embarrassment. And in the history of television, there's never been a business type show that worked. So I said, I still have a problem. I wish I knew this before. I would have never done it. I don't want to do it but I shook his hand. It means a lot in life and it means a lot even toward branding. So I said, I don't want to do it. I called Mark. I said, Mark, do you think I can get out of it? He said, you shook my hand. I said, you're right. So we did it. So the show opens and it opened at number 10, which is massive. When you're number 10 that's a big show. So it opens at Number 10. It goes down to number eight. It then goes down to number five in three weeks. It then goes to two and it then goes to one. And I knew how big it was because the head of NBC television and the head of NBC called me up. I never met him. He said -- it was seven o'clock in the morning and he called me up. He said, Donald, hello I just wanted to wish you happy birthday. I said, I never even spoke this guy, he's called me about happy birthday. So he's showing weakness. You have to remember. Then I get a call from the Chairman of NBC, Bob Wright, who is a fantastic guy, and he calls and he said, you know, happy birthday Donald. Is everything good? Are you feeling good? I said, I'm feeling great, thank you very much. My wife said, who was that? I said, that was the Chairman of NBC. They wished me a happy birthday before you did. So -- so I knew that I had a big hit. And it went on and on, and the interesting thing is that was in the age of Friends. That was the last year of Friends and then we started and took the place. And I'm just saying to myself, boy, this is really something. And it just tells you about branding. You never know what's going to happen. You have to take risks in life. You just have to do it. The end result of that story though is the agent called me and he goes, Mr. Trump, I'd like to see you at your earliest convenience. I said, about what? He said, I think I'm entitled to a commission. Your show just went to number one. You have the number one show on television and I honestly think I'm entitled to a commission. I said, Jim, you didn't want to do the show. You told me, don't do the show. You told me, break the deal. What are you talking about? I said, by the way, what kind of money are you talking about? He said would three million dollars be fair? I said, Jim, you're fired. I fired him. I find that was the last I've ever heard about the guy. But anyway. But it's all about winning. Like, I'm watching over here and this guy, Buffalo News, he's telling me Buffalo News is doing great. That's good, right? But I'm seeing these questions -- hundreds of questions are coming. And a couple of them I see -- a couple of them, I said, please don't ask that question, right? But I'm looking at them and I was sort of saying to myself as I'm watching, that leadership and branding and all of that kind of success, to a large extent, it's about winning. If you don't win, people aren't going to follow you. Now, there are other qualities. And I believe strongly in compassion. A lot of people don't know that about me but I have great feelings of compassion for people and helping people and, you know, making people thrive and love their life and take care of people. And we need great health care in this country. Obamacare's not working. It's a disaster. We need great health care and you can have great, great health care. Much better than what we have right now, for much, much less money if you have people that really have compassion and really know what they're doing. But I was thinking to myself, as I was looking at all of these numbers of questions about leadership, because one of them was about leadership, and I said, you know, it's about winning. Vince Lombardi was a great coach and I'll never forget, I was in a room with one of his players, who's four times the size of Vince Lombardi. And it was at a club and I'm sitting with the player and the player was full of bravado. All of a sudden, Vince Lombardi, who was a small guy in stature, walked in. Boom, boom, boom. And this football player was petrified, petrified. I said, are you okay? He looked like he was ready to have a heart attack. Young, strong guy. Petrified. Now, you've had other coaches that were rough, tough guys. But you know what happens -- and you see it all the time and you've seen it here. You've seen it right in Washington. When you don't win, they don't get away with being tough. When you win, they can be as tough as they want. It's about winning. Now, you look at branding and you look at what's happening -- and I told you the story about Trump: The Art of the Deal and I told you the story about The Apprentice and I will tell you, today you have Twitter and you have Facebook and you have Instagram and you have all of these different things that are so amazing. I have millions of followers. Millions. I don't do press releases anymore. If I want a press release, I just put it on Twitter and I've got a press release. It's so great. It's like owning the New York Times without the losses. If you think about it. No, it is. You have millions of people watching. And if I want to say something, I just put it out and all of a sudden I'm reading stories about it the next day it's really fantastic. I love it, frankly. I sit there at three o'clock in the morning. Ding, ding, ding, ding. You know, our country is going to hell. We must stop it. We need leadership. I keep saying the same thing. Nobody's listening. But it's largely true. So you look at the United States and let's look at branding. We haven't had a success in years. Where have we had a success? I mean, I wrote down just a few things coming down. We have nothing. The VA, the Veterans Administration, catastrophic. Benghazi, catastrophic. Russia, I mean, Putin has an 80% popularity in this country, where I thought they didn't even like him a year ago. But he's so outsmarting the United States and all of a sudden the people in Russia like him. And you have us, we're fighting and another country wants to come in and they love Russia. They say -- now, we send in our pollsters. We say, that's not -- well, you know, guess what? They want to form with Russia. How the hell are we involved? OK? We're involved in all of this. Isn't Europe supposed to be involved in this? They don't want to get involved because they don't want to anger Russia. So we get it. And why? Why is it us? But then you have China. Now, the all time curse -- and I love politics and I've been studying politics. And despite what Myron was saying, I never said I was running, other than the last time I said I might run. But I never did. But everybody thinks -- you know, I made a speech in New Hampshire years ago, for a friend of mine. And because I made a speech in New Hampshire, everybody said I was running for -- which I wasn't. I did give it serious consideration. I don't know what happened to Mitt Romney. It looked like he was going to do fine. I was leading in every poll. I was doing great. But I love what I'm doing. I love building the old Post Office. I love building Doral. I love building Panama. I love building all of these buildings that we're doing. I just love it. I love what I'm doing. It's why I do it well. I tell that to people. They say, what's the secret to success? I said, you got to love what you doing. I love what I'm doing. So I would prefer not running and I did prefer not running. In fact, I'm the only person -- people said, you know, I'm a private company. So nobody knows what I'm worth. Nobody has any idea. Forbes doesn't know. Nobody knows. Some people say 10 billion. They say two billion. They say three point nine billion. So accurate, three point nine. I think Forbes, last time, said three point nine. They have no idea. And I'm the only candidate in history -- because there were a lot of people say, oh do you think Trump is really rich? So I'm the only candidate in history that filed a financial disclosure statement that wasn't running. Think of it. I'm not running. Because a lot of people said, oh he'll never run because he doesn't want to reveal his finances. I said, hey, I'll reveal them. I'm so proud of what I've done. I built a great company. I'm really proud of it. One of the reasons -- I think Ivanka can tell you this even better than me, that we won for the old Post Office. I think we had a better concept because that was a highly sought after project. Every developer wanted it. Every hotel company wanted. But, I mean, obviously it's Pennsylvania Avenue it's an amazing building. I think it's the tallest building in Washington because they have the zoning restrictions now. That was before, that was in the 1880's. But, you know, one of the reasons that we won is because my financial statement was so strong. They want to make sure it gets done. And the GSA did a very professional job, I have to tell you. They want to make sure it gets done. And for us it's a very easy project. So you had people bidding that couldn't have handled it. You had other people building that could have but -- bidding they could but we, really, are going to do a fantastic job there. But when I look at what's going on and when I see the country, so where? Just tell me. Where? I wrote a couple of other things down. China, Russia. Now, they just got together. I've always heard the big curse on this country will always be if China and Russia unify and get together. They just made one of the biggest deals ever made. China, our great friend -- and by the way, I have great respect for China. I have many Chinese friends. They live in my buildings all over the place. I mean, they buy apartments. They give me 30 million, 40 million. Am I supposed to dislike them? I like them very much. Same with the Russian. I've got more oligarchs living in my buildings. I bought a house. I bought a house in Palm Beach. Ivanka, can tell you. And I've bought $40 million and I fixed it. You know, call it, can you have a $40 million fixer-upper? Because that's what I had. I bought it as a real estate deal. I have Mar-a-Lago, which is the Mar-a-Lago Club, which is great. But a mile down the road there was a house of a man who fell on very hard times. Nice guy but he fell on very, very hard times. Went down the tubes, to put it mildly. And his house was sold by the banks. It was sold in a bankruptcy auction. I bought it. I paid $40 million. I sold it for $100 million and I sold it to a Russian, who then announced his wife is suing him for divorce and wants the house. It's going to be very interesting to see. In fact, she just won four billion dollars, supposedly, in the in the proceedings. You all saw that. So I looked at it and I see that and I say to myself, where is the United States doing well? So Russia and China now are unifying and they're getting together. Then you have Iraq OK? We spend two trillion dollars in Iraq. Two trillion. Think of this number. This number is even -- not even a number that you -- honestly, ten years ago you didn't hear the word trillion. So we spent two trillion. And more importantly, thousands of lives, including lives on the other side by the way. I mean, OK? Some people say, oh who cares? I care. OK? Destroyed. And what we did is we took this country and so weakened it. You know, it was always Iran and Iraq and they'd fight. One country would go two feet over here, the other country would two feet -- then they'd have to like -- 10 years they'd settle and then start all over again. You know. It was -- they had -- well we've destroyed that country. We've destroyed that country. But we spent two trillion dollars, thousands of lives, tens of thousands of wounded warriors. All over the streets you'll see them. We can't even call them. They won't even return our call. Because China's buying their oil. China thinks we are, truly, the dumbest people on Earth. China now is buying a big portion of their oil. They're being controlled by Iran, which I said, a long time ago. And then when I made the statement, because it looked to me like it was going down the tubes. Why don't we take their oil. You know, we are at war. People said, what a terrible thing to say. Now, you call Iraq, they won't even take our phone call. Think of it. They won't even take our call. Now, an interesting thing happened in Afghanistan. Nobody knew that Afghanistan has tremendous minerals, and tremendous wealth and minerals. Everyone thought this was a country that didn't have that. But they have tremendous wealth and minerals. Well, we're fighting over here and on the other side of the mountain, China is brilliantly -- I don't say negatively. They're smart. They're brilliantly taking all the minerals. So we're fighting here, big mountains, we're fighting here, China's taking the minerals on the other side. And I say to myself, how is it possible that we can be so stupid? An interesting thing happened the other day. I'm reading the front page of The New York Times, number one story, number one column, that we can't make a deal with Japan for agriculture. Now think of this. We can't make a deal. Japan will not allow our farmers to put food and sell food in Japan. Hey, I like the Japanese too. I like everybody that buys apartments from Trump, OK? Very interest -- but I do. But I respect them. I respect people. You know, the fact that their leaders are much smarter than our leaders, that doesn't make me dislike them. It makes me respect them. So I'm reading this article, that Japan won't let us even think about putting our food in Japan. And then I'm looking at boats with millions of cars pouring into this country, tax free, made in Japan. And I'm saying, who are our negotiators? I mean, if I was negotiating I'd say, fellas, you're going to take our food and you're going to love it. You're going to love our food. I mean, the food is peanuts compared to what we're talking about. Peanuts. So you say to yourself, how is it possible that Japan would have the nerve to say we're not going to take small potatoes, some farming goods from the United States farmers. It's great product. Everybody admits that. It's not like it's tainted or problems. It's great product. Better than what they can do. So they say, we're not taking your product but by the way we're selling you millions of cars. Look at the size of these massive car companies. And it's because of the United States. No tax. Tax free. So all you'd have to do, if you're sitting down -- I guarantee you this, if I was the negotiator for that deal, you'd be -- you'd have so much food pouring into Japan right now they wouldn't know what to do with it. They wouldn't know what to do with it. So I say to myself, why aren't we smart? We used to be brilliant. We used to be a brilliant country. We're not a brilliant country anymore. We're a foolish country. We're a dumb country. We have leadership that is either something wrong with them or they're not intelligent or there's something wrong. Maybe it's lobbyists. You know, I hear the lobbyists are so powerful in Washington. Maybe it's lobbyists. Maybe you have to do something about that, because maybe Japan and maybe the Middle Eastern states -- I mean, look at this, I heard a number today that, since 1931 we have more oil reserves in this country, in terms of storage reserves, that we've had since 1931. Think of that. And yet the price is at an all-time high. Now, I went to Wharton. Greatest school. Greatest business school in the world, OK? Did I say a good thing? Yes? The Wharton Club, which is a great club. But I went to Wharton and I will tell you that the very basics of that are that prices come tumbling down. So here we have -- and we're buying from OPEC and we're buying from Saudi Arabia. Also, great relationships with the people in Saudi Arabia. They cannot believe, by the way -- because they're friends of mine. They can't believe how stupid we are. They tell me, hey, Donald, we're getting away with it. What do you -- I say, you're right. Saudi Arabia's making, think of this, a billion dollars a day. A billion a day. So much money. What they're doing there is unbelievable. You look at our airports. You look at your airport here. You look at your airport, LaGuardia and Kennedy and Newark and LAX in Los Angeles. They're like third world country airports. Falling apart. They have Terrazzo floors inside that is so old. And when they fix them, they don't fix them with Terrazzo, which would be terrible. Should rip them out, put down a new floor, right? They fix them with asphalt. So you walk in, you got Terrazzo, that's really tired, in the main terminal and then they put black asphalt from a road, an exterior road. And this is our -- our roads are falling apart. Our bridges are falling apart. In China they're building 24 bridges, most of which are bigger than the George Washington Bridge. I mean, just massive bridges, massive construction. They're taking our jobs and we don't even know it. Then the President of China comes over and we have a state dinner for him, honoring him, what a wonderful guy. And he's laughing all the way back to China. So it's all branding. But when you look at the things that are going on -- now, in Afghanistan, we're spending tremendous amounts of money. And President Karzai, as you know, our President flew into Afghanistan. And President Karzai, who's getting sacks and sacks of cash -- you know, they're getting 50 million in cash and this is -- I mean green. And I want to know, who is the soldier that's delivering the cash? That's what I want to know. Can you imagine? Do you trust somebody to hand -- they're carrying satchels of cash because they're paying off the tribal leaders and the warlords and it's -- it's -- 50 million. I wonder who are these people that are doing this. But Karzai said, I won't meet with the President and I won't meet him at the plane. So you have the President of the country who spent, I guess we're close to a trillion dollars there also, lands and the President doesn't have the decency to come and pay his respects, even to just shake his hand. And I say to myself, that's very bad branding. Because when you get right down to it, that's what we're talking about that's pretty bad. It's pretty sad. So you look at Libya. You look at Syria. The line in the sand. Remember the famous line in the sand? And then nothing was done. Not that it should be done, and not that we should be involved, because we shouldn't be involved. But you don't say, we're going to do this or we're going to do that and don't do -- and then they do it and then you don't follow up. And by the way, I don't want them to follow up but you should have never made the statement. So we are in very, very serious trouble. And I just ask you what positive thing has happened to this country in the last 10 years, and that includes Bush. I'm not a Bush fan. Believe me, I am no Bush fan. He got us into Iraq. I think Obama should have gotten us out a lot faster but Bush got us into Iraq. I am no Bush fan and anybody that knows me knows that. But what's happened good. I mean, can we say that the economy's booming? No. Can we say unemployment -- I mean unemployment is a totally phony number. Massive unemployment all over the place. If you stop looking for a job they take you off the unemployment rolls like you've got the job. We have massive unemployment, where we don't make up products anymore. They're made mostly in China and other countries. Mexico is doing phenomenally well. Phenomenally. That's going to be the new China, as far as making products. Look what's going on in Mexico. And you say to yourself, isn't that sad. Isn't that a shame. Now, the good news is we have tremendous potential. Tremendous potential. We have power over China that you wouldn't believe. China sells their product to us, no tax. No tax. And yet they'll manipulate their currency so that our people cannot compete with their product. We make better products than them by the way, but we can't compete because of the manipulation, which is in the history of the world, there has never been a better or smarter currency manipulation than that done by China. All you have to do is say, folks, it's going to end. It's going to end now. And if it doesn't end, we're going to throw a little tax on you that every product you sell in this country, it's gonna be a 25% tax. By the way, the number should be 48% based on their manipulation. But I want to be nice. We will start with 25. You wouldn't even have to do the tax because everything would stop. Same thing with Japan, with the cars. I mean, it's the same thing. It's so simple. But we don't have the right people. I don't know who these people are. Where do they find these people? I assume they're diplomats. They're incompetent. We have incompetent people running the country. Now, Obamacare is having a devastating effect on the country. And you know they say, whoever becomes President, 2016 is going to be a catastrophic year for the economy. Because you know all of the problems of Obamacare and other things were delayed till 2016. Somebody's going to have a real problem. And they better get smart. And the Republicans better get smart because they're going to inherit a mess like has never been inherited before. Ever. Ever before. So, the good news is that we have tremendous potential with proper leadership. Tremendous. We can turn it around so fast. We're sitting on energy that's bigger than all of them, almost. We're sitting on massive amounts of dollars coming out of the ground. We don't use that. Even the pipeline, the Keystone pipeline -- the Keystone pipeline, I don't even care that much about it. I'd say build it because it's jobs and good and all that. But we don't need Canada's oil. We don't need Canada's oil and gas. We don't need anything from anybody. But build it anyway. It's jobs. It's environmentally very good and it should be built. And it's amazing that it hasn't been built. And Obama's having a hard time with it. And some of the people that don't want it to be built, they're people on Wall Street. I know them. You know why they don't want it to be built? Because they're invested in oil and gas and they don't want to bring down the price. It's not that they're great environment -- take a look at these people. Look at their right -- these people couldn't give a crap about the environment. They're invested heavily in oil and gas. They don't want the competition. And our politicians sit back and they say, oh wow, he gave a lot of money to the Democratic Party. In this case, the Democratic Party, but gave a lot of money to the Democratic Party and we have to be nice to him and others. So it's a very, very sad thing. I would say that I'm very proud of this country. But I would say that if we don't act quickly, it's going to be very, very hard to bring it back. We're very, very far out on a limb. Something has to take place and it has to take place quickly. Our people have to be taken care of. In order to take care of people, we need wealth. We don't want to cut Social Security. We don't want to cut Medicare or Medicaid. And I'm, you now, different from a lot of Republicans. They keep talking about cutting. I keep saying, build the country up so you don't have to worry about Social Security. It's peanuts compared to the kind of numbers you're talking about if we knew what we're doing. We have to take our business back from China and other countries. We have to take it back. And you will see and I -- I said it, winning. It's about winning. We've got to start winning. Not one good. And I searched everything. We haven't had one good story about this country being great for years and it's about time that we started getting the good stories. And we can do it but you need proper leadership. And with that, I will take some of these killer questions that I've been viewing. And let's go. Go ahead Myron. Thank you. Thank you very much. I already had one note saying, why are we showing Mr. Trump the questions in advance? We don't show Mr. Trump the questions in advance. He was sitting next to our Chair of the Speakers Committee, Jerry's Zremski, who is trying to organize the cards. So we'll ask the questions, and I know that Mr. Trump can't wait to answer them. Let's go right into politics. You have flirted -- I think that's the right word. You have flirted, several times, with a possible run for the Presidency. Why have you never run? OK. Well, I -- again, I didn't flirt. People were asking me to run. They wanted me to run for a lot of things, including Governor. I said, no, no, no and I kept saying no, no. They wanted me to run for Governor of New York. I never wanted to do it. I said it would -- and finally I just said, I'm not doing it. But I didn't flirt. People wanted me to run. We're going to see what happens in '16. We're going to see what happens. I want to see what's going on. This country is in serious trouble and I'm going to see what's going on. But I didn't flirt and I think I, probably during the speech, cleared it up pretty much. I love what I'm doing. I would rather do what I'm doing than do that. But I also love, more than what I'm doing, more than virtually anything else, other than family, which includes my beautiful Ivanka who's here. I mean, I love this country. I love this country and I hate to see what's happening. And if I don't see the right person, I will do something in '16. I will do it as sure as you're sitting here. Thank you. Do you think Chris Christie is too damaged to be a viable Presidential candidate in 2016 And if not, who is the best GOP candidate at this stage? Well, Chris is a friend of mine and he's a good guy but he's got to get his problem cleared up. There's no question about it. I mean, you have to get that cleared up and it has to come out very, very good and obviously it was foolish. And I've spoken to him about it and it was a crazy set of events that took place. And I would say that Chris -- and I'll say it to anybody, I mean he has to get that whole thing straightened out and behind him, in which case he would be a viable candidate. But, certainly, he's been devastated by it and he's been hurt very badly by it. You just have to look at the polls. But, at some point, it'll come out. I mean, there are many people looking. And I made the statement and I didn't mean it as a negative statement or positive, true. I mean, he's one email away from having a big problem. That has to disappear. It has to go away and then, certainly, he'd be viable. Going back a few years, do you regret questioning President Obama's citizenship? Why or why not? Not even a little bit. I don't regret it. Why would I regret it? He came out with a book that wasn't published. You remember the famous book and it said, a young man -- on the cover, a young man from Kenya. He -- I was offered -- I offered him a tremendous amount of money just to show his -- I didn't want to see his marks. I didn't want to see -- I just want to see place of birth. So look, there are three things that could happen, and one of them did happen. He was, perhaps, born in Kenya. Very simple. OK? He was, perhaps, born in this country but said he was born in Kenya. Because if you say you were born in Kenya, you got aid and you got into colleges, and people were doing that. So perhaps he was born in this country, and that has a very big chance or, you know, who knows? Maybe it was all right. Now I offered five million dollars to just see the records. And I'll tell you what, he would have done a great service because there are millions of -- there are people in this country -- I walk down the street and they're saying, please, don't give up. Please don't give up on the whole thing with the birth certificate. Now I hope that it's 100% fine. A lot of people are questioning the birth certificate. They're questioning its authenticity. But I do say this, I offered five million dollars just to see some basic records. Not the marks. Not the this. Nothing. Just some basic things on applications to colleges. I'd love to see what's put down. Why didn't a man take five million dollars for his favorite charity. Now then, what wasn't reported by the press is, some time just prior to the expiration date of that offer, I raised the offer to $50 million. 50 million for charity. Pick your charity. $50 million. Let me see your records. And I never heard from him. So, I would take it. I mean, I would take it and I'd give it to Chicago charities and I'd give it to all sorts of charities, and they can use the money. So, it's one of those three things. Either it's fine or he was born in Kenya or, in my opinion, there's a very good chance, he was born here and said he was born in Kenya. Because, if you were born in Kenya, you got into colleges and you got aid. Very simple. Perhaps Ivanka would like to answer this. What will the new D.C. hotel be like? Thank you. Well, thank you everyone for -- for welcoming us here, and we all intend to spend much, much more time in D.C.. I, personally, have been down every week for the past year, and will continue to come down as we start the development of the old Post Office building. So, this is an asset that I don't need to describe to anyone. It sits on Pennsylvania Avenue, at one of the great addresses of all time. It's a landmark building. A building, the likes of which one could never replicate today. Unfortunately, its full potential hasn't been materialized for a long, long time, and we're going to change that. We're going to develop a super luxury hotel, 272 rooms. The largest ballroom of any of the luxury hotels in all of D.C.. Unbelievable meeting space. Unbelievable spas, restaurants, and really bringing in tremendous amounts of life and vitality to Pennsylvania Avenue and obviously the hotel itself. So, we love D.C.. We love this building. For many, many years, for -- for decades, my father has been looking and waiting and exploring various opportunities in D.C., but when he came here, he wanted to do it the right way with the right location, with the right development and that's the old Post Office building. So we're incredibly excited, and we'll start construction soon and be open in 2016. 2016, in time for the next inauguration. Thank you, Ivanka, and we appreciate your coming here and sharing the podium with your dad. A few more questions, Mr. Trump, because I think as -- as the more you are being so elucidating, we're getting more questions. What would you do if you were dealing with President Putin? Well, in negotiation, the primary thing that you have to do is to get the other side to respect you, and President Putin does not respect or like President Obama. So you have a problem. I'm not sure that's a problem that's easily solvable. There's a dislike but Russia does not respect our country any longer. They see that we've been greatly weakened, both militarily and otherwise, and he certainly does not respect President Obama. So, what I would do would be -- as an example, I own the Miss Universe. I was in Russia. I was in Moscow recently and I spoke indirectly and directly with President Putin, who could not have been nicer and we had a tremendous success. The show was live from Moscow and we had a tremendous success there and it was amazing. But to do well, you have to get the other side to respect you, and he does not respect our President, which is very sad. We'll turn to sports. You said you are interested in buying the NFL's Buffalo Bills. And I hope we have that correct. You've even spoken with NFL Commissioner, Roger Goodell, about that possibility. Do those conversations give you any sense as to how intense the bidding for the team will be? Well, I have no idea. I mean, I have no idea if I'll be able to. I would keep it in Buffalo. We're just discussing that. We've had a great discussion and Buffalo News is a terrific paper and they've treated us very fairly, I will tell you that. And we -- we are going to put in a bid. If the bid's not the right bid -- I just bought Turnberry, in Scotland, one of the great places of the world. I just bought -- I buy a lot of things. But I buy them if the price is a reasonable price or a fair price. I don't know what's going to happen with Buffalo. If the price isn't the right price then I won't get it and I won't be ashamed of not getting it all. I'm not going to be forced into pay too much. But if I did, I do probably a good job and I think the people in Buffalo, they already like me. I have a great relationship with the people of Buffalo but we'll see what happens. It's about price. I don't know how many bidders there's going to be. There'll probably be at least a few. But we will probably put in a bid and we'll see how that goes. One more sports question. Do you feel that some NFL owners might still hold a grudge against you because of your involvement in the USFL or because of casinos bearing the Trump name? Well, as far as USFL, I did a great job but the league was failing. A lot of people don't know. I came in way late, when the league was failing, and got a team for -- for peanuts. It was a very small price because it was failing. It was a failure, and people don't know that. And because I came in, it became really hot and people started seeing it. But I came in on the basis that you'd go to fall football. And I said, I'm only doing it if it's gonna be first class football. And I consider spring football not to be first class football. I don't think it can ever work in the spring because your television audiences in the spring are not -- I've learned a lot about ratings through The Apprentice and your television audience disappears in the spring. Really just disappears. And I said to them, I will do this but I want to make sure you're going -- so when I wanted to go to the spring and when they wanted to go to the spring and keep it in the spring and stay that way. I think the opposite. I think that the NFL owners, there aren't too many of them around that remember that because -- I think there's six or seven. But I think they gained a lot of respect for me. I actually think -- I've been told by a couple of them, that it was amazing, the job I did. Remember, I got Lawrence Taylor and then sold him back to the NFL. I got Lawrence to sign a contract, who's one of the great linebackers of all-time, and I sold him back to the NFL. I actually think they respect what I did and I think they respect it a lot. So I don't see that as a problem. As far as the casino business, we get out of Atlantic City about five years ago. We sold -- our timing was good. Atlantic City is having some tough times right now but our timing was very good. And, essentially, I'm not too much into gaming. You know, would I go in it later on? Yes, but if I did an NFL team, I wouldn't. Do you ever worry about your brand becoming damaged? What could damage it? I don't worry about it. I mean, if it happens, it happens. It's sort of interesting. I always fight though. You know, it's -- the beautiful thing -- and again, we'll go back to Twitter and Facebook and Instagram. Somebody says something about me that's false, I will hit them hard. And a lot of times they disappear. It's amazing. I mean, I'll have these wise guy reporters, you know, probably members of the National Press Club but some of these real wise guys. Like they always say, oh but Trump filed for bankruptcy. Well, excuse me. Buffet's used bankruptcy. Kravis has used bankruptcy. Carl Icahn, with TWA, he used bankruptcy. It's a tool. It's just a tool. But when I use it, I buy a company, I throw it into a chapter. I then negotiate the hell out of loans and all the problems they have. It comes out and it's a good company, and they say Trump files bankruptcy. They don't say that with these other guys. So I let people know it's -- it's not right, what you're saying. They attack my hair. My hair -- it's mine. Come here. Would anybody like to inspect? Is there a nice woman that would like to inspect it in the -- no, I mean, it's actually -- it's actually my hair. They say you wear the worst hair piece I've ever seen. What a horrible wig. So I put on Twitter, I don't wear -- but, of course -- you know, it's funny, when people don't want to --when they want to keep going, they just keep going. But I like to defend myself. And the beautiful thing about the new media is that you actually can. I mean, if you have enough followers, and I certainly have a lot of them. Many, many millions. And you can sort of protect -- it's interesting, sometimes I'll be attacked and then I'll attack back really viciously. I never hear from that person again. Especially if it's a famous person. If it's not a famous person they continue because what do they have to lose? But I was attacked, like, by Cher. She didn't like my politics and I hit her so hard, she still doesn't know what happened. It's the last I've heard of her. I don't know. Like, Rosie O'Donnell has gone around saying, the worst thing I ever did was to attack Donald Trump. She attacked me. I had a young woman, a Miss USA, lovely young woman. She had an alcohol and a drug problem. She was going to be fired from Miss USA. They came into my office to get the final blessing. There was a news conference downstairs, which was packed. Because it was a big event actually. And I met the girl, and she was a nice girl and I said, don't fire her, you'll destroy her life. I mean you'll -- it's never happened, where we fired the winner. They're going to take her crown away, fire her, humiliate her and she's already got a problem with drugs and with alcohol. I said, don't fire. So Rosie O'Donnell's on The View, who is he to give somebody a second chance? Who is he to -- and I get a call from Entertainment Tonight and they said, did you hear about Rosie O'Donnell. I said, no, I have other things to do. What? Tell me about -- and they told me about this. And I hit her like nobody's ever hit her before, and that was it. And she goes around telling people that was a mistake that she made. But you know, when somebody attacks you, attack them back. Stop it. Get it stopped. It's so important. In my opinion, it's so important. So that's the way it is. Go ahead. Next question. A personal question. A personal question Mr. Trump. What do you do for relaxation? I build buildings. It's true. You know it's funny, Ivanka, said to me the other day, do you ever go away daddy? Because, you know, we -- I do a thing in Dubai but we're doing a massive job in Dubai. Phenomenally successful job. And I was in Scotland, where we're doing something big and we were in Ireland where I bought a lot of property, and different places. And that's for me relaxation. You know, when you love what you're doing -- If somebody said you are going to take an enforced vacation for two weeks, and you're going to go to some beach and you can't use your phone and I would -- it would not be good for me. It would actually not be healthy for me. So what I do, and what I really like doing, is working. And it's been a lot of fun. And you know what, the great thing? I put a lot of people to work. I have thousands and thousands of people do -- that work for me. Health care, education. They're not worried about Obamacare because I take so good care of my people. But so many different people are working because I love to work. So that's really the thing I like doing the most. We're almost out of time. But before asking the last question, we have a couple of housekeeping matters to take care of. First of all, I like to remind you about our upcoming events and speakers. Tomorrow, Dr. Ben Carson, neurosurgeon and author. June 11th, Hollywood writer/director, M. Night Shyamalan will discuss his off-screen campaign to close America's education achievement gap. We'll have some other ones before August 1 but let me tell you that we've just finalized, on August 1, the President of the Republic of Congo, Denis Sassou Nguesso will discuss peace, security and stability of the Central African region, and oil investments in the country. Next, I want to have, for the first time that I can recall, a double presentation of our brand, The National Press Club mug, to Ivanka and Donald Trump. Thank you. Thank you. Thank you. The congressman wanted me to -- if we could just wait till he focuses the camera. I think -- hopefully that's enough. Thank you so much. I'll just do the -- how about a round of applause for our speaker and Ivanka. Thank you all for coming today. I'd also like to thank National Press Club staff. Yes, we'll ask the last question and -- Jerry always reminds me of that because I skip over the script. I want to finish with the last question. But like to thank National Press Club staff, including Journalism Institute and Broadcast Center for organizing today's event. For our last question, we have two minutes. You can make it short or you can take the full two minutes. If you had the power to fire one person on the planet, who would it be and why? This is such an easy one isn't it? But I won't do it. OK? I won't do it. Too corny. Look, we're a great country. We have great potential. Let's live with that potential and let's make that potential come true. We need fantastic leadership. We have the people in this country that have the potential to be fantastic leaders. Let's use our great minds. We're smarter than anyone. We're better -- we we can do what nobody has ever done before but we need great leadership and we need it quickly before it's too late. Thank you very much. Thank you everybody.P23NMo3GT8w"}