{"id":520,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech at the Freedom Summit in Manchester, NH","date":"2014-04-12","link":"https://factba.se/transcript/donald-trump-speech-manchester-nh-april-12-2014","paragraphs":["I want that syrup, Steve. Thank you very much. That was very nice. Well, I want to thank David Bossie. The whole group has been amazing and -- and you know, Citizens United, Americans for Prosperity. It's a great honor to be here. I love New Hampshire. I've been here many times before. Special place, special people.","People that love to work. They're workers. And I like that, and I think countries need that. And to be honest, we have something that we have to do and we have to do it fast. We have to make America great again. We have to do it. It's just not going to be able to continue onward. And we're just not going to be able to do it if we don't take this country and bring it back.","It's got to be brought back and it's got to be brought back fast. Our country is in very serious trouble. Jobs, unemployment through the roof. You look at indexes, some of them are the worst that we've had in 36 years, 36 years. Despite that, you have a number that's below 7% and we all know that doesn't matter, the number, because they don't report it the old-fashioned way the way they used to where people were unemployed, they were unemployed.","Now if you stop looking for a job because you can't find one, they consider you to be employed, essentially. As a country, we're in such serious trouble. We owe $17 trillion, much of it to China who does numbers on us like nobody has really ever done numbers. We have deficits that are massive on a yearly basis.","We don't have the right people negotiating for us. Obamacare is an absolute catastrophe. It's a disaster. It's a disaster. You know they say they had seven million startups. Now does anybody really believe that? OK. Just an impossibility. It's actually impossible. How many people have paid?","They don't mention these seven to 10 million people that lost their plan, lost their doctors. Obamacare has been the single greatest lie that I've ever witnessed and I've been in politics and watching politics for a long time. Single greatest lie. Now think of this, we all have websites, many of us. I have a lot of websites.","Every time I do a job, I have a website. Cost me about $3, right? You set it up. You get this guy. You get this woman. You know I made the -- the mistake. Somebody said, You get this young kid and you put him in. And somebody said, Well, I'm an older person and I do it, do you discriminate? I said, No I get older people, I get young people, I get everybody.","Cost me so little. They spent well over $1 billion to do a website. Nobody even talks about it. And then yesterday, I mean to me, you know, they sort of skipped over it but I think it's going to be one of the great classic lines in the history of politics and incompetence. And that was when Secretary Sebelius, on the podium like this, with the president here -- he must have been just going wild.","Can you imagine what this guy was thinking? She said, Unfortunately, a page is missing. And that's emblematic of -- of Obamacare. A page is missing, the whole thing is missing. Now as a very conservative person and as somebody that is a Republican and proud to be, we don't get treated the same way.","If that were done by some Republican, they would make that person into the dumbest, most incompetent human being that anybody has ever seen. With her they said, Oh, isn't that cute, she lost a page. Wasn't that cute? Wasn't that cute? I watch -- I mean, I couldn't believe it. They were trying to make it like it was a wonderful thing.","When President Obama was interviewed a couple of weeks ago by Zach, whatever his name is, to get the youth. And they started talking about, you were born in Kenya, he's going, oh, my god. They go all sorts of other things. As you know, they said some nasty things. And he's like -- I mean, he was so furious.","You could see he want to get out. He's looking for the aid that set that interview to -- he won't fire because he doesn't fire people, actually. But -- Never fires people. But you could see how angry he was. And I watch the commentary on it and everybody was saying, wasn't that fun? The only one not having fun was him.","That was a brutal time but they didn't make it like it was which was very bad, very disrespectful to the president. They made it like, geez, wasn't that -- wasn't that wonderful, wasn't that great? OK. So we have a lot of problems going on to this country. I'm a big believer in free trade. But you know, with free trade, you need competent people.","I actually don't like free trade with incompetent people because everybody is just kicking our ass. Every country. So I like to say fair trade as opposed to free trade. I like to say smart trade which I haven't heard but I've come up with it very recently. Really smart trade. And you know, I know people on Wall Street that are so smart that are so brilliant, business-wise, that if I put them to negotiate against China, Japan, Mexico, you name them.","I mean, I could go on forever because we have no good deals anymore. We would take one person, put him in charge of China. I know them all. China doesn't have a chance. But we take these people that are diplomats, that are political appointees, that raised money for the president. You know raised ten thousand dollars and you get yourself a nice position and you can negotiate with China.","Good luck! And then we wonder why China is laughing at us. Why they're outsmarting at us. And -- and you know, I don't know if you saw the other day but it was shocking to people. They just devalued their currency again. Now, a lot of people don't know economics. I went to the Wharton School of Finance.","I was really good at this stuff but I mean, it's also common sense. It makes it really tough for us to compete for product, and for jobs, and for all the other things that they're taken out of our system. And nobody would have thought they would've had the courage, a few weeks ago, to devalue their currency again.","And they did it because they have no respect for our president and they have no respect for our country. None. Now think of it, the military. I'm a big believer in military. I don't want to use it. But when you have it, you don't have to use it. You know it's interesting when you don't have it, you have to use it. When you have it, you don't have to use it. And we're cutting way back many many decades.","It hasn't been this week. Many many decades, we haven't spent this little as a percentage and we're cutting way back. And yet, you look at Putin who is absolutely having a great time. You know, we've foisted him onto the stage again. Russia is like -- I mean, they're really hot stuff. And now you have people in the Ukraine, who knows, setup or not, but it can't all be set up. I mean, they're marching in favor of joining Russia.","I mean, you know, you can send some people in. But Russia -- I mean, what he's done for Russia is really amazing and he's done it by outsmarting our country at every single step. You look at Syria. You look at Iran. Iran is taking the oil from Iraq. We spent $2 trillion on Iraq. Two trillion. Hard to believe.","You know that word didn't even exist like six years ago. Now you don't hear billion anymore, all you hear is trillion. We spent $2 trillion fighting in Iraq for years and years. More importantly, the soldiers we lost, the great people that we lost. And I come from New York, and I help wounded warriors and all.","I mean, so many of them with the legs, and with the arms, and with the trauma that they are going through. The trauma for what? Now you look at Iraq, we don't -- we have nothing to do -- have -- has anyone heard about Iraq? You know who's taken Iraq? Iran. You know, for years and years, and decades and decades they were the same, the same strength.","They go two feet this way, two feet that way, two feet this way, two feet that way. And then they'd say, let's have a truce. Now, we've decapitate -- I've always been a big -- hey look, I'm a very -- I -- I believe strongly in military -- I'm very strong into the military, I'm very strong in doing wars if it's a right war, if it's protecting us. I was always against because I said, what's going to happen after we leave?","Well, what happened after we left? I was right on this one. I've been right on a lot of them. What happened after we left? Iran is taking over. So then I made the statement, took a lot of heat. I don't want to be in Iraq. I thought it was horrible. But I said if we're going to be -- maybe these people in Washington -- and I'm not talking necessarily, in this case, about Obama purely because he stayed there a long time.","But maybe they know something, maybe they're going to take the oil. You know, to the victor belong the spoils. Right? That's what I heard. So I said, They must have that in mind. Well, you know who's taking the oil right now? China and Iran is taking the oil. We get nothing. They don't even let us in the country.","Now you look at Afghanistan. Now Afghanistan's another catastrophe. We're in there for a trillion and we're fighting on this side of the mountain. And Karzai who gets satchels of money. Satchels, correct? He's nodding. He -- he looks like a good vet too. Satchels of money. $50 million in cash. I always say I want to know who is the person delivering the cash.","I want to know how does it feel to carry 50 million on your back. This is cash. I mean, not checks. This is cash. Who is authorized to give this? They're paying millions and millions of dollars in cash. And after all of that, Karzai has thrown us out like with dogs. He has thrown us out. Now, we're fighting on one side of the mountain, right over here.","Fighting and just getting -- really -- I mean, tremendous hurt for our great troops. On the other side of the mountain, and nobody realized this until about two years ago, Afghanistan has tremendous mineral rights, tremendous. Unbelievable! Far greater than anyone ever knew. So on the other side of the mountain, China has these massive machines taking all the minerals out of the ground and paying Afghanistan.","We get nothing. Are we stupid? Yes. Are we stupid? So I look at this, and I look at what's happening with our country and I look at what's happening with leadership. We should be, over the last five years, we have, through technology, found out that we could be and should be the energy capital of the world.","We don't need -- I'm all for the Keystone -- I'm all for the Keystone Pipeline. I love it. I think it's great -- should happen -- should've happened a long time ago. But we don't even need it because we don't need Canada's energy. I love Canada. We don't need their energy. We have it right under our own.","Build it, anyway. It's jobs, it's good, not going to hurt anybody and they all know that but we have it right here. We should be the energy capital of the world and we're not. Now, how are you going to pay off 17 trillion going to 21 trillion in debt if you don't do something? Everyone is beating us. Everybody is taking our jobs.","By the way, Mexico, you know name -- you don't hear it too much, right? You don't hear, Mexico. Oh, Mexico. Mexico is just beating us so badly. They're taking a tremendous number of jobs out of this country. And this is going to be a big problem because in the next four or five years, another prediction, you will see Mexico just draining us for jobs.","Just draining us. Now, a lot of problems with immigration but either you have a country or you don't. I mean it's very simple. You either have a country or you don't have a country. If people -- now you have to come up with a humane solution to people that have been here for many years, and they've raised their children all that and if they're productive people.","But we have a lot of unproductive people that are bad people and we've got to get them the hell out we have to -- You know, I heard Jeb Bush the other day and he was talking about people that come into this country illegally, they do it for love. And I said, Say it again I didn't get -- that's one I've never heard of before.","I've heard a lot. I've heard money, I've heard this, I've heard sex, I've heard everything. But one thing I never heard of was love. I understand what he's saying but you know -- It's out there. I'm not telling you. So we either have to have borders and I mean strong borders. I mean strong. And you know I'm a builder, I build great buildings.","Building -- building a border. You know they talk about, oh, I don't know how could we possibly build a fence that nobody can climb of? I would build a border like you've never seen before. Nobody's climbing up. Nobody. Now -- Thank you! Now, the problem that I have with politicians, not just our president and our president is obviously the leading example, is that politicians -- and I've known everyone, I know them all, I've known the Liberals, the Democrats, the Conservatives.","I happen to love the Tea Party. they kill me for loving the tea party. Oh! Do I take heat because I love -- you know, I have to say I went to Wharton School of Finance, the best school in the country. I -- I have to give my credentials because if you love the pe -- the Tea Party does not get fairly treated.","You know what the Tea Party is? The Tea Party are people that love this country, and love to work, and they love to pay taxes, and they want to pay more and more, and they want to get this country going, and frankly, these are incredible people and they don't get the right press. We got to get the Tea Party.","We love them. We got to get them a good press agent. We got to do it. But they're great people and they like me, actually, they do like me. Every time I make a speech I get far more people than -- and they're all Tea Party, they love me so that's good. But the problem with politicians is that we need somebody that's going to get things done.","And politicians are all talk and no action. It's true. All talk. It's all bullshit. It's all talk and it's no action. They talk and talk, and you go crazy and blah blah blah. In the meantime, everybody else is eating lunch. And you know I sort of thought -- and you know who's lunch it is? Our lunch.","It's tough but they are, they're -- it's -- and it's not their thing. You have known -- I've known so many and I respect them. They're incredible survivors. I call a great politician a survivor. They don't wanna insult anybody. They keep going. I've had politicians that -- and they're very nice to me. They really are.","They treat me very nicely. You know why? Because they want campaign contributions. And over the last few years, they also want my endorsement like badly. They all come up. But you know what? They -- they really -- you have to give them credit. They are trying to survive at their job. And I've gone to politicians over the years.","One, in particular, a congressman for many many years, and I've always supported him and I asked for his support on something that was really good for the country. A little controversial, a little controversial but not much. But really good for the country. And he tapped me along. You know just -- he can -- they can tap -- you don't even know, you leave their office and you got tapped.","You don't even know for about two weeks then two weeks later -- you know, that guy tapped me along. They're really good. I have respect for him. So he got tapped me along, then I say -- I call him like is it done? We're really looking at it. We're really, really looking at it. All right, good.","That's great. Good, I'll call you in a few weeks. Well, let me call you in about two months. I think I'll have some good news. He calls me in two months, you know it's a tough situation. Like two years go by. Then he announces retirement he was in Congress like, for 28 years. And I realized, these guys are unbelievable survivors.","He didn't like it because it was a little bit tough. He might lose two votes. It might not be perfect for him. It was not his comfort zone. But in the meantime, he did something very bad for that particular area. But I learned -- and I've seen it many times before. I've learned they're incredible survivors and I respect them for it. I actually had less respect before I realize this.","But the surviving is for themselves not for the country, not for the community, it's for themselves. It is selfish. Man said selfish. It is selfish. So -- and -- and, you know, one thing I said to them and I think I'm sort of kidding, but I go and I'll do these on occasion and David asked me to do this one.","And -- and I think David is an incredible guy so I agreed to do it and I said, You know, it's interesting every time I go to these things and I don't see him today which is really unusual, there are always teleprompters. You know I always say, take down the teleprompters and I say, you know maybe politicians shouldn't be allowed to use teleprompters.","Because -- and I said that to somebody backstage who's been in politics for years. They said I've never heard of that idea before. But we do come up with some ideas, you know. Because they write a speech, usually it's written by somebody else. Great speechwriter -- get a good speechwriter and then they stand up and they say, hello and they start reading the speech and they get off and you say, wasn't he fabulous?","But the truth is, you don't really find the essence of a man or a person. You don't really know that person when they're doing the teleprompter thing. And I think it's a cool idea. You know, you really could learn a lot about people. You don't see when you watch these people standing up, our president as the number one example.","But what do we know about him? He stands up, he reads lines off a teleprompter, most of the time, and then everyone says, oh, that was nice. And you'd go back. You don't learn anything. You don't learn about the person. And probably, if that didn't happen, he wouldn't have been elected. Maybe he wouldn't have been elected and maybe he would have been.","Because I will tell you, the last election, the Republicans should have won. How they blew that one is hard to believe. How they blew that one is so discouraging and so hard to believe. So, what we have to do is we have to straighten out the country. You know, it's -- just recently, I was thinking a lot and Steve mentioned the Wollman Rink and that is true.","It's -- it took eight years. The city spent $22 million. They were unable to do it. I went to Ed Koch, he was the mayor of New York City. I said I'd like to build it and if I don't build it quickly and for under $2 million dollars, I will pay for the whole cost myself. This is years ago, and I still have it today and it's the most successful rink anywhere in the world.","I mean, we do millions of people here. It's a fantastic success, and great and it's beautiful and managed properly and like a clock, right? That's the way we want it to run, right? But I went home I said, Let me do it. So eight years, 22 million. Now remember of the 22 million, I had to rip it all down so it wasn't like I could take advantage of some.","Somebody said, Oh, but you've got an advance. I said I don't have -- the advantage was I had to spend demolition money to rip it down. They didn't know what they were doing. I built it in three months and the reason I did, I have a daughter Ivanka. Do we all know Ivanka? She's great, she's great. I wanted -- she's a little girl, I want her to go ice skating before she got too old.","You know she said, Daddy, can I go ice skating? After eight years I said, You know what, I'm going to build a rink. And I used to go -- I'd walk through Central Park and I'd look at that rink and I'd see 200 men. You know it's a massive surface. It's actually a fantastically big, over an acre -- it's a lot, it's a lot of ice.","But I'd see two -- three hundred men sitting there all day long. And I'd say, why are they working while they're having their lunch? Well yeah, but they've been having it for hours. They -- they didn't do anything. Anyway, I got it. I kicked ass. I did a great job. Like the book, you know.","You know the book? Kick-Ass. But I did and -- and they -- and by the way, the workers loved it. Everybody loved it. The same work, the same everything but they did it right. We had the right plan. They used -- when the city first started the wall Merrick, little fact that nobody knows, they went to Miami to get an engineer who built refrigerators like, you know, like for putting food in and they used freon.","It was a gas. Now that's OK for a refrigerator but the problem is, if there's a tiny little hole. There were 10 miles of pipe, and if you have one little hole like the size of a pin, you'll never cool the ice. So they'd put this beautiful copper put tubing in, and they'd go home with no security and they'd come back the next day, it was all robbed because people would steal the cup.","So this went on for years and years and years. So when I took over the rink, I said, Let me see the engineer. They said he's from Miami. I said, Miami? It's 94 degrees in Miami. I said, Do me a favor, who's the head of the Montreal Canadiens hockey team. Better idea, right? I called him he was a great guy.","He sent down his engineer and he said, Mr. Trump, this is crazy what they're doing. They'll never be able to make ice. Which they weren't able to do. They did finish it a couple of times. They weren't able to make ice. They had a little problem. They couldn't even make ice when it was 20 degrees out which is really scary.","So what happened is I call him up. He comes down and in about two minutes, he realized it was wrong. He said, You're using the wrong thing. Today, you use brine. You know what brine is? Brine is water with salt in it. And you put it in rubber tubes under the concrete and the ice it never freezes because it has salt in it, OK? So it's got salt, so it's a rubber tube, salt, and water.","So the water doesn't freeze. So they make the water very cold it cools it, it -- we had ice so fast, it was like, I couldn't believe it. The city couldn't believe it. Nobody couldn't believe it. One little story, when they poured the concrete -- I love this, I love this story. When they poured the concrete, they poured it in an angle.","So one side of the rink had two and a half feet of water and the other had nothing. It was -- yes this is true. And you couldn't cool two and even I couldn't cool two and a half feet. You know, I want to like, four inches, right? So, we had to rip it all apart, and we did and we got it. It was a tremendous success.","And today, in the Wharton School of Finance, and Harvard, and Stanford they study that. It's free enterprise versus government and we need more now. We need more. But I do that. I fix things. That's what I do. I got rich by fixing things. I buy something and usually, I'll buy it at a bankrupt. The problem is every time I buy something out of bankruptcy, they said, Trump went bankrupt.","I never went. By the way, I never went bankrupt. I just bought Doral out of bankruptcy two years ago. And a story said, Trump 800 acres in the middle of Miami, the most beautiful place. It's going to be the greatest resort in the country and it's already there. You saw the tournament four weeks ago with Tiger Woods, everybody.","But I just bought Doral out of bankruptcy and some reported -- they're very dishonest people, a lot of these people. They said, Trump files for bankruptcy. I -- every time I buy something out of bankruptcy, I filed for bankruptcy. I bought a house in Palm Beach for $40 million out of bankruptcy. I sold it for a hundred.","Not a bad deal, right? We need -- I don't, I don't want to brag but this is what we need in the country, you know. We got to make deals like this much bigger. We got to make those deals. But -- because I bought it out of bank, you know -- hey look, I am worth now a lot but because I bought it out of bankruptcy, they said, Donald Trump, who is bankrupt took the house and sold it. I bought the house out of bankruptcy.","So all the time -- you know it's sort of interesting when Buff -- when Buffett plays with bankruptcy, when Icahn plays with bankruptcy when all these other guys do the same thing, nobody says that about them. So, just -- so every time you see that crap, just remember it's a dishonest reporter, OK? A really dishonest reporter.","But what we need is we need somebody that's going to make the great deals for this country. We need to make our country rich again. I'm starting construction in four weeks on the Old Post Office Building on Pennsylvania Avenue, amazingly right next to the White House. Coincidence. This means if I don't make the one thing I can always have the other as a fallback position.","Right? I mean, it's much bigger than the White House and I'm going to try and make it just as nice but we're -- I'm building a -- a tremendous hotel there. It's going to be amazing. We start in four weeks. It's gonna be really amazing but what it means is lots of jobs. You want to make great deals, you want to make lots of jobs, you want to put money into the system but the country has to be doing that too because, you know, we're very small.","The country is very big. If the country's going bad and you're doing well, you're not going to do long -- well long because you can't really counteract all that negativity, all the unemployment, all of the problems giving it away to China and to other countries, many other countries. I mean, China is not -- OPEC as an example.","Why is oil, with all the energy that we have, how come oil is always setting all-time highs? Because OPEC has hired every lobbyist and what -- you try and get a lobbyist to go against OPEC. You can't do it. You just can't do it. So you say to yourself, where are our competent leaders? The problem is now, we don't need competent leaders, we need unbelievable, genius, smart as hell leaders because we're no longer at the stage where we can have somebody competent.","We need something far more than that. Now, I'll say something that a lot of Republicans disagree with me on but they really don't. Again, my friends at the Tea Party they did a poll and 78% of them -- Now, these are Tea Party people, these are people that love the country, OK? They love the country more than -- I mean, more than most, OK? 78% of those people said don't touch my Medicare, Medicaid, or Social Security.","Look, stand up. Am I right? OK. And this guy is a good American right here. Leave my Medicare alone, right? You better believe it. OK. And yet you have Paul Ryan who was chosen as a vice president -- and I think he's a very nice person. I met him once briefly. I think he's a very nice person but his whole stance is to knock the hell out of Medicare, Medicaid, and Social Security and the Democrats love it. They love it. They just sit back.","They don't even have to campaign. But the truth is, I feel very differently. I would leave it alone. I don't want to hurt people. Now you've got to get rid of the fraud, and the abuse, and all of those things and that we agree with, right? Because there's tremendous fraud. I mean, some of these doctors and some of these people are ripping off this country.","You wouldn't believe they become rich. When a doctor drives up to my place and they buy an apartment in Trump Tower and they're driving a Ferrari -- what do you do? I'm a practicing doctor. Oh, great! Congratulations! You're doing pretty well, right? But you have to stop the fraud and the abuse. But you -- you have to be able to keep it. I mean, Social Security is so -- and Medicare, Medicaid run it properly.","But, in all fairness, you have to be able to go through and -- and I mean it and I mean strongly, you have to make this country strong. You have to make this country wealthy. When this country becomes wealthy, your Social Security, your Medicare, your Medicaid will be taken care of. It will work. It will work and it will work well.","Now, when the Republicans are out there always saying cutting back on entitlements, everything else. And you know again, fine. You do what you have to do in terms of abuse, and theft, and crookedness, and all the things that are going on because it's a mess. But you got to protect the people. A lot of these people, they worked all their lives and then they're going to find out that their Social Security is going to be harmed and taken away.","It's not fair. So how do you solve that? And how do you solve jobs? And how do you solve all of these things that I talked about? How do you solve the military? We have to build up the military not take it down, build it up. By the way, if we build it up, you're going to see Putin and all these people -- All of a sudden he's, oh, hey, hey let's meet, let's have fun let's have -- You know he's not doing what he's doing, he's doing because he doesn't respect us. He doesn't respect us as a country.","He sees what's happening. China is taking over areas that we always had. I don't know if we even want those areas. Let's rebuild our country first. Let's rebuild our schools, and our roads, and our bridges. You know, in China, right now, they're building more bridges than we've ever built in this country.","You know how many bridges we're building? Like none. We don't, we don't have any money. We're building nothing. So, I always end by saying we have to make this country great again. When we make this country great, and when we make this country strong, and it's a word I'm -- a lot of people say, oh, it's a terrible word.","When we make this country wealthy, wealthy, then we can afford all of the things that you're really entitled to. So, it's been an honor to be here. I love New Hampshire. Perhaps I'll see you again. Thank you very much. Thank you. Thank you. Thank you. Thank you very much."],"text":" I want that syrup, Steve. Thank you very much. That was very nice. Well, I want to thank David Bossie. The whole group has been amazing and -- and you know, Citizens United, Americans for Prosperity. It's a great honor to be here. I love New Hampshire. I've been here many times before. Special place, special people. People that love to work. They're workers. And I like that, and I think countries need that. And to be honest, we have something that we have to do and we have to do it fast. We have to make America great again. We have to do it. It's just not going to be able to continue onward. And we're just not going to be able to do it if we don't take this country and bring it back. It's got to be brought back and it's got to be brought back fast. Our country is in very serious trouble. Jobs, unemployment through the roof. You look at indexes, some of them are the worst that we've had in 36 years, 36 years. Despite that, you have a number that's below 7% and we all know that doesn't matter, the number, because they don't report it the old-fashioned way the way they used to where people were unemployed, they were unemployed. Now if you stop looking for a job because you can't find one, they consider you to be employed, essentially. As a country, we're in such serious trouble. We owe $17 trillion, much of it to China who does numbers on us like nobody has really ever done numbers. We have deficits that are massive on a yearly basis. We don't have the right people negotiating for us. Obamacare is an absolute catastrophe. It's a disaster. It's a disaster. You know they say they had seven million startups. Now does anybody really believe that? OK. Just an impossibility. It's actually impossible. How many people have paid? They don't mention these seven to 10 million people that lost their plan, lost their doctors. Obamacare has been the single greatest lie that I've ever witnessed and I've been in politics and watching politics for a long time. Single greatest lie. Now think of this, we all have websites, many of us. I have a lot of websites. Every time I do a job, I have a website. Cost me about $3, right? You set it up. You get this guy. You get this woman. You know I made the -- the mistake. Somebody said, You get this young kid and you put him in. And somebody said, Well, I'm an older person and I do it, do you discriminate? I said, No I get older people, I get young people, I get everybody. Cost me so little. They spent well over $1 billion to do a website. Nobody even talks about it. And then yesterday, I mean to me, you know, they sort of skipped over it but I think it's going to be one of the great classic lines in the history of politics and incompetence. And that was when Secretary Sebelius, on the podium like this, with the president here -- he must have been just going wild. Can you imagine what this guy was thinking? She said, Unfortunately, a page is missing. And that's emblematic of -- of Obamacare. A page is missing, the whole thing is missing. Now as a very conservative person and as somebody that is a Republican and proud to be, we don't get treated the same way. If that were done by some Republican, they would make that person into the dumbest, most incompetent human being that anybody has ever seen. With her they said, Oh, isn't that cute, she lost a page. Wasn't that cute? Wasn't that cute? I watch -- I mean, I couldn't believe it. They were trying to make it like it was a wonderful thing. When President Obama was interviewed a couple of weeks ago by Zach, whatever his name is, to get the youth. And they started talking about, you were born in Kenya, he's going, oh, my god. They go all sorts of other things. As you know, they said some nasty things. And he's like -- I mean, he was so furious. You could see he want to get out. He's looking for the aid that set that interview to -- he won't fire because he doesn't fire people, actually. But -- Never fires people. But you could see how angry he was. And I watch the commentary on it and everybody was saying, wasn't that fun? The only one not having fun was him. That was a brutal time but they didn't make it like it was which was very bad, very disrespectful to the president. They made it like, geez, wasn't that -- wasn't that wonderful, wasn't that great? OK. So we have a lot of problems going on to this country. I'm a big believer in free trade. But you know, with free trade, you need competent people. I actually don't like free trade with incompetent people because everybody is just kicking our ass. Every country. So I like to say fair trade as opposed to free trade. I like to say smart trade which I haven't heard but I've come up with it very recently. Really smart trade. And you know, I know people on Wall Street that are so smart that are so brilliant, business-wise, that if I put them to negotiate against China, Japan, Mexico, you name them. I mean, I could go on forever because we have no good deals anymore. We would take one person, put him in charge of China. I know them all. China doesn't have a chance. But we take these people that are diplomats, that are political appointees, that raised money for the president. You know raised ten thousand dollars and you get yourself a nice position and you can negotiate with China. Good luck! And then we wonder why China is laughing at us. Why they're outsmarting at us. And -- and you know, I don't know if you saw the other day but it was shocking to people. They just devalued their currency again. Now, a lot of people don't know economics. I went to the Wharton School of Finance. I was really good at this stuff but I mean, it's also common sense. It makes it really tough for us to compete for product, and for jobs, and for all the other things that they're taken out of our system. And nobody would have thought they would've had the courage, a few weeks ago, to devalue their currency again. And they did it because they have no respect for our president and they have no respect for our country. None. Now think of it, the military. I'm a big believer in military. I don't want to use it. But when you have it, you don't have to use it. You know it's interesting when you don't have it, you have to use it. When you have it, you don't have to use it. And we're cutting way back many many decades. It hasn't been this week. Many many decades, we haven't spent this little as a percentage and we're cutting way back. And yet, you look at Putin who is absolutely having a great time. You know, we've foisted him onto the stage again. Russia is like -- I mean, they're really hot stuff. And now you have people in the Ukraine, who knows, setup or not, but it can't all be set up. I mean, they're marching in favor of joining Russia. I mean, you know, you can send some people in. But Russia -- I mean, what he's done for Russia is really amazing and he's done it by outsmarting our country at every single step. You look at Syria. You look at Iran. Iran is taking the oil from Iraq. We spent $2 trillion on Iraq. Two trillion. Hard to believe. You know that word didn't even exist like six years ago. Now you don't hear billion anymore, all you hear is trillion. We spent $2 trillion fighting in Iraq for years and years. More importantly, the soldiers we lost, the great people that we lost. And I come from New York, and I help wounded warriors and all. I mean, so many of them with the legs, and with the arms, and with the trauma that they are going through. The trauma for what? Now you look at Iraq, we don't -- we have nothing to do -- have -- has anyone heard about Iraq? You know who's taken Iraq? Iran. You know, for years and years, and decades and decades they were the same, the same strength. They go two feet this way, two feet that way, two feet this way, two feet that way. And then they'd say, let's have a truce. Now, we've decapitate -- I've always been a big -- hey look, I'm a very -- I -- I believe strongly in military -- I'm very strong into the military, I'm very strong in doing wars if it's a right war, if it's protecting us. I was always against because I said, what's going to happen after we leave? Well, what happened after we left? I was right on this one. I've been right on a lot of them. What happened after we left? Iran is taking over. So then I made the statement, took a lot of heat. I don't want to be in Iraq. I thought it was horrible. But I said if we're going to be -- maybe these people in Washington -- and I'm not talking necessarily, in this case, about Obama purely because he stayed there a long time. But maybe they know something, maybe they're going to take the oil. You know, to the victor belong the spoils. Right? That's what I heard. So I said, They must have that in mind. Well, you know who's taking the oil right now? China and Iran is taking the oil. We get nothing. They don't even let us in the country. Now you look at Afghanistan. Now Afghanistan's another catastrophe. We're in there for a trillion and we're fighting on this side of the mountain. And Karzai who gets satchels of money. Satchels, correct? He's nodding. He -- he looks like a good vet too. Satchels of money. $50 million in cash. I always say I want to know who is the person delivering the cash. I want to know how does it feel to carry 50 million on your back. This is cash. I mean, not checks. This is cash. Who is authorized to give this? They're paying millions and millions of dollars in cash. And after all of that, Karzai has thrown us out like with dogs. He has thrown us out. Now, we're fighting on one side of the mountain, right over here. Fighting and just getting -- really -- I mean, tremendous hurt for our great troops. On the other side of the mountain, and nobody realized this until about two years ago, Afghanistan has tremendous mineral rights, tremendous. Unbelievable! Far greater than anyone ever knew. So on the other side of the mountain, China has these massive machines taking all the minerals out of the ground and paying Afghanistan. We get nothing. Are we stupid? Yes. Are we stupid? So I look at this, and I look at what's happening with our country and I look at what's happening with leadership. We should be, over the last five years, we have, through technology, found out that we could be and should be the energy capital of the world. We don't need -- I'm all for the Keystone -- I'm all for the Keystone Pipeline. I love it. I think it's great -- should happen -- should've happened a long time ago. But we don't even need it because we don't need Canada's energy. I love Canada. We don't need their energy. We have it right under our own. Build it, anyway. It's jobs, it's good, not going to hurt anybody and they all know that but we have it right here. We should be the energy capital of the world and we're not. Now, how are you going to pay off 17 trillion going to 21 trillion in debt if you don't do something? Everyone is beating us. Everybody is taking our jobs. By the way, Mexico, you know name -- you don't hear it too much, right? You don't hear, Mexico. Oh, Mexico. Mexico is just beating us so badly. They're taking a tremendous number of jobs out of this country. And this is going to be a big problem because in the next four or five years, another prediction, you will see Mexico just draining us for jobs. Just draining us. Now, a lot of problems with immigration but either you have a country or you don't. I mean it's very simple. You either have a country or you don't have a country. If people -- now you have to come up with a humane solution to people that have been here for many years, and they've raised their children all that and if they're productive people. But we have a lot of unproductive people that are bad people and we've got to get them the hell out we have to -- You know, I heard Jeb Bush the other day and he was talking about people that come into this country illegally, they do it for love. And I said, Say it again I didn't get -- that's one I've never heard of before. I've heard a lot. I've heard money, I've heard this, I've heard sex, I've heard everything. But one thing I never heard of was love. I understand what he's saying but you know -- It's out there. I'm not telling you. So we either have to have borders and I mean strong borders. I mean strong. And you know I'm a builder, I build great buildings. Building -- building a border. You know they talk about, oh, I don't know how could we possibly build a fence that nobody can climb of? I would build a border like you've never seen before. Nobody's climbing up. Nobody. Now -- Thank you! Now, the problem that I have with politicians, not just our president and our president is obviously the leading example, is that politicians -- and I've known everyone, I know them all, I've known the Liberals, the Democrats, the Conservatives. I happen to love the Tea Party. they kill me for loving the tea party. Oh! Do I take heat because I love -- you know, I have to say I went to Wharton School of Finance, the best school in the country. I -- I have to give my credentials because if you love the pe -- the Tea Party does not get fairly treated. You know what the Tea Party is? The Tea Party are people that love this country, and love to work, and they love to pay taxes, and they want to pay more and more, and they want to get this country going, and frankly, these are incredible people and they don't get the right press. We got to get the Tea Party. We love them. We got to get them a good press agent. We got to do it. But they're great people and they like me, actually, they do like me. Every time I make a speech I get far more people than -- and they're all Tea Party, they love me so that's good. But the problem with politicians is that we need somebody that's going to get things done. And politicians are all talk and no action. It's true. All talk. It's all bullshit. It's all talk and it's no action. They talk and talk, and you go crazy and blah blah blah. In the meantime, everybody else is eating lunch. And you know I sort of thought -- and you know who's lunch it is? Our lunch. It's tough but they are, they're -- it's -- and it's not their thing. You have known -- I've known so many and I respect them. They're incredible survivors. I call a great politician a survivor. They don't wanna insult anybody. They keep going. I've had politicians that -- and they're very nice to me. They really are. They treat me very nicely. You know why? Because they want campaign contributions. And over the last few years, they also want my endorsement like badly. They all come up. But you know what? They -- they really -- you have to give them credit. They are trying to survive at their job. And I've gone to politicians over the years. One, in particular, a congressman for many many years, and I've always supported him and I asked for his support on something that was really good for the country. A little controversial, a little controversial but not much. But really good for the country. And he tapped me along. You know just -- he can -- they can tap -- you don't even know, you leave their office and you got tapped. You don't even know for about two weeks then two weeks later -- you know, that guy tapped me along. They're really good. I have respect for him. So he got tapped me along, then I say -- I call him like is it done? We're really looking at it. We're really, really looking at it. All right, good. That's great. Good, I'll call you in a few weeks. Well, let me call you in about two months. I think I'll have some good news. He calls me in two months, you know it's a tough situation. Like two years go by. Then he announces retirement he was in Congress like, for 28 years. And I realized, these guys are unbelievable survivors. He didn't like it because it was a little bit tough. He might lose two votes. It might not be perfect for him. It was not his comfort zone. But in the meantime, he did something very bad for that particular area. But I learned -- and I've seen it many times before. I've learned they're incredible survivors and I respect them for it. I actually had less respect before I realize this. But the surviving is for themselves not for the country, not for the community, it's for themselves. It is selfish. Man said selfish. It is selfish. So -- and -- and, you know, one thing I said to them and I think I'm sort of kidding, but I go and I'll do these on occasion and David asked me to do this one. And -- and I think David is an incredible guy so I agreed to do it and I said, You know, it's interesting every time I go to these things and I don't see him today which is really unusual, there are always teleprompters. You know I always say, take down the teleprompters and I say, you know maybe politicians shouldn't be allowed to use teleprompters. Because -- and I said that to somebody backstage who's been in politics for years. They said I've never heard of that idea before. But we do come up with some ideas, you know. Because they write a speech, usually it's written by somebody else. Great speechwriter -- get a good speechwriter and then they stand up and they say, hello and they start reading the speech and they get off and you say, wasn't he fabulous? But the truth is, you don't really find the essence of a man or a person. You don't really know that person when they're doing the teleprompter thing. And I think it's a cool idea. You know, you really could learn a lot about people. You don't see when you watch these people standing up, our president as the number one example. But what do we know about him? He stands up, he reads lines off a teleprompter, most of the time, and then everyone says, oh, that was nice. And you'd go back. You don't learn anything. You don't learn about the person. And probably, if that didn't happen, he wouldn't have been elected. Maybe he wouldn't have been elected and maybe he would have been. Because I will tell you, the last election, the Republicans should have won. How they blew that one is hard to believe. How they blew that one is so discouraging and so hard to believe. So, what we have to do is we have to straighten out the country. You know, it's -- just recently, I was thinking a lot and Steve mentioned the Wollman Rink and that is true. It's -- it took eight years. The city spent $22 million. They were unable to do it. I went to Ed Koch, he was the mayor of New York City. I said I'd like to build it and if I don't build it quickly and for under $2 million dollars, I will pay for the whole cost myself. This is years ago, and I still have it today and it's the most successful rink anywhere in the world. I mean, we do millions of people here. It's a fantastic success, and great and it's beautiful and managed properly and like a clock, right? That's the way we want it to run, right? But I went home I said, Let me do it. So eight years, 22 million. Now remember of the 22 million, I had to rip it all down so it wasn't like I could take advantage of some. Somebody said, Oh, but you've got an advance. I said I don't have -- the advantage was I had to spend demolition money to rip it down. They didn't know what they were doing. I built it in three months and the reason I did, I have a daughter Ivanka. Do we all know Ivanka? She's great, she's great. I wanted -- she's a little girl, I want her to go ice skating before she got too old. You know she said, Daddy, can I go ice skating? After eight years I said, You know what, I'm going to build a rink. And I used to go -- I'd walk through Central Park and I'd look at that rink and I'd see 200 men. You know it's a massive surface. It's actually a fantastically big, over an acre -- it's a lot, it's a lot of ice. But I'd see two -- three hundred men sitting there all day long. And I'd say, why are they working while they're having their lunch? Well yeah, but they've been having it for hours. They -- they didn't do anything. Anyway, I got it. I kicked ass. I did a great job. Like the book, you know. You know the book? Kick-Ass. But I did and -- and they -- and by the way, the workers loved it. Everybody loved it. The same work, the same everything but they did it right. We had the right plan. They used -- when the city first started the wall Merrick, little fact that nobody knows, they went to Miami to get an engineer who built refrigerators like, you know, like for putting food in and they used freon. It was a gas. Now that's OK for a refrigerator but the problem is, if there's a tiny little hole. There were 10 miles of pipe, and if you have one little hole like the size of a pin, you'll never cool the ice. So they'd put this beautiful copper put tubing in, and they'd go home with no security and they'd come back the next day, it was all robbed because people would steal the cup. So this went on for years and years and years. So when I took over the rink, I said, Let me see the engineer. They said he's from Miami. I said, Miami? It's 94 degrees in Miami. I said, Do me a favor, who's the head of the Montreal Canadiens hockey team. Better idea, right? I called him he was a great guy. He sent down his engineer and he said, Mr. Trump, this is crazy what they're doing. They'll never be able to make ice. Which they weren't able to do. They did finish it a couple of times. They weren't able to make ice. They had a little problem. They couldn't even make ice when it was 20 degrees out which is really scary. So what happened is I call him up. He comes down and in about two minutes, he realized it was wrong. He said, You're using the wrong thing. Today, you use brine. You know what brine is? Brine is water with salt in it. And you put it in rubber tubes under the concrete and the ice it never freezes because it has salt in it, OK? So it's got salt, so it's a rubber tube, salt, and water. So the water doesn't freeze. So they make the water very cold it cools it, it -- we had ice so fast, it was like, I couldn't believe it. The city couldn't believe it. Nobody couldn't believe it. One little story, when they poured the concrete -- I love this, I love this story. When they poured the concrete, they poured it in an angle. So one side of the rink had two and a half feet of water and the other had nothing. It was -- yes this is true. And you couldn't cool two and even I couldn't cool two and a half feet. You know, I want to like, four inches, right? So, we had to rip it all apart, and we did and we got it. It was a tremendous success. And today, in the Wharton School of Finance, and Harvard, and Stanford they study that. It's free enterprise versus government and we need more now. We need more. But I do that. I fix things. That's what I do. I got rich by fixing things. I buy something and usually, I'll buy it at a bankrupt. The problem is every time I buy something out of bankruptcy, they said, Trump went bankrupt. I never went. By the way, I never went bankrupt. I just bought Doral out of bankruptcy two years ago. And a story said, Trump 800 acres in the middle of Miami, the most beautiful place. It's going to be the greatest resort in the country and it's already there. You saw the tournament four weeks ago with Tiger Woods, everybody. But I just bought Doral out of bankruptcy and some reported -- they're very dishonest people, a lot of these people. They said, Trump files for bankruptcy. I -- every time I buy something out of bankruptcy, I filed for bankruptcy. I bought a house in Palm Beach for $40 million out of bankruptcy. I sold it for a hundred. Not a bad deal, right? We need -- I don't, I don't want to brag but this is what we need in the country, you know. We got to make deals like this much bigger. We got to make those deals. But -- because I bought it out of bank, you know -- hey look, I am worth now a lot but because I bought it out of bankruptcy, they said, Donald Trump, who is bankrupt took the house and sold it. I bought the house out of bankruptcy. So all the time -- you know it's sort of interesting when Buff -- when Buffett plays with bankruptcy, when Icahn plays with bankruptcy when all these other guys do the same thing, nobody says that about them. So, just -- so every time you see that crap, just remember it's a dishonest reporter, OK? A really dishonest reporter. But what we need is we need somebody that's going to make the great deals for this country. We need to make our country rich again. I'm starting construction in four weeks on the Old Post Office Building on Pennsylvania Avenue, amazingly right next to the White House. Coincidence. This means if I don't make the one thing I can always have the other as a fallback position. Right? I mean, it's much bigger than the White House and I'm going to try and make it just as nice but we're -- I'm building a -- a tremendous hotel there. It's going to be amazing. We start in four weeks. It's gonna be really amazing but what it means is lots of jobs. You want to make great deals, you want to make lots of jobs, you want to put money into the system but the country has to be doing that too because, you know, we're very small. The country is very big. If the country's going bad and you're doing well, you're not going to do long -- well long because you can't really counteract all that negativity, all the unemployment, all of the problems giving it away to China and to other countries, many other countries. I mean, China is not -- OPEC as an example. Why is oil, with all the energy that we have, how come oil is always setting all-time highs? Because OPEC has hired every lobbyist and what -- you try and get a lobbyist to go against OPEC. You can't do it. You just can't do it. So you say to yourself, where are our competent leaders? The problem is now, we don't need competent leaders, we need unbelievable, genius, smart as hell leaders because we're no longer at the stage where we can have somebody competent. We need something far more than that. Now, I'll say something that a lot of Republicans disagree with me on but they really don't. Again, my friends at the Tea Party they did a poll and 78% of them -- Now, these are Tea Party people, these are people that love the country, OK? They love the country more than -- I mean, more than most, OK? 78% of those people said don't touch my Medicare, Medicaid, or Social Security. Look, stand up. Am I right? OK. And this guy is a good American right here. Leave my Medicare alone, right? You better believe it. OK. And yet you have Paul Ryan who was chosen as a vice president -- and I think he's a very nice person. I met him once briefly. I think he's a very nice person but his whole stance is to knock the hell out of Medicare, Medicaid, and Social Security and the Democrats love it. They love it. They just sit back. They don't even have to campaign. But the truth is, I feel very differently. I would leave it alone. I don't want to hurt people. Now you've got to get rid of the fraud, and the abuse, and all of those things and that we agree with, right? Because there's tremendous fraud. I mean, some of these doctors and some of these people are ripping off this country. You wouldn't believe they become rich. When a doctor drives up to my place and they buy an apartment in Trump Tower and they're driving a Ferrari -- what do you do? I'm a practicing doctor. Oh, great! Congratulations! You're doing pretty well, right? But you have to stop the fraud and the abuse. But you -- you have to be able to keep it. I mean, Social Security is so -- and Medicare, Medicaid run it properly. But, in all fairness, you have to be able to go through and -- and I mean it and I mean strongly, you have to make this country strong. You have to make this country wealthy. When this country becomes wealthy, your Social Security, your Medicare, your Medicaid will be taken care of. It will work. It will work and it will work well. Now, when the Republicans are out there always saying cutting back on entitlements, everything else. And you know again, fine. You do what you have to do in terms of abuse, and theft, and crookedness, and all the things that are going on because it's a mess. But you got to protect the people. A lot of these people, they worked all their lives and then they're going to find out that their Social Security is going to be harmed and taken away. It's not fair. So how do you solve that? And how do you solve jobs? And how do you solve all of these things that I talked about? How do you solve the military? We have to build up the military not take it down, build it up. By the way, if we build it up, you're going to see Putin and all these people -- All of a sudden he's, oh, hey, hey let's meet, let's have fun let's have -- You know he's not doing what he's doing, he's doing because he doesn't respect us. He doesn't respect us as a country. He sees what's happening. China is taking over areas that we always had. I don't know if we even want those areas. Let's rebuild our country first. Let's rebuild our schools, and our roads, and our bridges. You know, in China, right now, they're building more bridges than we've ever built in this country. You know how many bridges we're building? Like none. We don't, we don't have any money. We're building nothing. So, I always end by saying we have to make this country great again. When we make this country great, and when we make this country strong, and it's a word I'm -- a lot of people say, oh, it's a terrible word. When we make this country wealthy, wealthy, then we can afford all of the things that you're really entitled to. So, it's been an honor to be here. I love New Hampshire. Perhaps I'll see you again. Thank you very much. Thank you. Thank you. Thank you. Thank you very much."}