{"id":521,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech at the NC GOP Convention in Greensboro, NC","date":"2012-06-01","link":"https://factba.se/transcript/donald-trump-speech-greensboro-nc-june-1-2012","paragraphs":["Wow, what a group. This is great. You know, I've turned down many of these over the last couple of months. The -- they want me to do the little speech for the conventions and I love doing it, but I really love North Carolina. And I have to tell you, I'm different from your average speaker because I really back up my words.","I just bought a huge job in North Carolina, and -- right outside of Charlotte. It was called The Point, and now it's called Trump National. What do, I mean, you know, do you expect? And it's a great job. It's a beautiful job on Lake Norman, one of the biggest lakes anywhere, and it's magnificent. And we love it, and it's going to be something very special.","I'm really happy because I was told by John and others that you broke your records tonight and anything I can do to help really makes me feel good. Now, by breaking records, that means you're going to raise more money than you ever anticipated, you're going to use the money wisely, and you will defeat Barack Obama.","Very important. Now, you know, today, when I left New York, I happened to turn on the television and saw some news. The market had one of its worst days today, very, very bad day. Jobs numbers were absolutely terrible. 13 million people out of work. That's a hell of a lot of people. 13 million. And the unemployment rate went up today.","And all of this is bad news, and frankly, you could say good news for the Republicans in terms of an election. But I don't care. We love the country first. So it's bad news as far as I'm concerned. We really have difficulty in this country. So many things, if you just pick up today's paper. In San Francisco, they're building something called the Bay Bridge.","Who's building it? You think the people of Los Angeles, the people of San Francisco, the people of California. No. You know who is building it? The Chinese are building the Bay Bridge. $1.8 billion, and now they have tremendous cost overruns, and it turned out that if they would have used American labor, they could have done it cheaper.","And this is the kind of thing that's happening to our country. The United States has become a laughing stock and a whipping post for the rest of the world. America today is clearly missing quality leadership like probably never ever before. On numerous occasions, I've warned that countries like China, India, Korea, Mexico, the OPEC nations, who are really having a field day with us. Believe me. And I've been talking about it for years.","And we can't go on. We cannot continue to go on where countries are laughing at us, laughing at ours -- our leaders, laughing at every single thing we do. You know, it used to be that we had the greatest negotiators. We were the kings and queens. And today, we're a laughing stock, and I can tell you, the people in this room don't like it and I don't like it. We're losing hundreds of billions of dollars a year.","China, this year, will make $350 billion on us. Call it profit. Call it whatever you want. The number is going to be 350 billion, and probably, it's going up. Then today, if you read the newspaper, they've devalued their currency. By the way, that doesn't sound good, but it's great for them and bad for us as you can probably suspect.","They don't respect us. And that devaluation, which nobody believed was possible that they'd actually have the audacity to do it. That devaluation is going to make it really, really hard for our companies to compete against Chinese companies and China itself. It's a terrible thing. And what do we do? We go out and we hold beautiful, beautiful receptions and dinners, black tie for the President of China when he comes over.","And some people loved what I said and some people didn't. I said, \"If he came over when I was around, I wouldn't give him black tie dinners. I'd talk to him first. I'd bring him into the office and would discuss things, and we'd see how he responds. And if he continues to take advantage of this country, there is no black tie dinner, there's no McDonald's, there's no nothing.","It's like, thanks a lot, folks.\" Because -- because the fact is, we have all the cards. People don't realize it. We are rebuilding China. Now, I usually say, when was the last time you see a bridge, a major bridge like a George Washington Bridge, a Verrazano Bridge? When was the last time you saw a bridge being built in this country?","Then I realized, they are doing one, the Bay Bridge that we just mentioned. But that's being built by the Chinese too. You go to China, you go to the OPEC nations, you go to some of these nations, it's unbelievable what you do. And then you fly back home and you land in New York, you land in Los Angeles, you come to LaGuardia Airport, Kennedy Airport, LAX, and we're like a third world country.","I was in one of the very, very rich oil states, and the head -- and I'm not knocking them. I think it's great. I have a lot of friends that are leaders of these countries, that are leaders of the economies, and they don't believe what they're getting away with. They can't believe it. But he's showing me an airport.","The most beautiful airport I've ever seen. Most beautiful I've ever seen. And he actually showed me where they have a spa so the people before they get onto the plane can go to the spa, they can get massages, they can do all sorts of things. I never saw anything like this. And I said to him, \"This is the single most beautiful airport I've ever seen.\" He goes, \"No, no, no, no, no, you don't understand.","This is just temporary. We are ripping this down next year. Look on the horizon.\" And I saw 42 cranes on the horizon, building something like I've never seen before, the real airport. And then I land at LaGuardia and I say, \"Can you believe this? Can you believe this?\" When you see that place, you know what I'm talking about.","It's a disgrace. When I look at countries like the country of Colombia, very good people. But you looked that last year, they made four billion dollars on us. We don't make money with anybody. And then you hear about Social Security, and Medicare, and Medicaid, and you know, I hear so many different theories and so many different ways, and obviously, we all agreed, we have to stop the fraud.","We have to stop the abuse. But, you know, the greatest thing we could do? If we got this country roaring again, and the potential is enormous. But if we got this country roaring, roaring, roaring, it solves the problems. But you can't do that when China's taking our jobs. You can't do it. When China's taking our jobs -- we're a bunch of patsies when they're making our product.","And not only China. Now China is the worst abuser. Then, I guess, you could say OPEC. But, you know, there's a big question, who abuses us more? OPEC, those nations wouldn't be there except for us. And, you know, one of the things that I find amazing. They talk about Barack Obama and his foreign policy. What's his foreign policy?","Think of it. He goes in and doesn't defend Egypt where Egypt was -- look, I don't know what they say behind our back. You can imagine. But at least outwardly, they were supporting Israel and they were doing lots of good things toward the United States, and we paid them a lot of money. We pay everybody lots of money.","We can't do it on our own merit. We have to pay everybody. But we go -- and now that regime is taken over by a group of people that make them look like babies. Totally anti the United States, totally anti-Israel, totally anti-everything. What have we done? And the rest of the world sees how we acted. And they say, ''Well, we can't count on -- we just can't count on the United States.\" I look at what we've done in Iraq.","And, you know, I got in some trouble for saying this, but I'm not changing my mind. The nice part about not being a politician is I can say what I want, and if people like it -- if people like it, that's fine. If they don't like it, that's OK too. But look at Iraq. The smart people said, when we went into Iraq, we went in for the oil.","OK? Because it never made sense. They didn't have the weapons of mass destruction, we learned that early on. We ended up in this absolute quagmire, $1.5 trillion, thousands of lives, and our wounded veterans all over the United States, you see them all over the United States. And I made the statement very strongly a few years ago.","I said, \"Look, they have the second largest oil reserves in the world.\" People don't know that, right after Saudi Arabia. I said, \"Why aren't we at least paying ourselves back out of that oil?\" And these -- and these stupid politicians said -- and some of the press, by the way, in all fairness, because I think the press maybe leads the politicians instead of the other way around.","But these stupid politicians say, \"Can you believe a horrible, horrible statement like that? We're supposed to give them democracy.\" They're going to have democracy, folks. They're going to be the meanest -- the meanest, hardest, greatest hater of the United States will take over, will take the oil, will build his own palaces.","And what have we done and what have we gotten for it? So I actually said, \"Take the oil. Give them plenty. At least give us back our 1.5 trillion.\" You know, in the old days, we'd have a war, right? You know, when we were smart and when we were strong. We'd have a war. And if we won the war, which we always used to, if we won the war, we take it. We take what we need.","You know, it's called to the victor belong the spoils. So -- so look at Iraq. We go in, we spend 1.5 trillion, we're there for years, and we leave. We leave. We get nothing. Whoever heard of this? Now take another one, Libya. So Libya starts and the rebels are being routed, just routed by Gaddafi. It was over.","So the rebels see Obama. You know, this man with a great foreign policy. And the rebels see Obama's representatives and they say, \"We're being routed.\" By the way, if you remember, they couldn't have lasted another two days. And don't kid yourself, those people were loyal to Gaddafi. They died with Gaddafi.","They died with him. And the rebels were gone. They gave them two d -- two days -- three days. But they were gone. And the rebels who we don't even know who they are. Who are these rebels? We don't even talk to them anymore. The rebels. Sounds like Gone With The Wind. You know, it's a very romantic term, the rebels.","They show these guys with scarves on the head. You know, they don't show the real ones. They pick them out. The rebels, a lot of crap. The rebels say, \"We're being routed. Would you help us?\" And we say, \"Yes, we'll help you.\" And we spend hundreds of millions of dollars dropping these missiles all over the place, knocking the hell out of the army, knocking the hell out of Gaddafi.","I mean, that guy got wiped out. But we're spending hundreds and hundreds of millions of dollars. The rebels take over and you know who they sell their oil to? China. They se -- they don't se -- we don't buy oil from them. China is their primary customer. You know how much China spent? Nothing. They weren't involved.","So what I said, this was before the end -- and actually, before they made the deal. Because I'm very instinctively a businessman. You know what, I made a lot of money. I love making money. I love creating jobs. I love doing every -- I just like the system. But it's a hard system now because regulation's so bad, so many thing.","But, you know, I said to the representatives and I said to whoever would listen, \"Tell the rebels\", they would have giving you anything. They're gone, three days they had, maybe one day. Say, \"Listen, we're going to help you. But we want 50% of your oil.\" You know what they would have said? \"Where do I sign?\" In fact, if you would have said 75%, they would've said OK too, but I want to be a nice person.","I don't want to get greedy. Now, Libya is a very, very big oil producing state. We would have gotten their oil. They would have had plenty for themselves. I don't want to take it all. They would have had plenty for themselves. And all you had to do is -- believe me. Anybody in this room could have done it. Just say, \"We're going to help you, but we want 50% of your oil.","Here, sign.\" Every -- they would have signed. Now, by the way, it was suggested that they pay us back the money that we spent, which is peanuts compared to the 50. And they said, \"How dare you ask us for that? We're a sovereign nation. How dare you?\" And they threw him out of the room. And by the way, Iraq -- this was the beauty of all beauties.","One of the politicians, if you call them that, in Iraq, and I don't blame them for asking. Their figure was so stupid, we might even do it. Said that we have destroyed their country. We want retribution. We want you to pay us back for the damage you've done to Iraq. You believe this? And I'll tell you why.","Our leaders, they don't have it. I wouldn't be surprised if they made the deal. Can you believe this? It's hard to even talk about. So you look at what's going on. You look at two cases. I mean, I just use them as examples, Iraq and Libya. Now, Iraq was a very powerful nation, relatively speaking. I mean, it took us about three days in terms of wiping their army out.","But we didn't count on people with the bombs and the this and, you know, all of the -- the dirty pool that's played. But Iraq was a counterbalance to Iran. And for years and years and decades and decades, they would go -- one would go three yards over, the other one would go three yards over. One would use poison gas, the other would use something.","But they were basically identical. And they couldn't do anything. They were -- they were their own checks. This was a natural check that took place over many, many years. Military check. Well, we've decapitated the Iraqi army. So now, Iran is just waiting. They're just waiting. And at some point, there's no question, as sure as you're sitting here, unless something else happens first like somebody wanting to get elected and the only way he's going to do it is to start a war with Iran.","Because I tell you what, if Iran isn't negotiating now, they've got to be crazy because they are sitting -- and I said this the other day, they are sitting on hot timber. They are really crazy if they're not negotiating. And by the way, they do, in my opinion, want to negotiate. But we may have somebody that wants to have war because he doesn't want to accept a negotiation which could turn out to be much stronger than war and you could make a much better deal than war, but it may be good politics.","So I actually blogged the other day. I love this twittering and tweeting, I love it because, you know, I'm bigger than the New York Times. I got millions of people. I like -- it's like I own the New York Times. It's crazy. It's crazy. That's called the new age. You know, I always want to own a newspaper.","Now, I own a newspaper and it didn't cost me anything. It's unbelievable. So I did say though that I predict there's a very good chance that we'll end up in a war with Iran because I think it's politically possibly a positive for Obama even though it's not a good thing for our country. And you're also talking about let's -- hey, look, I am the most militaristic person in this room and we got a lot of them, especially the sheriff who picked me up at the plane.","I want to tell you. OK? Tough guy. That's why your crime is way down. I love people like that. But I'm the most militaristic person in this room. But you have to know where and when to go with it. I think we can do anything we want with Iran. We don't even talk to them. You know, we don't even talk to them.","The leader comes to New York City, nobody talks to him. He gets up at Columbia University and they disgrace him with the worst statements. And you know what, it's not that I care so much, I'm only interested in the deal that's good for the country. And let's see what happens with Iran. But assuming it goes on more or less the way it's going now, Iran will walk in and take over Iraq like nothing -- like nothing.","And they'll take over the second largest oil fields and oil reserves in the world. And we will have made that possible with our $1.5 trillion and our thousands of lives and our wounded. We will have made that possible. And I think it's absolutely one of the saddest things because we have people in Washington that don't know what they're doing.","And it's a very sad thing. During my lifetime, I've always been told that a person of great accomplishment, somebody that's really, really successful, cannot get elected President. You just can't do it. Or cannot even run for office. And I'm starting to sort of see that. As an example, I have great, great respect and have learned a lot about him.","I know him well. He's a fantastic man, a fantastic guy, Mitt Romney. Really is. Now, he has had great success. In fact, President Bill Clinton, who I also like, in fact, he said really nice things about me last night which shocked the hell out of everyone, and then -- no, he's a great guy. You know, he's an honest guy in his own way.","But he said -- he is. But he was very, very, very positive on the business career of Mitt Romney. Last night, Piers Morgan, Celebrity Apprentice Piers, my Piers. You know Piers won the Celebrity Apprentice. First thing he did is took over Larry King's job. But he actually did call me to thank me. So that's nice.","A lot of people don't call and thank. But Piers is a good guy. And Piers interviewed last night, I'm sure some of you saw it, it's become like the biggest story, interviewed President Clinton. It was a great interview. The President was great. Although, I don't think Barack Obama thinks so because they talked about the business career of Mitt Romney, and the President, among other things, said it was sterling.","The word sterling is powerful. That's a great word, especially nowadays, you know, with the dollar having problems with everything. But the word sterling is a great word, it's a very powerful word. And I can imagine the White House must be going nuts. But he was honest, and the man has had a great business career.","And just over the years, I've seen it, I've seen where -- and I've always heard it. I've always heard that if you've accomplished something, if you've done something that's terrific, if you're a great businessman, which this country really, really needs, because as I said, we're just being ripped left, we're being ripped right, we don't know what we're doing.","But I -- I -- and it's just so important. But when President Clinton made that statement, the word is today that the White House is livid because if you know and if you've been watching, and most of you -- it's great Republicans have been watching like I've been watching, the initial salvo from the Obama campaign was an attack on Mitt Romney's business acumen.","Now, the man has done an amazing job. You look at Staples. You look at so many country -- companies, and he's just done a great job. But it was an attack, and now you have Cory Booker, good guy, the Mayor of Newark. He comes out on television and said very, very strongly, \"You shouldn't do that.\" And Bain is a fantastic company.","And then last night, you had President Clinton really, really giving positive kudos and just fantastic words of praise to Mitt Romney. And he did that because it was the right thing to do. And I assume that ends that particular attack because I think it's going to be very hard to continue to attack Mitt Romney from that business standpoint.","I'm sure they'll find something else or they'll try like hell. But it does tell you when a man who's done so many wonderful things can be attacked so viciously that it really is a tough life being a politician. I know we have plenty of politicians in the room. It's not easy. And one of the reasons that I decided that I wouldn't run.","And I -- and as you know, I was doing very well, the polls were great, everything was great, and I loved doing it. And I had to make a decision because I had so many things going and I had -- I mean, I don't want to bring up a very successful show called The Apprentice. I assume you all watch The Apprentice, where Arsenio Hall -- somebody said, \"Because I brought up the birth certificate, I'm a racist.\" I said, \"Ho -- how can I be a ra -- I just picked Arsenio Hall.","Give me a break.\" Because I asked -- she likes Clay Aiken. Because I asked to see his college records because I'd like to see them. I'd loved -- there's one line called -- there's one line called place of birth. I'd like to see what he said. Yeah, be very interesting. I don't care what his marks were. I don't care if he had good marks, but I -- I just like to see place of birth, three colleges, place of birth.","I'd loved to see what, you know. Perhaps it's going to say Hawaii. Perhaps it's going to say Kenya. Perhaps it's going to say some -- I'd like to see place of birth. And they said racist. I said, \"What the hell does this have to do with racism?\" And a lot of people -- actually, they're writing stories about what does it have to do. And other presidents -- from what I understand, all other presidents have given their records.","So this is really the reverse. And then as you know, last week, I just brought it. It was sort of interest. I just happen to have it in my pocket. This was from Barack's publisher. And it said this was a book. This was printed. This was printed. And it said, \"Barack Obama was born in Kenya and raised in Indonesia and Hawaii.\" OK. That's what it says, 1991. And this was a part of a book, a brochure.","And I said, \"Well.\" Now he's in trouble, except the press doesn't want to hear about it. It's actually amazing. He's very, very protected. It's hard to believe. And Bill Clinton last night actually said on television, \"It's pretty well determined.\" Pretty well. Used the word pretty, didn't say it's determined, it's pretty well determined.","In fact, that to me was bigger than saying sterling. But he said it's pretty well determined that he was born in Hawaii. Well, see, I -- you know, I'm not -- I'm not a believer. So we'll see what happens. But I'm about jobs. I'm about economic development. I don't really like talking about the place of birth because every time I get on a television show, I want to talk about jobs and what we can do and how we have all the cards.","And they say, \"Mr. Trump.\" And I'm all set to give them because I want to show how many jobs we can create and how we can take that energy right under our feet and we can -- we don't need Saudi Arabia. We don't need all these other countries. I mean, frankly, we don't even need the Canadian pipeline to be honest with you.","I think it's great to have it. We don't need it because we have the oil right under our feet. We don't need Canadian oil. I love Canada. By the way, I love Canada. But we don't need it. You know, technology has become so incredible today in terms of getting things, in terms of getting what's under our feet.","It's become so incredible that 10 years ago -- five years ago, nobody even realized what we have. We're a -- we're a tremendous power. They don't let us use coal. You know, we ship a tremendous amount, number one customer of our coal, to China and they use our coal, but we can't use it. OK. Now, they have something called clean coal.","And let's assume it's pretty clean. OK? But we have coal. We're the Saudi Arabia of natural gas. It's hard to get it because of the regulations. We are beyond Saudi Arabia for coal, we're the -- the best, the biggest, and it goes to China. And by the way, China talks about carbon content. Believe me. They talk, it's all talk.","You know what it is? It's all a lot of bull. China is spewing crap into the air like nobody ever before. Now, I know all about -- I know more about green energy than Barack Obama will ever know. I know more about it. And green energy is fine. The problem is great costs. I'll give you an example. Windmills.","They're a disaster. When you need the energy, the wind isn't blowing. When you don't want the energy, you know, like winter and wind and storms, the wind blows so much that the suckers explode. They blow up. Did you ever see it? They show them blowing up. In addition, you know, the -- the funny thing is the environmentalists, it's really funny.","They all want windmills until they say put them in their backyard, right? Go up to Cape Cod, see how the environmentalists feel about windmills. They don't want them. They want them in somebody else's neighborhood, but they don't want them in theirs. Look at what's happened to Palm Springs, California. You come in this beautiful, beautiful area, what it was, and you have hundreds of these windmills.","It feels like you're in Dis -- a bad version of Disneyland. So what it does to the environment, windmills are a disaster for the environment, a disaster. Now, if you put them in industrial locations, you put them near plants, near factories, you know, that's one thing. But when you put them all over your countryside and destroy your countryside, and it's a lousy form of energy.","Now, talk about solar. You know Solyndra? You've never heard of Solyndra, I'm sure. But little company where the head of Solyndra and the owner went to the White House many, many, many times and he got a guarantee for like 530 million. And, you know, you're not talk -- I could see it going bad, but let it go bad in three or four years.","Not like a couple of months later. OK? We all run businesses, many of us have businesses. And you make good deals, you make bad deals, but, you know, they take years to go bad. They don't go bad like, you know, 14 seconds after the loan is approved. We have a guarantee. By the way, we're filing for bankruptcy.","It's unbelievable. So I think that this country has enormous potential, but we have horrible, horrible leadership. If we had, as an example, the right people negotiating with some of the countries that are all laughing at our stupidity and they're all, you know, they're all over the lot and they're -- everyone has a different deal and that's fine.","But, you know, I would -- I mean, to me, it's very simple. I know all the killer business, I know people that are so horrible, that are so vicious, in some cases, they're nice, but mostly, you know, they are great business people. Some are nice, most of them aren't. Some are happy, most of them aren't. But they're good at business.","That's all they think about. They have no life. Now, if you take a couple of them, I won't use names, but their names that you would have heard of and, you know, they -- they win a lot. I win a lot. Now, if I take some of those people, I don't even like to call them friends because they're hardly friends because they almost can't be friends.","But I want them negotiating against the Chinese, not some diplomat that studies how to be nice. You know what the diplomat does? They go to school and they study how to be nice. That's all they can do is be nice. You ever have dinner with a diplomat? You go home, you tell your wife, \"He was a nice person.\" So why aren't we using our best and our brightest?","China uses their best. They -- they have a school system where, you know, you're not good and they end up with the smartest people. And then those smart people take apart our stupid people. But they have a system. I'm not saying we should have a system, but we do have a system in our own way.","You have people that have made a lot of money and have been really, really good and they know what they're doing. Why aren't we using those people to do our negotiations against other countries? Look at Brazil. A friend of mine calls me up, not a rich guy, but he's buying an airplane. I said, \"Great, great.","Where are you buying it?\" \"Brazil.\" I said, \"Brazil? Why are you buying it in Brazil?\" \"I get a great tax credit.\" I said, \"You get a tax credit? Where do you get the tax credit?\" \"Here. If I buy the airplane, I get a huge tax credit and I can write off so much of the plane.\" I said, \"You mean if they make a plane in Brazil, you get a tax credit here?\" \"Yeah.\" This is just one of hundreds of things.","It's just incredible. It's like the Bay Bridge, it's like so many other things. And he said that and he didn't even think about it, but I thought about it. I said, \"Isn't that crazy?\" That's what's happening to our country. And that's really what's happening into our country. So what's happened is I was having a great time running.","I really liked it. I went up to Nashua, New Hampshire. Like I broke the record tonight, I broke the record in Nashua too. Great people. They were great people. We had an amazing time. And was doing, as you all know, really well in the polls. I went to the White House Correspondents Dinner and the press because they are so dishonest.","I mean, they are so dishonest. The President of the United States spent a lot of time talking about Donald Trump. I'm in this room that made this ballroom, in all due respect, the ballroom was like many many -- it was a monster. It must have been 5,000 or 6,000 people. And the President of the United States was telling very respectfully Donald Trump jokes.","And, you know, it's funny, when I walked in, the press was saying, \"Do you think he'll mention you, Mr. Trump.?\" I said, \"I don't think so. Why would he mentioned me?\" I -- what do I know? But they were all screaming They're going nuts, calling the paparazzi. But it was amazing. So I went out with my wife and I sat down, and the President started with joke after joke about Trump, that the White House is going to be called Trump White House.","You know, he had the Trump over there. It was all kid, it was very nice. He did a great job. He was very respectful actually. And I had a great time. In fact, you know, as some of the men and women in the room will do, I tapped my wife on her knee. I was trying to act a little bit stone faced because, you know, I don't know.","Am I supposed to laugh? Am I supposed to -- what am I supposed to do? So I'm, you know, I'm sort of a neutral. I'm in a neutral, I'm like Switzerland. I'm neutral. So I tapped my wife on the knee. I said -- I've never told this story by the way. I said, \"Baby, do you believe it? The President's devoting like most of his speech to me. This is unbelievable.\" I swear.","In fact, just so you know, I'm a Presbyterian. I swear to God that happened. I said, \"Do you believe this?\" The whole thing. I have 6,000 people in that room. You know, the biggest ballroom in Washington by far. And I think it holds 5,000 or 6,000, and every politician's there, everybody's there, and all he's talking about is me. And I said, \"Baby, do you believe this?\" And she goes, \"No.\" I go, \"He's talking about me.\" I had a great time.","Then people -- I'm leaving and the people are also unbelievable. I'm having a great time. The next day, I wake up and I read, \"Donald Trump had a miserable evening. I could see it all over his face. He felt humiliated.\" Humiliated. I was like -- it was the greatest. So the press is really, really dishonest.","And I think the biggest thing that Mitt Romney has to fear is the press. They don't tell the truth. Now, I'm not saying all of them. I know some great, great reporters and it's a great profession, but there are many really dishonest reporters. I've had stories done on me that they knew were wrong. They told me they were wrong.","But they said, \"We have to go with it.\" Why? It's a better story. You know, more exciting. These are some of the most dishonest people ever. Again, there are some really good ones, really talented ones, but there's some really bad ones. And I think it's the biggest fear that the Republicans and Mitt Romney will have because the level of protection of Barack Obama.","As an example, Mitt Romney has done many deals. They've been generally speaking fantastic deals. Obama never did a deal except for one, his house. OK? His house. Now, he got away with that one. But that whole house thing is a very, very bad situation. And he got away with it. And I guarantee you, if he was a conservative Republican or if he was somebody else, he'd be in deep, deep trouble to put it mildly.","So we've had somebody in the White House who had no experience, who had no track record, and honestly, who -- who's made very, very many bad deals. They talk about bin Laden. Well, think about it. Pakistan is getting billions of dollars from the United States. And yet, they're supporting bin Laden. He's in there.","He's living in the biggest house. I personally don't think it was much of a mansion, but they all call it a mansion. I wouldn't want to live in it personally. But it was big and it was the biggest house in the area by far and it was right next to their military academy. They're big, powerful, where all their best soldiers are, right?","And they're very good militarily, the Pakistanis. They know what's going on. Did you think they don't know who's living in that house? I mean, how stupid are we? So he's got this huge house, he's living there for years with his three wives and his whole thing, and we're giving them billions of dollars. OK. So now a call gets made to the President, and the call says the following, \"We think we have Osama bin Laden.\" Now, let's assume anybody in this room is president, because I give the military tremendous kudos.","I give, you know, the whole group great kudos. So there's three things you can do. Leave him alone. We don't want to touch him. I can imagine some people probably would say that, but those people we want to write them off. OK? So you can do three things. You leave him alone. We don't want to touch him. OK, so that's out because nobody would do that.","Two other things left. Go in and get him, or drop a missile on him. So I think a lot of people would say go in and get him. I mean, I personally would have said that, I think, because it would have been -- I would have been so nice, right? So he said, \"Go in and get him.\" And they went in and they got him.","And that was good. But who el -- who wouldn't have made that decision? I mean, is there anybody that wouldn't have made that decision? And now, instead of sitting back and relaxing, he's bragging, \"I got bin Laden\", because that's one of the things he did. And, you know, give him some credit. But I think anybody else would've made the same decision.","And then you look at the polls of the military and Mitt Romney is way, way, way higher in terms of polls. They didn't like him grandstanding with Osama bin Laden. They didn't like it. So anyway, I came. I'm sure I'll get in a lot of trouble for some of the things I said, but I don't care about. OK, I don't care.","We actually have a lot of national press back there and then I'd see these guys, they just salivate. We're going to get Trump. Who cares? But we really have to do something. We have to do something soon. North Carolina is one of the most, if not the most, important state in terms of who is going to become the next president.","We need a president who is smart, and tough, and gets it. We need a president who has business acumen. We need a president has business ability. We also need a president who has heart. Mitt Romney has a lot of heart. And the reason I decided not to run is I got to know him and I heard him on one of the debates saying about China, that China will not continue to manipulate their currency.","They will not continue to destroy this country. And if they do, we're going to the World Court. And if they do, we're going to do other things like, excuse me, we're going to tax your product 25% and they will come to the table because they will have -- they will have a depression in China the likes of which you've never seen.","Now, by the way, it's not only us. Europe is doing unbelievably badly -- unbelievably badly. But China is doing a number on them also because their manipulation of currency is absolutely sapping the Europeans. Now, one thing about Europe I have to say. They created the euro. They got together and they created a currency.","You know why? Because they wanted to do harm to the United States. They wanted to compete better against the United States. Well, now it's coming back to haunt them. Now, I have a lot of jobs in Europe, a lot of friends in Europe. I came from Europe I guess a long time ago. Meaning my mommy and my daddy.","But -- but they did want to inflict harm on us, economic harm, and, boy, have they gotten screwed. What a mess. They weren't counting on Greece and Spain and Italy and everybody collapsing. So when people say about the euro and Europe, and if Europe goes, we could be. Well, I'm not sure, it could be just the reverse.","Again, remember, the euro was created -- every economist disagrees with me. But I went to the Wharton School of Finance, best business school in the world and I was very good at economics. I want to tell you. The euro was created to take advantage of the United States, to create size and lots of other things, and therefore, beat the United States at business.","It's not working out so well. Of course, it is working out for Germany. You know, Germany is trying to take over the world. They tried it with militarily it didn't work. Now they're buying our debt at huge discounts. I mean, when Greece looks at who's buying out all their debt. Germany is doing very nicely, folks.","But you may only end up with Germany. So I really feel that it's possible -- it's very possible that, with respect to Europe, if it gets weaker and weaker, which is probably happening, that's a positive thing for the United States. Now, I'm the only one that said that. And in fact, the market went down 275 points today because Europe is weak.","But it's sort of interesting. And in the statement about Europe, they talked about other countries that were taken advantage of them. So I'm here because I love this country. I would much prefer, as much as I love North Carolina, I wouldn't mind being home playing with Barron Trump. But this is so important to me because I've heard -- now these are political pundits, most of whom don't know what they're talking about, but I -- I tend to agree with this.","I have heard numerous times by very smart people, some of whom I respect, most of whom I don't respect, that whoever wins North Carolina wins the election. Have we heard that? In other words, you're in a very, very important position, and you are the people that can bring it home. I hear the polls are pretty even.","It's not going to be easy because whether you like Barack Obama as a President or not, and most people don't and most people see what's going on, and he's not doing well. He is a great campaigner, and that you have to give him credit for. And you're going to have to fight like hell because probably it is true.","Now, you might add Florida, you might add Ohio, you might add a couple, but the fact is every time I'm listening to some of the most respected people, they're talking about the importance of North Carolina, the importance of the people in this room. So with that, I leave you. I wish you luck. I really, really have enjoyed being here.","You're great, great people, amazing people. And I really am honored to be with you tonight and have a good evening. Thank you very much. Thank you. Thank you very much. Thank you. Thank you. Thank you."],"text":" Wow, what a group. This is great. You know, I've turned down many of these over the last couple of months. The -- they want me to do the little speech for the conventions and I love doing it, but I really love North Carolina. And I have to tell you, I'm different from your average speaker because I really back up my words. I just bought a huge job in North Carolina, and -- right outside of Charlotte. It was called The Point, and now it's called Trump National. What do, I mean, you know, do you expect? And it's a great job. It's a beautiful job on Lake Norman, one of the biggest lakes anywhere, and it's magnificent. And we love it, and it's going to be something very special. I'm really happy because I was told by John and others that you broke your records tonight and anything I can do to help really makes me feel good. Now, by breaking records, that means you're going to raise more money than you ever anticipated, you're going to use the money wisely, and you will defeat Barack Obama. Very important. Now, you know, today, when I left New York, I happened to turn on the television and saw some news. The market had one of its worst days today, very, very bad day. Jobs numbers were absolutely terrible. 13 million people out of work. That's a hell of a lot of people. 13 million. And the unemployment rate went up today. And all of this is bad news, and frankly, you could say good news for the Republicans in terms of an election. But I don't care. We love the country first. So it's bad news as far as I'm concerned. We really have difficulty in this country. So many things, if you just pick up today's paper. In San Francisco, they're building something called the Bay Bridge. Who's building it? You think the people of Los Angeles, the people of San Francisco, the people of California. No. You know who is building it? The Chinese are building the Bay Bridge. $1.8 billion, and now they have tremendous cost overruns, and it turned out that if they would have used American labor, they could have done it cheaper. And this is the kind of thing that's happening to our country. The United States has become a laughing stock and a whipping post for the rest of the world. America today is clearly missing quality leadership like probably never ever before. On numerous occasions, I've warned that countries like China, India, Korea, Mexico, the OPEC nations, who are really having a field day with us. Believe me. And I've been talking about it for years. And we can't go on. We cannot continue to go on where countries are laughing at us, laughing at ours -- our leaders, laughing at every single thing we do. You know, it used to be that we had the greatest negotiators. We were the kings and queens. And today, we're a laughing stock, and I can tell you, the people in this room don't like it and I don't like it. We're losing hundreds of billions of dollars a year. China, this year, will make $350 billion on us. Call it profit. Call it whatever you want. The number is going to be 350 billion, and probably, it's going up. Then today, if you read the newspaper, they've devalued their currency. By the way, that doesn't sound good, but it's great for them and bad for us as you can probably suspect. They don't respect us. And that devaluation, which nobody believed was possible that they'd actually have the audacity to do it. That devaluation is going to make it really, really hard for our companies to compete against Chinese companies and China itself. It's a terrible thing. And what do we do? We go out and we hold beautiful, beautiful receptions and dinners, black tie for the President of China when he comes over. And some people loved what I said and some people didn't. I said, \"If he came over when I was around, I wouldn't give him black tie dinners. I'd talk to him first. I'd bring him into the office and would discuss things, and we'd see how he responds. And if he continues to take advantage of this country, there is no black tie dinner, there's no McDonald's, there's no nothing. It's like, thanks a lot, folks.\" Because -- because the fact is, we have all the cards. People don't realize it. We are rebuilding China. Now, I usually say, when was the last time you see a bridge, a major bridge like a George Washington Bridge, a Verrazano Bridge? When was the last time you saw a bridge being built in this country? Then I realized, they are doing one, the Bay Bridge that we just mentioned. But that's being built by the Chinese too. You go to China, you go to the OPEC nations, you go to some of these nations, it's unbelievable what you do. And then you fly back home and you land in New York, you land in Los Angeles, you come to LaGuardia Airport, Kennedy Airport, LAX, and we're like a third world country. I was in one of the very, very rich oil states, and the head -- and I'm not knocking them. I think it's great. I have a lot of friends that are leaders of these countries, that are leaders of the economies, and they don't believe what they're getting away with. They can't believe it. But he's showing me an airport. The most beautiful airport I've ever seen. Most beautiful I've ever seen. And he actually showed me where they have a spa so the people before they get onto the plane can go to the spa, they can get massages, they can do all sorts of things. I never saw anything like this. And I said to him, \"This is the single most beautiful airport I've ever seen.\" He goes, \"No, no, no, no, no, you don't understand. This is just temporary. We are ripping this down next year. Look on the horizon.\" And I saw 42 cranes on the horizon, building something like I've never seen before, the real airport. And then I land at LaGuardia and I say, \"Can you believe this? Can you believe this?\" When you see that place, you know what I'm talking about. It's a disgrace. When I look at countries like the country of Colombia, very good people. But you looked that last year, they made four billion dollars on us. We don't make money with anybody. And then you hear about Social Security, and Medicare, and Medicaid, and you know, I hear so many different theories and so many different ways, and obviously, we all agreed, we have to stop the fraud. We have to stop the abuse. But, you know, the greatest thing we could do? If we got this country roaring again, and the potential is enormous. But if we got this country roaring, roaring, roaring, it solves the problems. But you can't do that when China's taking our jobs. You can't do it. When China's taking our jobs -- we're a bunch of patsies when they're making our product. And not only China. Now China is the worst abuser. Then, I guess, you could say OPEC. But, you know, there's a big question, who abuses us more? OPEC, those nations wouldn't be there except for us. And, you know, one of the things that I find amazing. They talk about Barack Obama and his foreign policy. What's his foreign policy? Think of it. He goes in and doesn't defend Egypt where Egypt was -- look, I don't know what they say behind our back. You can imagine. But at least outwardly, they were supporting Israel and they were doing lots of good things toward the United States, and we paid them a lot of money. We pay everybody lots of money. We can't do it on our own merit. We have to pay everybody. But we go -- and now that regime is taken over by a group of people that make them look like babies. Totally anti the United States, totally anti-Israel, totally anti-everything. What have we done? And the rest of the world sees how we acted. And they say, ''Well, we can't count on -- we just can't count on the United States.\" I look at what we've done in Iraq. And, you know, I got in some trouble for saying this, but I'm not changing my mind. The nice part about not being a politician is I can say what I want, and if people like it -- if people like it, that's fine. If they don't like it, that's OK too. But look at Iraq. The smart people said, when we went into Iraq, we went in for the oil. OK? Because it never made sense. They didn't have the weapons of mass destruction, we learned that early on. We ended up in this absolute quagmire, $1.5 trillion, thousands of lives, and our wounded veterans all over the United States, you see them all over the United States. And I made the statement very strongly a few years ago. I said, \"Look, they have the second largest oil reserves in the world.\" People don't know that, right after Saudi Arabia. I said, \"Why aren't we at least paying ourselves back out of that oil?\" And these -- and these stupid politicians said -- and some of the press, by the way, in all fairness, because I think the press maybe leads the politicians instead of the other way around. But these stupid politicians say, \"Can you believe a horrible, horrible statement like that? We're supposed to give them democracy.\" They're going to have democracy, folks. They're going to be the meanest -- the meanest, hardest, greatest hater of the United States will take over, will take the oil, will build his own palaces. And what have we done and what have we gotten for it? So I actually said, \"Take the oil. Give them plenty. At least give us back our 1.5 trillion.\" You know, in the old days, we'd have a war, right? You know, when we were smart and when we were strong. We'd have a war. And if we won the war, which we always used to, if we won the war, we take it. We take what we need. You know, it's called to the victor belong the spoils. So -- so look at Iraq. We go in, we spend 1.5 trillion, we're there for years, and we leave. We leave. We get nothing. Whoever heard of this? Now take another one, Libya. So Libya starts and the rebels are being routed, just routed by Gaddafi. It was over. So the rebels see Obama. You know, this man with a great foreign policy. And the rebels see Obama's representatives and they say, \"We're being routed.\" By the way, if you remember, they couldn't have lasted another two days. And don't kid yourself, those people were loyal to Gaddafi. They died with Gaddafi. They died with him. And the rebels were gone. They gave them two d -- two days -- three days. But they were gone. And the rebels who we don't even know who they are. Who are these rebels? We don't even talk to them anymore. The rebels. Sounds like Gone With The Wind. You know, it's a very romantic term, the rebels. They show these guys with scarves on the head. You know, they don't show the real ones. They pick them out. The rebels, a lot of crap. The rebels say, \"We're being routed. Would you help us?\" And we say, \"Yes, we'll help you.\" And we spend hundreds of millions of dollars dropping these missiles all over the place, knocking the hell out of the army, knocking the hell out of Gaddafi. I mean, that guy got wiped out. But we're spending hundreds and hundreds of millions of dollars. The rebels take over and you know who they sell their oil to? China. They se -- they don't se -- we don't buy oil from them. China is their primary customer. You know how much China spent? Nothing. They weren't involved. So what I said, this was before the end -- and actually, before they made the deal. Because I'm very instinctively a businessman. You know what, I made a lot of money. I love making money. I love creating jobs. I love doing every -- I just like the system. But it's a hard system now because regulation's so bad, so many thing. But, you know, I said to the representatives and I said to whoever would listen, \"Tell the rebels\", they would have giving you anything. They're gone, three days they had, maybe one day. Say, \"Listen, we're going to help you. But we want 50% of your oil.\" You know what they would have said? \"Where do I sign?\" In fact, if you would have said 75%, they would've said OK too, but I want to be a nice person. I don't want to get greedy. Now, Libya is a very, very big oil producing state. We would have gotten their oil. They would have had plenty for themselves. I don't want to take it all. They would have had plenty for themselves. And all you had to do is -- believe me. Anybody in this room could have done it. Just say, \"We're going to help you, but we want 50% of your oil. Here, sign.\" Every -- they would have signed. Now, by the way, it was suggested that they pay us back the money that we spent, which is peanuts compared to the 50. And they said, \"How dare you ask us for that? We're a sovereign nation. How dare you?\" And they threw him out of the room. And by the way, Iraq -- this was the beauty of all beauties. One of the politicians, if you call them that, in Iraq, and I don't blame them for asking. Their figure was so stupid, we might even do it. Said that we have destroyed their country. We want retribution. We want you to pay us back for the damage you've done to Iraq. You believe this? And I'll tell you why. Our leaders, they don't have it. I wouldn't be surprised if they made the deal. Can you believe this? It's hard to even talk about. So you look at what's going on. You look at two cases. I mean, I just use them as examples, Iraq and Libya. Now, Iraq was a very powerful nation, relatively speaking. I mean, it took us about three days in terms of wiping their army out. But we didn't count on people with the bombs and the this and, you know, all of the -- the dirty pool that's played. But Iraq was a counterbalance to Iran. And for years and years and decades and decades, they would go -- one would go three yards over, the other one would go three yards over. One would use poison gas, the other would use something. But they were basically identical. And they couldn't do anything. They were -- they were their own checks. This was a natural check that took place over many, many years. Military check. Well, we've decapitated the Iraqi army. So now, Iran is just waiting. They're just waiting. And at some point, there's no question, as sure as you're sitting here, unless something else happens first like somebody wanting to get elected and the only way he's going to do it is to start a war with Iran. Because I tell you what, if Iran isn't negotiating now, they've got to be crazy because they are sitting -- and I said this the other day, they are sitting on hot timber. They are really crazy if they're not negotiating. And by the way, they do, in my opinion, want to negotiate. But we may have somebody that wants to have war because he doesn't want to accept a negotiation which could turn out to be much stronger than war and you could make a much better deal than war, but it may be good politics. So I actually blogged the other day. I love this twittering and tweeting, I love it because, you know, I'm bigger than the New York Times. I got millions of people. I like -- it's like I own the New York Times. It's crazy. It's crazy. That's called the new age. You know, I always want to own a newspaper. Now, I own a newspaper and it didn't cost me anything. It's unbelievable. So I did say though that I predict there's a very good chance that we'll end up in a war with Iran because I think it's politically possibly a positive for Obama even though it's not a good thing for our country. And you're also talking about let's -- hey, look, I am the most militaristic person in this room and we got a lot of them, especially the sheriff who picked me up at the plane. I want to tell you. OK? Tough guy. That's why your crime is way down. I love people like that. But I'm the most militaristic person in this room. But you have to know where and when to go with it. I think we can do anything we want with Iran. We don't even talk to them. You know, we don't even talk to them. The leader comes to New York City, nobody talks to him. He gets up at Columbia University and they disgrace him with the worst statements. And you know what, it's not that I care so much, I'm only interested in the deal that's good for the country. And let's see what happens with Iran. But assuming it goes on more or less the way it's going now, Iran will walk in and take over Iraq like nothing -- like nothing. And they'll take over the second largest oil fields and oil reserves in the world. And we will have made that possible with our $1.5 trillion and our thousands of lives and our wounded. We will have made that possible. And I think it's absolutely one of the saddest things because we have people in Washington that don't know what they're doing. And it's a very sad thing. During my lifetime, I've always been told that a person of great accomplishment, somebody that's really, really successful, cannot get elected President. You just can't do it. Or cannot even run for office. And I'm starting to sort of see that. As an example, I have great, great respect and have learned a lot about him. I know him well. He's a fantastic man, a fantastic guy, Mitt Romney. Really is. Now, he has had great success. In fact, President Bill Clinton, who I also like, in fact, he said really nice things about me last night which shocked the hell out of everyone, and then -- no, he's a great guy. You know, he's an honest guy in his own way. But he said -- he is. But he was very, very, very positive on the business career of Mitt Romney. Last night, Piers Morgan, Celebrity Apprentice Piers, my Piers. You know Piers won the Celebrity Apprentice. First thing he did is took over Larry King's job. But he actually did call me to thank me. So that's nice. A lot of people don't call and thank. But Piers is a good guy. And Piers interviewed last night, I'm sure some of you saw it, it's become like the biggest story, interviewed President Clinton. It was a great interview. The President was great. Although, I don't think Barack Obama thinks so because they talked about the business career of Mitt Romney, and the President, among other things, said it was sterling. The word sterling is powerful. That's a great word, especially nowadays, you know, with the dollar having problems with everything. But the word sterling is a great word, it's a very powerful word. And I can imagine the White House must be going nuts. But he was honest, and the man has had a great business career. And just over the years, I've seen it, I've seen where -- and I've always heard it. I've always heard that if you've accomplished something, if you've done something that's terrific, if you're a great businessman, which this country really, really needs, because as I said, we're just being ripped left, we're being ripped right, we don't know what we're doing. But I -- I -- and it's just so important. But when President Clinton made that statement, the word is today that the White House is livid because if you know and if you've been watching, and most of you -- it's great Republicans have been watching like I've been watching, the initial salvo from the Obama campaign was an attack on Mitt Romney's business acumen. Now, the man has done an amazing job. You look at Staples. You look at so many country -- companies, and he's just done a great job. But it was an attack, and now you have Cory Booker, good guy, the Mayor of Newark. He comes out on television and said very, very strongly, \"You shouldn't do that.\" And Bain is a fantastic company. And then last night, you had President Clinton really, really giving positive kudos and just fantastic words of praise to Mitt Romney. And he did that because it was the right thing to do. And I assume that ends that particular attack because I think it's going to be very hard to continue to attack Mitt Romney from that business standpoint. I'm sure they'll find something else or they'll try like hell. But it does tell you when a man who's done so many wonderful things can be attacked so viciously that it really is a tough life being a politician. I know we have plenty of politicians in the room. It's not easy. And one of the reasons that I decided that I wouldn't run. And I -- and as you know, I was doing very well, the polls were great, everything was great, and I loved doing it. And I had to make a decision because I had so many things going and I had -- I mean, I don't want to bring up a very successful show called The Apprentice. I assume you all watch The Apprentice, where Arsenio Hall -- somebody said, \"Because I brought up the birth certificate, I'm a racist.\" I said, \"Ho -- how can I be a ra -- I just picked Arsenio Hall. Give me a break.\" Because I asked -- she likes Clay Aiken. Because I asked to see his college records because I'd like to see them. I'd loved -- there's one line called -- there's one line called place of birth. I'd like to see what he said. Yeah, be very interesting. I don't care what his marks were. I don't care if he had good marks, but I -- I just like to see place of birth, three colleges, place of birth. I'd loved to see what, you know. Perhaps it's going to say Hawaii. Perhaps it's going to say Kenya. Perhaps it's going to say some -- I'd like to see place of birth. And they said racist. I said, \"What the hell does this have to do with racism?\" And a lot of people -- actually, they're writing stories about what does it have to do. And other presidents -- from what I understand, all other presidents have given their records. So this is really the reverse. And then as you know, last week, I just brought it. It was sort of interest. I just happen to have it in my pocket. This was from Barack's publisher. And it said this was a book. This was printed. This was printed. And it said, \"Barack Obama was born in Kenya and raised in Indonesia and Hawaii.\" OK. That's what it says, 1991. And this was a part of a book, a brochure. And I said, \"Well.\" Now he's in trouble, except the press doesn't want to hear about it. It's actually amazing. He's very, very protected. It's hard to believe. And Bill Clinton last night actually said on television, \"It's pretty well determined.\" Pretty well. Used the word pretty, didn't say it's determined, it's pretty well determined. In fact, that to me was bigger than saying sterling. But he said it's pretty well determined that he was born in Hawaii. Well, see, I -- you know, I'm not -- I'm not a believer. So we'll see what happens. But I'm about jobs. I'm about economic development. I don't really like talking about the place of birth because every time I get on a television show, I want to talk about jobs and what we can do and how we have all the cards. And they say, \"Mr. Trump.\" And I'm all set to give them because I want to show how many jobs we can create and how we can take that energy right under our feet and we can -- we don't need Saudi Arabia. We don't need all these other countries. I mean, frankly, we don't even need the Canadian pipeline to be honest with you. I think it's great to have it. We don't need it because we have the oil right under our feet. We don't need Canadian oil. I love Canada. By the way, I love Canada. But we don't need it. You know, technology has become so incredible today in terms of getting things, in terms of getting what's under our feet. It's become so incredible that 10 years ago -- five years ago, nobody even realized what we have. We're a -- we're a tremendous power. They don't let us use coal. You know, we ship a tremendous amount, number one customer of our coal, to China and they use our coal, but we can't use it. OK. Now, they have something called clean coal. And let's assume it's pretty clean. OK? But we have coal. We're the Saudi Arabia of natural gas. It's hard to get it because of the regulations. We are beyond Saudi Arabia for coal, we're the -- the best, the biggest, and it goes to China. And by the way, China talks about carbon content. Believe me. They talk, it's all talk. You know what it is? It's all a lot of bull. China is spewing crap into the air like nobody ever before. Now, I know all about -- I know more about green energy than Barack Obama will ever know. I know more about it. And green energy is fine. The problem is great costs. I'll give you an example. Windmills. They're a disaster. When you need the energy, the wind isn't blowing. When you don't want the energy, you know, like winter and wind and storms, the wind blows so much that the suckers explode. They blow up. Did you ever see it? They show them blowing up. In addition, you know, the -- the funny thing is the environmentalists, it's really funny. They all want windmills until they say put them in their backyard, right? Go up to Cape Cod, see how the environmentalists feel about windmills. They don't want them. They want them in somebody else's neighborhood, but they don't want them in theirs. Look at what's happened to Palm Springs, California. You come in this beautiful, beautiful area, what it was, and you have hundreds of these windmills. It feels like you're in Dis -- a bad version of Disneyland. So what it does to the environment, windmills are a disaster for the environment, a disaster. Now, if you put them in industrial locations, you put them near plants, near factories, you know, that's one thing. But when you put them all over your countryside and destroy your countryside, and it's a lousy form of energy. Now, talk about solar. You know Solyndra? You've never heard of Solyndra, I'm sure. But little company where the head of Solyndra and the owner went to the White House many, many, many times and he got a guarantee for like 530 million. And, you know, you're not talk -- I could see it going bad, but let it go bad in three or four years. Not like a couple of months later. OK? We all run businesses, many of us have businesses. And you make good deals, you make bad deals, but, you know, they take years to go bad. They don't go bad like, you know, 14 seconds after the loan is approved. We have a guarantee. By the way, we're filing for bankruptcy. It's unbelievable. So I think that this country has enormous potential, but we have horrible, horrible leadership. If we had, as an example, the right people negotiating with some of the countries that are all laughing at our stupidity and they're all, you know, they're all over the lot and they're -- everyone has a different deal and that's fine. But, you know, I would -- I mean, to me, it's very simple. I know all the killer business, I know people that are so horrible, that are so vicious, in some cases, they're nice, but mostly, you know, they are great business people. Some are nice, most of them aren't. Some are happy, most of them aren't. But they're good at business. That's all they think about. They have no life. Now, if you take a couple of them, I won't use names, but their names that you would have heard of and, you know, they -- they win a lot. I win a lot. Now, if I take some of those people, I don't even like to call them friends because they're hardly friends because they almost can't be friends. But I want them negotiating against the Chinese, not some diplomat that studies how to be nice. You know what the diplomat does? They go to school and they study how to be nice. That's all they can do is be nice. You ever have dinner with a diplomat? You go home, you tell your wife, \"He was a nice person.\" So why aren't we using our best and our brightest? China uses their best. They -- they have a school system where, you know, you're not good and they end up with the smartest people. And then those smart people take apart our stupid people. But they have a system. I'm not saying we should have a system, but we do have a system in our own way. You have people that have made a lot of money and have been really, really good and they know what they're doing. Why aren't we using those people to do our negotiations against other countries? Look at Brazil. A friend of mine calls me up, not a rich guy, but he's buying an airplane. I said, \"Great, great. Where are you buying it?\" \"Brazil.\" I said, \"Brazil? Why are you buying it in Brazil?\" \"I get a great tax credit.\" I said, \"You get a tax credit? Where do you get the tax credit?\" \"Here. If I buy the airplane, I get a huge tax credit and I can write off so much of the plane.\" I said, \"You mean if they make a plane in Brazil, you get a tax credit here?\" \"Yeah.\" This is just one of hundreds of things. It's just incredible. It's like the Bay Bridge, it's like so many other things. And he said that and he didn't even think about it, but I thought about it. I said, \"Isn't that crazy?\" That's what's happening to our country. And that's really what's happening into our country. So what's happened is I was having a great time running. I really liked it. I went up to Nashua, New Hampshire. Like I broke the record tonight, I broke the record in Nashua too. Great people. They were great people. We had an amazing time. And was doing, as you all know, really well in the polls. I went to the White House Correspondents Dinner and the press because they are so dishonest. I mean, they are so dishonest. The President of the United States spent a lot of time talking about Donald Trump. I'm in this room that made this ballroom, in all due respect, the ballroom was like many many -- it was a monster. It must have been 5,000 or 6,000 people. And the President of the United States was telling very respectfully Donald Trump jokes. And, you know, it's funny, when I walked in, the press was saying, \"Do you think he'll mention you, Mr. Trump.?\" I said, \"I don't think so. Why would he mentioned me?\" I -- what do I know? But they were all screaming They're going nuts, calling the paparazzi. But it was amazing. So I went out with my wife and I sat down, and the President started with joke after joke about Trump, that the White House is going to be called Trump White House. You know, he had the Trump over there. It was all kid, it was very nice. He did a great job. He was very respectful actually. And I had a great time. In fact, you know, as some of the men and women in the room will do, I tapped my wife on her knee. I was trying to act a little bit stone faced because, you know, I don't know. Am I supposed to laugh? Am I supposed to -- what am I supposed to do? So I'm, you know, I'm sort of a neutral. I'm in a neutral, I'm like Switzerland. I'm neutral. So I tapped my wife on the knee. I said -- I've never told this story by the way. I said, \"Baby, do you believe it? The President's devoting like most of his speech to me. This is unbelievable.\" I swear. In fact, just so you know, I'm a Presbyterian. I swear to God that happened. I said, \"Do you believe this?\" The whole thing. I have 6,000 people in that room. You know, the biggest ballroom in Washington by far. And I think it holds 5,000 or 6,000, and every politician's there, everybody's there, and all he's talking about is me. And I said, \"Baby, do you believe this?\" And she goes, \"No.\" I go, \"He's talking about me.\" I had a great time. Then people -- I'm leaving and the people are also unbelievable. I'm having a great time. The next day, I wake up and I read, \"Donald Trump had a miserable evening. I could see it all over his face. He felt humiliated.\" Humiliated. I was like -- it was the greatest. So the press is really, really dishonest. And I think the biggest thing that Mitt Romney has to fear is the press. They don't tell the truth. Now, I'm not saying all of them. I know some great, great reporters and it's a great profession, but there are many really dishonest reporters. I've had stories done on me that they knew were wrong. They told me they were wrong. But they said, \"We have to go with it.\" Why? It's a better story. You know, more exciting. These are some of the most dishonest people ever. Again, there are some really good ones, really talented ones, but there's some really bad ones. And I think it's the biggest fear that the Republicans and Mitt Romney will have because the level of protection of Barack Obama. As an example, Mitt Romney has done many deals. They've been generally speaking fantastic deals. Obama never did a deal except for one, his house. OK? His house. Now, he got away with that one. But that whole house thing is a very, very bad situation. And he got away with it. And I guarantee you, if he was a conservative Republican or if he was somebody else, he'd be in deep, deep trouble to put it mildly. So we've had somebody in the White House who had no experience, who had no track record, and honestly, who -- who's made very, very many bad deals. They talk about bin Laden. Well, think about it. Pakistan is getting billions of dollars from the United States. And yet, they're supporting bin Laden. He's in there. He's living in the biggest house. I personally don't think it was much of a mansion, but they all call it a mansion. I wouldn't want to live in it personally. But it was big and it was the biggest house in the area by far and it was right next to their military academy. They're big, powerful, where all their best soldiers are, right? And they're very good militarily, the Pakistanis. They know what's going on. Did you think they don't know who's living in that house? I mean, how stupid are we? So he's got this huge house, he's living there for years with his three wives and his whole thing, and we're giving them billions of dollars. OK. So now a call gets made to the President, and the call says the following, \"We think we have Osama bin Laden.\" Now, let's assume anybody in this room is president, because I give the military tremendous kudos. I give, you know, the whole group great kudos. So there's three things you can do. Leave him alone. We don't want to touch him. I can imagine some people probably would say that, but those people we want to write them off. OK? So you can do three things. You leave him alone. We don't want to touch him. OK, so that's out because nobody would do that. Two other things left. Go in and get him, or drop a missile on him. So I think a lot of people would say go in and get him. I mean, I personally would have said that, I think, because it would have been -- I would have been so nice, right? So he said, \"Go in and get him.\" And they went in and they got him. And that was good. But who el -- who wouldn't have made that decision? I mean, is there anybody that wouldn't have made that decision? And now, instead of sitting back and relaxing, he's bragging, \"I got bin Laden\", because that's one of the things he did. And, you know, give him some credit. But I think anybody else would've made the same decision. And then you look at the polls of the military and Mitt Romney is way, way, way higher in terms of polls. They didn't like him grandstanding with Osama bin Laden. They didn't like it. So anyway, I came. I'm sure I'll get in a lot of trouble for some of the things I said, but I don't care about. OK, I don't care. We actually have a lot of national press back there and then I'd see these guys, they just salivate. We're going to get Trump. Who cares? But we really have to do something. We have to do something soon. North Carolina is one of the most, if not the most, important state in terms of who is going to become the next president. We need a president who is smart, and tough, and gets it. We need a president who has business acumen. We need a president has business ability. We also need a president who has heart. Mitt Romney has a lot of heart. And the reason I decided not to run is I got to know him and I heard him on one of the debates saying about China, that China will not continue to manipulate their currency. They will not continue to destroy this country. And if they do, we're going to the World Court. And if they do, we're going to do other things like, excuse me, we're going to tax your product 25% and they will come to the table because they will have -- they will have a depression in China the likes of which you've never seen. Now, by the way, it's not only us. Europe is doing unbelievably badly -- unbelievably badly. But China is doing a number on them also because their manipulation of currency is absolutely sapping the Europeans. Now, one thing about Europe I have to say. They created the euro. They got together and they created a currency. You know why? Because they wanted to do harm to the United States. They wanted to compete better against the United States. Well, now it's coming back to haunt them. Now, I have a lot of jobs in Europe, a lot of friends in Europe. I came from Europe I guess a long time ago. Meaning my mommy and my daddy. But -- but they did want to inflict harm on us, economic harm, and, boy, have they gotten screwed. What a mess. They weren't counting on Greece and Spain and Italy and everybody collapsing. So when people say about the euro and Europe, and if Europe goes, we could be. Well, I'm not sure, it could be just the reverse. Again, remember, the euro was created -- every economist disagrees with me. But I went to the Wharton School of Finance, best business school in the world and I was very good at economics. I want to tell you. The euro was created to take advantage of the United States, to create size and lots of other things, and therefore, beat the United States at business. It's not working out so well. Of course, it is working out for Germany. You know, Germany is trying to take over the world. They tried it with militarily it didn't work. Now they're buying our debt at huge discounts. I mean, when Greece looks at who's buying out all their debt. Germany is doing very nicely, folks. But you may only end up with Germany. So I really feel that it's possible -- it's very possible that, with respect to Europe, if it gets weaker and weaker, which is probably happening, that's a positive thing for the United States. Now, I'm the only one that said that. And in fact, the market went down 275 points today because Europe is weak. But it's sort of interesting. And in the statement about Europe, they talked about other countries that were taken advantage of them. So I'm here because I love this country. I would much prefer, as much as I love North Carolina, I wouldn't mind being home playing with Barron Trump. But this is so important to me because I've heard -- now these are political pundits, most of whom don't know what they're talking about, but I -- I tend to agree with this. I have heard numerous times by very smart people, some of whom I respect, most of whom I don't respect, that whoever wins North Carolina wins the election. Have we heard that? In other words, you're in a very, very important position, and you are the people that can bring it home. I hear the polls are pretty even. It's not going to be easy because whether you like Barack Obama as a President or not, and most people don't and most people see what's going on, and he's not doing well. He is a great campaigner, and that you have to give him credit for. And you're going to have to fight like hell because probably it is true. Now, you might add Florida, you might add Ohio, you might add a couple, but the fact is every time I'm listening to some of the most respected people, they're talking about the importance of North Carolina, the importance of the people in this room. So with that, I leave you. I wish you luck. I really, really have enjoyed being here. You're great, great people, amazing people. And I really am honored to be with you tonight and have a good evening. Thank you very much. Thank you. Thank you very much. Thank you. Thank you. Thank you."}