{"id":522,"author":"Donald Trump","title":"Speech: Donald Trump Endorses Mitt Romney for President in Las Vegas, NV","date":"2012-02-02","link":"https://factba.se/transcript/donald-trump-speech-las-vegas-nv-february-2-2012","paragraphs":["As everybody in this room knows our country is in serious, serious trouble, whether it's OPEC. The OPEC nations or China or virtually anybody that we do business with throughout the world. They take advantage of us. They laugh at us. They can't believe their good fortunes. I deal with these people and they can't believe what they're getting away with.","So we really have an opportunity to do something great for the country. And just a little while ago I didn't even mention this but the CBO chief in Washington announced that if unemployment is going up to 9.2% by sometime in January. So it's going to go up and the growth rate is going to be at about 1%. So this just came out not good news.","It's my honor, real honor and privilege to endorse Mitt Romney. I've gotten -- And by the way, this is a great couple. You look at this couple. But Mitt is tough, he's smart, he's sharp, he's not going to allow bad things to continue to happen to this country that we all love. So Governor Romney, go out and get him.","You can do it."],"text":" After all news organizations were reporting this morning that he was endorsing Newt Gingrich. As everybody in this room knows our country is in serious, serious trouble, whether it's OPEC. The OPEC nations or China or virtually anybody that we do business with throughout the world. They take advantage of us. They laugh at us. They can't believe their good fortunes. I deal with these people and they can't believe what they're getting away with. So we really have an opportunity to do something great for the country. And just a little while ago I didn't even mention this but the CBO chief in Washington announced that if unemployment is going up to 9.2% by sometime in January. So it's going to go up and the growth rate is going to be at about 1%. So this just came out not good news. It's my honor, real honor and privilege to endorse Mitt Romney. I've gotten -- And by the way, this is a great couple. You look at this couple. But Mitt is tough, he's smart, he's sharp, he's not going to allow bad things to continue to happen to this country that we all love. So Governor Romney, go out and get him. You can do it. There are some things that you just can't imagine happening in your life. This is one of them. Being in Donald Trump's magnificent hotel and having his endorsement is a delight. I'm so honored and pleased to have his endorsement and of course, I'm looking for the endorsement of the people of Nevada and Donald Trump has shown an extraordinary ability to understand how our economy works to create jobs for the American people. He's done it here in Nevada. He's done it across the country. He understands that our economy is facing threats from abroad. He's one of the few people who stood up and said, \"You know what, China has been cheating.\" They've they've taken jobs from Americans. They haven't played fair. We have to have a president who will stand up to cheaters. We believe in free trade and free enterprise. But we don't believe in allowing people to cheat day in and day out. And I'm going to work very, very hard to make sure that the people in this country have a brighter future that that's being projected by the CBO. Their -- their analysis of what -- what's going to happen in the future of America is driven by the policies they're seeing from a president who's failing. He's frequently telling us that he did not cause the recession, and that's true but he made it worse. And he made the recovery long and tepid. The people here in Nevada are suffering so many people have their homes underwater, it's extraordinary. And Nevada leads the nation in a very negative way, which is if you look at foreclosures of the last 90 days Nevada is No. 1 in the nation. This is a very tough time for the people in Nevada. And I want to do everything in my power to get this economy going again so people can be in homes they can afford so people can come here for tourism, so we can have the American people have rising incomes again, so we can make sure that America stands stock strong around the world. We have a president, who may be a nice guy, but he is way over his head. He does not understand what it takes to get America working again. And I do. I spent my life in the private sector not quite as successful as this guy but successful nonetheless sufficiently successful to understand what it takes to get America to be the most attractive place in the world for innovators entrepreneurs and business and -- and job creators. I want America to be the place people want to come and grow. And -- and I will use all of my energy to get America working again to help the people of this country have rising incomes, good jobs, and homes that are worth something again. So I want to say thank you to Donald Trump for his endorsement. It means a great deal to me to have the endorsement of -- of Mr. Trump and people across this country who care about the future of America. I think it's time for us to recognize we can't keep going down the road we're on. We have to dramatically change course. We have to restructure the way government interacts with people our government too big is too intrusive. It's placed too great burdens on our -- our people in this country. I will dramatically change the way this government is working. And I'll also stand up for our friends abroad and make sure that America remains the shining city on a hill. Thank you so much for your help and your endorsement today. I look forward to seeing you out on the trail. Thank you, Donald. Where is she? A couple of people I should mention here. I see right in the front row Lieutenant Governor Krolicki and appreciate him being here. He's been chairman of my effort in the state and I appreciate that. And Dima McGlynn, former first lady. Please stand up. Governor and Dima, please stand up. Thank you. Thank you. Look forward to seeing you all out on the trail and make sure and vote on Saturday. I need every vote I can get. Thanks you guys. All right."}