{"id":523,"author":"Donald Trump","title":"Speech: Donald Trump at the National Achiever's Congress in Sydney, Australia","date":"2011-09-21","link":"https://factba.se/transcript/donald-trump-speech-sydney-nsw-september-21-2011","paragraphs":["Wow! Wow, what a group. What a group. Thank you. Wow. I see they've been paid more money for this. I made a bad deal. I made a terrible deal. You know, we'll do what the baseball players do, we'll renegotiate, right? Well, it's an honor to be here in Australia, and Jennifer is a fabulous woman. You know it's a -- women have always been tough on me. The only time I've ever made money with women was when I bought the Miss Universe pageant, and I will tell you, it was a -- and I've lost a lot of money with women but that's acceptable.","I don't mind that. But you know, I was really honored that Jennifer came in. I thought it was great, and it just shows you do have cases though where people quickly forget. In Jennifer's case, when she heard about it, just the opposite. But you have cases where people in this room have made people, made people, and they quickly forget.","And I don't like those people and I go after those people. In fact now -- No, I do. I go after them. But here's what we do, we're going to discuss today success, and things that I've learned. And I had plenty of time to think about it because I just got off a plane, 22 hours, and if you can't think about things like success for 22 hours -- I mean, you got -- I could talk to you for a long time about success.","But there are certain aspects of success that are just so vital, they're so important, and a lot of people don't discuss them and we're going to discuss them tonight. And you know I love to teach -- I love to teach -- This room is sold out, it's 10,000 people, more than 10,000 people, and I'm very honored.","But I like speaking in front of large crowds because I've learned a lot over the years, good and bad, and I like to impart the knowledge. I like to make people happy. You know, you look at divorce rates, the biggest problem with marriage and the biggest reason for divorce is money. They don't have enough money.","So, success never changes. Whatever it takes, it takes. A lot of you people have a certain factor that make you successful. A lot of people don't. And I sort of go around to these, and when I do them, I will talk about people that shouldn't even be in the room. Because there are people that can't do certain things, they can't be entrepreneurial.","They just can't. No matter what, they can't be entrepreneurial. If I can tell somebody in this room that they shouldn't be an entrepreneur, I'd be very happy to do that. Because in some cases I'm saving people's lives. Not everybody's cut out to be an entrepreneur. Not everybody can handle pressure, they can't -- One of the things I came up with, and it's something I've really started saying a lot and talking a lot about, is the word pressure.","Now, we can go down and say you've got to love your subject, you've got to this, you've got to that. There's 25 things that you read in every business book, and you know them and I know them, and I'm going to say them anyway. But we know them. But the one thing I've never seen in a business book is the ability to handle pressure.","And there's a great ability that some people have to handle pressure. And if you don't have it, it's not going to work. So, I withstood tremendous pressure in 1990. In fact, Guinness Book of Records gave me a great honor. Recently, they gave me the honor of the greatest financial comeback of all time, personal financial comeback.","And you know I'm not even sure if I should call that an honor. You know I always hesitate to say it because that means you're in trouble, and I don't like to think I had trouble. But a lot of people think because I had trouble and came back -- No, I never went bankrupt. A lot of my friends went bankrupt.","You'll never hear from them again. So I never went bankrupt, but I worked hard, the markets crashed, 1990, just like you sitting here. Those markets were crashing. They were bad. And Guinness came up and they figured I did a damn good job, because today my company is worth, you know, many many times what it was in the 1980s and the 1990s, and you know it's been good.","Businessweek said Donald Trump -- they announced different things. Donald Trump is by far the most competitive businessman. I like that. I don't know what it means because, you know, what's competitive. I mean I get sued every day. I get it -- it doesn't even bother me. It's like people sue me. No. You know I call it the Long Gray Line.","And a friend of mine comes up to me and says, how do you stand it? You get sued so much. How do you stand it? I said, I don't even think about it. And your country is so much more advanced than our country. I know you have your own problems. One little story. They asked me to take a picture in front of your opera house, which I thought was a great idea.","It was windy as hell. OK. And you know what happens when it's windy if you're Trump. You know what it is? My hair. No bald spot. Wait. I don't see a bald spot. I'm doing better than most of my guys my age. There's so much common sense in business. I see it all the time. I mean, I look at things and I look at the stupidity with which people work.","I look at Obama and I say -- Because I have so many different things. There's luck. There's -- there's you know -- you need to hire the right people and you need not to trust them at all because they'll take the shirt off your back. You know my mother, in one speech, was there and I told -- I said that you need to get great people and not trust them.","My mother came up to me Darling did you make a mistake? You said get great people and not trust them. Was that a mistake? I said no. Because, if they don't respect you, they'll steal from you. They'll take the shirt off your back. They think the company is theirs. They've got to respect you. If they don't respect you, if you're a slacker and if you don't work hard, if they don't think you're smart, if they think they're smarter than you, they'll rob you.","They'll steal from you and you won't know what happened until it's too late. So my mother gave me a little hard time. She said, that's not the way it is Donald. You get the right people and trust them. I disagree. You get the right people, they're great people and don't trust them for one minute. OK? They're after your wife, they're after your dog, they're after your money.","Get your right people anyway. Now, you have to love what you do. And I'm not going to go over that long, but it solves a lot of problems. Because when you love what you do, when you really love what you do, you work harder. So it's really a great thing and I just feel it's very important. Now, never ever give up. You can change and you can move around, but never ever give up. I know people that are very smart.","They went to the Wharton School of Finance with me. I know other people that aren't as smart and those people are the top people in industry today and the top -- they just were tougher. They didn't give up. And the smart ones had everything on their plate, they'd always come in with +A on the tests and the good boards and everything else, but when they ran into problems, they didn't know how to solve the problems like the guys that weren't as good.","And it's very seldom that you see something other than this happen. So, never ever give up. But we don't use our bright, our brilliant guys in the United States, to negotiate against China and various other people. We use people that are diplomats. You know what a diplomat is? A diplomat is somebody who goes to school to be nice.","They want to be nice. So if we would use -- I know all the killers in New York. If I would use -- if I would pick out a team, like we do a golf team, I'll pick the Ryder Cup of business people. We will -- what we would do to the rest of the world would be unbelievable. But we have politicians that don't do that because they want to be nice.","I mean, I deal with China. I respect China. I'm not angry at China because they're ripping off the United States. I just wish we had somebody that could rip them off for a while, OK? That's one of the reasons I love Australia because you're selling them all sorts of shit and -- No, I love it. And that crap is coming out of the ground, and you don't know what it is and they don't know what it is, but they're paying you a lot of money.","And I say raise your prices raise your prices. Raise your prices. Tell your guys, raise your prices. What you do is really screw them on the sale of the raw materials. Trust me, you'll be richer than China. Because they need you badly. You have all the cards. And you know -- even Japan. Look, we love Japan.","They went through a tsunami, they've got some problems. You know, they have a couple of little nuclear problems where their machines are exploding all over the place, but -- And now we're all feeling so sorry for Japan but they've been screwing us for 25 years. And as I said, when was the last time you saw somebody buy a Chevrolet in Japan?","Doesn't happen. I mean, I'd like to know, how many Chevrolets were sold in Japan? They sell them here. But you know -- but they're our ally. You know China, this year, is going to make $300 billion on us, 300 billion. And that's a low number. That was, that was recently, and they just announced that the number's actually going to be much higher than that.","But you know, you take other countries like Colombia. Colombia has made $4 billion last year, $4 billion on us. That's a small country. And I actually spoke with a group representing Obama. I say. let me ask you a question, do we make any good deals? Is there one country? One. I just want to see one, where we made a good deal.","I mean we gave the Panama Canal away for a dollar. Jimmy Carter, he was another beauty. He was a great one. We're giving it away for $1, $1. You know what they did? They doubled the price -- the Panama Canal is making so much money that they're now building a new and bigger Panama Canal. Jimmy Carter gave it away for $1. You think he was a great negotiator?","This is what we have. We have very stupid people running the United States. OK. I know, run. Everyone says run, we should run. And you know what? I did run. I was No.1 in every poll. But you know, we have a rule that you can't be on television and run for office. So I'm saying to myself I have this show called Celebrity Apprentice, which is a big hit.","Big hit. And by the way, Mark -- you know, the group that does it here, they do a great job too. I mean, they do a good job and really a good job. But we have a -- you know it's a tremendous success. And you have equal time, so you can't do that. You can't run for office and have the show.","But I am watching. And if the economy continues to be bad, which I think it will because we have incompetent people leading our country. See, other people say, we have people that do quite get it. I say they they're totally frickin' incompetent, OK? Because it's true. We have incompetent people. So if the economy's bad and if the Republicans pick the wrong candidate, I will very strongly consider running as an independent.","And I think an independent -- The United States has some serious problems but they can be worked out. And you know, speaking of entrepreneurship and I -- I started off by saying that you really -- it's sort of the same, no matter -- you need certain traits and certain abilities, but if you're an entrepreneur in a country that's not doing well, it's hard.","You need good leadership because it's much harder for you to be successful when a country is, you know, not doing well. If the United States is way off kilter, and I think it's going to come back, but the United States is way off kilter. If if you're an entrepreneur -- and I hear good things. I must tell you, and I know some people will hate what I say and some people will love it, but I hear good things about the way Australia is being run and running.","And you know you just had some -- your financial genius just got a nice award. He was voted the best in the world at this time. Now I don't know who gives him that award. Maybe he does. No, I don't know. I do that. I give myself awards all the time. I give -- and then I announce, I've just received an award.","And there's nothing deceptive about it because I actually did, but I gave it to myself. So, I don't know. I don't know who gave him the award but I just saw it on television. So, anyway. But I think you are doing OK. But it's so good to be an entrepreneur. Now there's a word known as luck.","And this is a sad word. This is a word that I hate to talk to people about, because some people are lucky and some people aren't. Some people are lucky. You know Gary Player, the great golfer. He was a little guy. Very little, but he worked really hard. And he had a great statement, the luckier I get -- you know the statement, it goes -- and he used to work harder than anybody.","He'd go, the harder I work, the luckier I get. And he wins the U.S. Open, you have all these big handsome guys, these big giant guys and they're hitting the ball a mile, and you have Gary Player. And Gary Player would win the Open, he'd win the Masters, he'd win this, he'd win that. And he said, you know, hey -- in the U.S. Open he hit a five iron to one foot from the hole and he ended up getting a birdie and wins the U.S. Open, right?","And he came off the green -- now, I know I've heard the statement before but I heard it from him in a meaningful way. They said, what do you think Gary? What is it? He said, all I know is I've been working very hard. And the harder I work, the luckier I get. I thought it was an amazing statement. So you can do something about luck.","I'll give you one other luck story because luck is important. I was in deep, deep trouble in the early '90s. The markets totally collapsed, the banks were collapsing, the savings and loan were collapsing. I had a beautiful girlfriend named Marla. Did anyone ever hear of Marla? OK. Cost me a frickin' fortune let me -- and I'm walking down Fifth Avenue, right in front of Tiffany, OK? Right in front of Trump Tower, Tiffany.","And there's a man, a blind man. He's got pencils in a tin can and a dog, seeing eye dog. And I said to Marla, Marla, do you know who that is? She goes, yes darling. Isn't it sad? He's a beggar. I go, well you know, right now, that beggar is worth $900 million more than I am. And she goes, somewhat naively -- although, in retrospect, she wasn't very naive at all.","She goes, what do you mean darling? He's not worth $900 million is he? I said no. Let's assume he's worth nothing, but I'm worth minus $900 million right now. And you know what, she didn't run away. She didn't run. Most girls would have said, oh, I'm a little late. I got to get out of here. Had she done that I would have saved a lot of money but she didn't. But there's a great story about that.","So -- and this is a story of luck. I go to my office and my secretary, she's been with me for a long time, said Mr. Trump you have a major black tie dinner tonight. I said, where? The Waldorf Astoria. I said, who's there? The bankers. I said, bankers, oh, shit. I owe them $9.2 billion. OK? Have no intention of paying it. And I have to go to a bankers then.","It's true. So, I say, I don't even want to go. I'm not going. She said, no, you got to go and you know on top of it it's black tie. So now, on top of everything else, I have to put on a tuxedo to get abused. So I go, I say, you know -- I go home, not even think -- and then I call my -- I say, give me the details.","I'm going to go. OK. Now we're talking about luck. So, I go and I'm sitting at a table loaded up with bankers and the guy my left was a nice guy. Obviously he didn't loan me any money. And he was a nice guy and he's talking to me a little bit. The guy on my right, I didn't know who he was, and I say, hello, how are you?","He goes, huh, and he turns his head. The guy on my left says, he doesn't like you very much. I said, I've got -- you know, I sort of understand that. So, I started talking to the guy in the left for a while and then I'd hit the guy in the right and you could see the hatred was immense. Well this was a guy that bankrupted 32 different people.","He was with a certain bank. I won't name the bank. I owed him 179 million, $179 million. And he was nasty and he wasn't even taking my my phone calls. He wasn't taking anybody's phone calls from -- he was a bad guy. He was bankrupting everybody instead of working it out. So, now, I'm sitting next to him.","I figured out it was him because I said, what's your name? He looks at me and he didn't even want give it, OK? He was insulted that I didn't know, but I never met him. I owe him -- think of it, I owe 179 million bucks, I never even met the banker. So, the evening goes by and I started working on him hard.","You know, it's called work. It's not pleasure. I'd rather be home watching television. Like to say read a book makes me more intellectual. I actually was like this. So I can think of about a thousand places I would have rather been, but it's work. But I'm at this dinner and I'm sitting next to a guy, now call that luck.","It wasn't working but call it luck. Now, I started working on him and we were talking about different things, and all of a sudden I could see that he was starting to like me. I happen to be a nice guy. People like me. You know, with the Apprentice, they say it can never work because women will never like Donald Trump.","And I say, excuse me? I have -- who's done better with women than Trump? And by the way, my highest audience is women. Women. They love Trump. It's a crazy thing. See? Women are smart aren't they? OK. So what happens -- I'm with the banker, and at the end of the evening says, you know I got to tell you, you're really a great guy.","I like you. Can you be in my office? You know, when you owe lots of money you go to their office. Can you be in my office on, this was a Friday, on Monday morning at nine o'clock? We'll see if we can work something out. Now he bankrupted I think was 32 different people, and he was vicious. No deals, no negotiation, no nothing.","I said, I'll be there. I went to his office, and in five minutes, we worked out a deal for a lot of money. And if I didn't work it out with him, I had a 100 hundred banks and he was the only one I couldn't work it out, then the other banks could never have done. Because, you know, a lot of the people worked with him.","If you don't do it perfectly, they can't, you know -- it's just the way it is. So, I work out a deal. Now, I said thank you very much, you really are a gentleman. Even though he's a rough guy, but I won't go -- with me he was a gentleman. But think about the word luck and think about working hard. I didn't want to go there.","I said I'm not going. I refused to go. My secretary gave me one more chance. I went, I happened to sit next to the guy but I would have never sat next to him. And had I not gone and had I not sat next to him, and done well with him, I probably wouldn't be here because the empowerment group would say, who the hell wants a loser.","Who the hell -- well maybe they'd me as head of blow a fortune, OK? So, the word luck -- and I consider that to be an important thing, because the word luck, you can make yourself luckier. Now, just a few other things. Passion. You need passion. You just have to do it. You need passion. Go against the tide, if you have talent.","If you have talent, go against the tide. Some of the best deals I ever made were being -- like, I just bought Bank of America stock. I mean, I'm not a big fan of Bank of America. In fact, I'm suing them. You know I bought a winery down in Virginia, at a bankruptcy auction, and they have a house that should have been included and I'm suing them.","And yet I go out and buy their stock. Now, you tell me, am I crazy or what? But. I went out and bought some Bank of America stock. I'm not a big stock guy, but -- but it's been so badly beaten, and it's sort of going against the tide. Go with your gut, go against the tide. I sort of like that. I mean, to me, I like it. Now, the lucky thing -- I'm going to go back to it, because some people are lucky, some to be more.","You know if you're lucky. And if you're not lucky, enjoy your job. Go get a job and enjoy it. And there's nothing wrong with that. Because I hate to see people leave an auditorium and get all psyched because I heard a good speech by somebody, and they go out and they give up their job and they want to be an entrepreneur and they don't have whatever it takes or -- you know, it's hard to be an entrepreneur.","You have to really have something very special. And sometimes what I'm happiest about is I convince people not to be an entrepreneur. It's not what this is all about, but there are a lot of people that are not equipped to do it and a lot of that word, pressure, is involved in this. You have guys, they're just as smart -- they're smarter, but they can't handle the pressure.","You see it with golfers. I have friends that can't sink a three foot put. You put money on the line and you say, put that ball in the hole. They can't -- they can't even take the club. They're like this. I say, you're a basket case. Of course it doesn't help when I'm calling them a basket case brains. Now, there's a couple of other things and you know these are things you learn in business school.","But, you know, I believe in it. Get even with people. If they screw you. Screw them back 10 times as hard. I really believe -- And I'll give you an example. Jennifer Hawkins. Where is Jennifer? Where is she sitting? Come up here Jen. First of all, how beautiful is Jennifer?","Now, this is about getting even. I was so angry at her yesterday. Seriously, because as I said. I thought that she dissed me. I thought that my Jennifer -- I go here and I'm going around saying, she's my favorite Miss Universe. But I think I'd like the new one better Jennifer. So, I go around saying she's the greatest, she writes books.","They call me, I say, I don't to answer another Jennifer Hawkins question. She's fantastic. And then why I came here. There was no Jennifer Hawkins to introduce.","So I was -- I was actually going to get up and tell you that Jennifer is a beautiful girl on the outside but she's not very bright. That wouldn't have been true, but I would have said it anyway, because when -- I said, you know what, it would be great. I haven't seen Jennifer in a couple of years.","She's so great and she did so well, and she's a big star here. And I helped her make it. I own the Miss Universe pageant. And I heard that she wouldn't introduce me.","I know, but no -- but you did. So what happens is -- and you know what? She came tonight. She came. Came. She came. So they have the same filthy minds in Australia. . I was gonna refer to the --","No, but here's the beauty. When she found out about it, she got in that car and she got her ass over here and I love her.","You know, I don't know too many women that are taller than me.","No you're not.","Yes, go.","She's great. Here's the thing. Get even with people in business. Because, if you don't, they will continue to go after you. And not even those people, but other people. And they're not necessarily teaching you this stuff in school, but this is things that I've learned over the years. You got to get even with people.","Because even if you don't come into contact with them, everyone else knows you're a fighter and you're not going to take crap, and other people aren't going to take advantage of you. So I think it's really important, if somebody screws you screw them back in spades, and I really believe it's important whether you like it or not.","Now, what you want to do is get out, work hard. You're in a great country. This country is a great country. I -- It really is. I have so many friends from Australia. A lot of them have like moved to New York but they always come back. I mean to them -- in a lot of countries they move to New York they don't want to come back to their country.","Everybody from Australia when they go to New York they expect to come back. But I have so many friends from Australia. They love this country. It's a great country, it's a rich country. It's a really rich country and it's a beautiful country. And honestly, it's my great honor to be with this very beautiful full auditorium tonight.","Was that good or bad? OK, I'm going to run through a couple of other points. Think big. Much easier. Think big. Focus on the positive. You know it's really important to focus on the positive. The word momentum is a word that you never hear in success talks, and it's a word that I felt to be very important.","Some of you have great momentum going now. Play it. Others of you don't. Others of you it's over. And if it's over, know it's over. There's nothing wrong with it. But the word momentum, when you think of that, think of William Levitt. Just think about it. So, I just want to end by saying that I've enjoyed this.","I've really enjoyed it. I'm going to come back. They want me back and we're going to be back again at some point in the not-too-distant future. But so much of success is seeing yourself as victorious. You have to see yourself. You have to really believe in yourself. And sometimes it's hard.","You know you've had failures, you've had weaknesses, you've had other things. You have to see yourself as a one-man band. Don't rely too much on other people because they'll let you down. You have to see yourself as victorious. And to be a winner, you have to think like a winner. If you don't think like a winner, it's just never going to happen.","And I have to tell you, it's a real honor. And even though the 22-hour trip is a little abnormally long, this is an amazing group of people and it's an amazing country, and I very much appreciate it. Thank you. Thank you. Thank you."],"text":" Wow! Wow, what a group. What a group. Thank you. Wow. I see they've been paid more money for this. I made a bad deal. I made a terrible deal. You know, we'll do what the baseball players do, we'll renegotiate, right? Well, it's an honor to be here in Australia, and Jennifer is a fabulous woman. You know it's a -- women have always been tough on me. The only time I've ever made money with women was when I bought the Miss Universe pageant, and I will tell you, it was a -- and I've lost a lot of money with women but that's acceptable. I don't mind that. But you know, I was really honored that Jennifer came in. I thought it was great, and it just shows you do have cases though where people quickly forget. In Jennifer's case, when she heard about it, just the opposite. But you have cases where people in this room have made people, made people, and they quickly forget. And I don't like those people and I go after those people. In fact now -- No, I do. I go after them. But here's what we do, we're going to discuss today success, and things that I've learned. And I had plenty of time to think about it because I just got off a plane, 22 hours, and if you can't think about things like success for 22 hours -- I mean, you got -- I could talk to you for a long time about success. But there are certain aspects of success that are just so vital, they're so important, and a lot of people don't discuss them and we're going to discuss them tonight. And you know I love to teach -- I love to teach -- This room is sold out, it's 10,000 people, more than 10,000 people, and I'm very honored. But I like speaking in front of large crowds because I've learned a lot over the years, good and bad, and I like to impart the knowledge. I like to make people happy. You know, you look at divorce rates, the biggest problem with marriage and the biggest reason for divorce is money. They don't have enough money. So, success never changes. Whatever it takes, it takes. A lot of you people have a certain factor that make you successful. A lot of people don't. And I sort of go around to these, and when I do them, I will talk about people that shouldn't even be in the room. Because there are people that can't do certain things, they can't be entrepreneurial. They just can't. No matter what, they can't be entrepreneurial. If I can tell somebody in this room that they shouldn't be an entrepreneur, I'd be very happy to do that. Because in some cases I'm saving people's lives. Not everybody's cut out to be an entrepreneur. Not everybody can handle pressure, they can't -- One of the things I came up with, and it's something I've really started saying a lot and talking a lot about, is the word pressure. Now, we can go down and say you've got to love your subject, you've got to this, you've got to that. There's 25 things that you read in every business book, and you know them and I know them, and I'm going to say them anyway. But we know them. But the one thing I've never seen in a business book is the ability to handle pressure. And there's a great ability that some people have to handle pressure. And if you don't have it, it's not going to work. So, I withstood tremendous pressure in 1990. In fact, Guinness Book of Records gave me a great honor. Recently, they gave me the honor of the greatest financial comeback of all time, personal financial comeback. And you know I'm not even sure if I should call that an honor. You know I always hesitate to say it because that means you're in trouble, and I don't like to think I had trouble. But a lot of people think because I had trouble and came back -- No, I never went bankrupt. A lot of my friends went bankrupt. You'll never hear from them again. So I never went bankrupt, but I worked hard, the markets crashed, 1990, just like you sitting here. Those markets were crashing. They were bad. And Guinness came up and they figured I did a damn good job, because today my company is worth, you know, many many times what it was in the 1980s and the 1990s, and you know it's been good. Businessweek said Donald Trump -- they announced different things. Donald Trump is by far the most competitive businessman. I like that. I don't know what it means because, you know, what's competitive. I mean I get sued every day. I get it -- it doesn't even bother me. It's like people sue me. No. You know I call it the Long Gray Line. And a friend of mine comes up to me and says, how do you stand it? You get sued so much. How do you stand it? I said, I don't even think about it. And your country is so much more advanced than our country. I know you have your own problems. One little story. They asked me to take a picture in front of your opera house, which I thought was a great idea. It was windy as hell. OK. And you know what happens when it's windy if you're Trump. You know what it is? My hair. No bald spot. Wait. I don't see a bald spot. I'm doing better than most of my guys my age. There's so much common sense in business. I see it all the time. I mean, I look at things and I look at the stupidity with which people work. I look at Obama and I say -- Because I have so many different things. There's luck. There's -- there's you know -- you need to hire the right people and you need not to trust them at all because they'll take the shirt off your back. You know my mother, in one speech, was there and I told -- I said that you need to get great people and not trust them. My mother came up to me Darling did you make a mistake? You said get great people and not trust them. Was that a mistake? I said no. Because, if they don't respect you, they'll steal from you. They'll take the shirt off your back. They think the company is theirs. They've got to respect you. If they don't respect you, if you're a slacker and if you don't work hard, if they don't think you're smart, if they think they're smarter than you, they'll rob you. They'll steal from you and you won't know what happened until it's too late. So my mother gave me a little hard time. She said, that's not the way it is Donald. You get the right people and trust them. I disagree. You get the right people, they're great people and don't trust them for one minute. OK? They're after your wife, they're after your dog, they're after your money. Get your right people anyway. Now, you have to love what you do. And I'm not going to go over that long, but it solves a lot of problems. Because when you love what you do, when you really love what you do, you work harder. So it's really a great thing and I just feel it's very important. Now, never ever give up. You can change and you can move around, but never ever give up. I know people that are very smart. They went to the Wharton School of Finance with me. I know other people that aren't as smart and those people are the top people in industry today and the top -- they just were tougher. They didn't give up. And the smart ones had everything on their plate, they'd always come in with +A on the tests and the good boards and everything else, but when they ran into problems, they didn't know how to solve the problems like the guys that weren't as good. And it's very seldom that you see something other than this happen. So, never ever give up. But we don't use our bright, our brilliant guys in the United States, to negotiate against China and various other people. We use people that are diplomats. You know what a diplomat is? A diplomat is somebody who goes to school to be nice. They want to be nice. So if we would use -- I know all the killers in New York. If I would use -- if I would pick out a team, like we do a golf team, I'll pick the Ryder Cup of business people. We will -- what we would do to the rest of the world would be unbelievable. But we have politicians that don't do that because they want to be nice. I mean, I deal with China. I respect China. I'm not angry at China because they're ripping off the United States. I just wish we had somebody that could rip them off for a while, OK? That's one of the reasons I love Australia because you're selling them all sorts of shit and -- No, I love it. And that crap is coming out of the ground, and you don't know what it is and they don't know what it is, but they're paying you a lot of money. And I say raise your prices raise your prices. Raise your prices. Tell your guys, raise your prices. What you do is really screw them on the sale of the raw materials. Trust me, you'll be richer than China. Because they need you badly. You have all the cards. And you know -- even Japan. Look, we love Japan. They went through a tsunami, they've got some problems. You know, they have a couple of little nuclear problems where their machines are exploding all over the place, but -- And now we're all feeling so sorry for Japan but they've been screwing us for 25 years. And as I said, when was the last time you saw somebody buy a Chevrolet in Japan? Doesn't happen. I mean, I'd like to know, how many Chevrolets were sold in Japan? They sell them here. But you know -- but they're our ally. You know China, this year, is going to make $300 billion on us, 300 billion. And that's a low number. That was, that was recently, and they just announced that the number's actually going to be much higher than that. But you know, you take other countries like Colombia. Colombia has made $4 billion last year, $4 billion on us. That's a small country. And I actually spoke with a group representing Obama. I say. let me ask you a question, do we make any good deals? Is there one country? One. I just want to see one, where we made a good deal. I mean we gave the Panama Canal away for a dollar. Jimmy Carter, he was another beauty. He was a great one. We're giving it away for $1, $1. You know what they did? They doubled the price -- the Panama Canal is making so much money that they're now building a new and bigger Panama Canal. Jimmy Carter gave it away for $1. You think he was a great negotiator? This is what we have. We have very stupid people running the United States. OK. I know, run. Everyone says run, we should run. And you know what? I did run. I was No.1 in every poll. But you know, we have a rule that you can't be on television and run for office. So I'm saying to myself I have this show called Celebrity Apprentice, which is a big hit. Big hit. And by the way, Mark -- you know, the group that does it here, they do a great job too. I mean, they do a good job and really a good job. But we have a -- you know it's a tremendous success. And you have equal time, so you can't do that. You can't run for office and have the show. But I am watching. And if the economy continues to be bad, which I think it will because we have incompetent people leading our country. See, other people say, we have people that do quite get it. I say they they're totally frickin' incompetent, OK? Because it's true. We have incompetent people. So if the economy's bad and if the Republicans pick the wrong candidate, I will very strongly consider running as an independent. And I think an independent -- The United States has some serious problems but they can be worked out. And you know, speaking of entrepreneurship and I -- I started off by saying that you really -- it's sort of the same, no matter -- you need certain traits and certain abilities, but if you're an entrepreneur in a country that's not doing well, it's hard. You need good leadership because it's much harder for you to be successful when a country is, you know, not doing well. If the United States is way off kilter, and I think it's going to come back, but the United States is way off kilter. If if you're an entrepreneur -- and I hear good things. I must tell you, and I know some people will hate what I say and some people will love it, but I hear good things about the way Australia is being run and running. And you know you just had some -- your financial genius just got a nice award. He was voted the best in the world at this time. Now I don't know who gives him that award. Maybe he does. No, I don't know. I do that. I give myself awards all the time. I give -- and then I announce, I've just received an award. And there's nothing deceptive about it because I actually did, but I gave it to myself. So, I don't know. I don't know who gave him the award but I just saw it on television. So, anyway. But I think you are doing OK. But it's so good to be an entrepreneur. Now there's a word known as luck. And this is a sad word. This is a word that I hate to talk to people about, because some people are lucky and some people aren't. Some people are lucky. You know Gary Player, the great golfer. He was a little guy. Very little, but he worked really hard. And he had a great statement, the luckier I get -- you know the statement, it goes -- and he used to work harder than anybody. He'd go, the harder I work, the luckier I get. And he wins the U.S. Open, you have all these big handsome guys, these big giant guys and they're hitting the ball a mile, and you have Gary Player. And Gary Player would win the Open, he'd win the Masters, he'd win this, he'd win that. And he said, you know, hey -- in the U.S. Open he hit a five iron to one foot from the hole and he ended up getting a birdie and wins the U.S. Open, right? And he came off the green -- now, I know I've heard the statement before but I heard it from him in a meaningful way. They said, what do you think Gary? What is it? He said, all I know is I've been working very hard. And the harder I work, the luckier I get. I thought it was an amazing statement. So you can do something about luck. I'll give you one other luck story because luck is important. I was in deep, deep trouble in the early '90s. The markets totally collapsed, the banks were collapsing, the savings and loan were collapsing. I had a beautiful girlfriend named Marla. Did anyone ever hear of Marla? OK. Cost me a frickin' fortune let me -- and I'm walking down Fifth Avenue, right in front of Tiffany, OK? Right in front of Trump Tower, Tiffany. And there's a man, a blind man. He's got pencils in a tin can and a dog, seeing eye dog. And I said to Marla, Marla, do you know who that is? She goes, yes darling. Isn't it sad? He's a beggar. I go, well you know, right now, that beggar is worth $900 million more than I am. And she goes, somewhat naively -- although, in retrospect, she wasn't very naive at all. She goes, what do you mean darling? He's not worth $900 million is he? I said no. Let's assume he's worth nothing, but I'm worth minus $900 million right now. And you know what, she didn't run away. She didn't run. Most girls would have said, oh, I'm a little late. I got to get out of here. Had she done that I would have saved a lot of money but she didn't. But there's a great story about that. So -- and this is a story of luck. I go to my office and my secretary, she's been with me for a long time, said Mr. Trump you have a major black tie dinner tonight. I said, where? The Waldorf Astoria. I said, who's there? The bankers. I said, bankers, oh, shit. I owe them $9.2 billion. OK? Have no intention of paying it. And I have to go to a bankers then. It's true. So, I say, I don't even want to go. I'm not going. She said, no, you got to go and you know on top of it it's black tie. So now, on top of everything else, I have to put on a tuxedo to get abused. So I go, I say, you know -- I go home, not even think -- and then I call my -- I say, give me the details. I'm going to go. OK. Now we're talking about luck. So, I go and I'm sitting at a table loaded up with bankers and the guy my left was a nice guy. Obviously he didn't loan me any money. And he was a nice guy and he's talking to me a little bit. The guy on my right, I didn't know who he was, and I say, hello, how are you? He goes, huh, and he turns his head. The guy on my left says, he doesn't like you very much. I said, I've got -- you know, I sort of understand that. So, I started talking to the guy in the left for a while and then I'd hit the guy in the right and you could see the hatred was immense. Well this was a guy that bankrupted 32 different people. He was with a certain bank. I won't name the bank. I owed him 179 million, $179 million. And he was nasty and he wasn't even taking my my phone calls. He wasn't taking anybody's phone calls from -- he was a bad guy. He was bankrupting everybody instead of working it out. So, now, I'm sitting next to him. I figured out it was him because I said, what's your name? He looks at me and he didn't even want give it, OK? He was insulted that I didn't know, but I never met him. I owe him -- think of it, I owe 179 million bucks, I never even met the banker. So, the evening goes by and I started working on him hard. You know, it's called work. It's not pleasure. I'd rather be home watching television. Like to say read a book makes me more intellectual. I actually was like this. So I can think of about a thousand places I would have rather been, but it's work. But I'm at this dinner and I'm sitting next to a guy, now call that luck. It wasn't working but call it luck. Now, I started working on him and we were talking about different things, and all of a sudden I could see that he was starting to like me. I happen to be a nice guy. People like me. You know, with the Apprentice, they say it can never work because women will never like Donald Trump. And I say, excuse me? I have -- who's done better with women than Trump? And by the way, my highest audience is women. Women. They love Trump. It's a crazy thing. See? Women are smart aren't they? OK. So what happens -- I'm with the banker, and at the end of the evening says, you know I got to tell you, you're really a great guy. I like you. Can you be in my office? You know, when you owe lots of money you go to their office. Can you be in my office on, this was a Friday, on Monday morning at nine o'clock? We'll see if we can work something out. Now he bankrupted I think was 32 different people, and he was vicious. No deals, no negotiation, no nothing. I said, I'll be there. I went to his office, and in five minutes, we worked out a deal for a lot of money. And if I didn't work it out with him, I had a 100 hundred banks and he was the only one I couldn't work it out, then the other banks could never have done. Because, you know, a lot of the people worked with him. If you don't do it perfectly, they can't, you know -- it's just the way it is. So, I work out a deal. Now, I said thank you very much, you really are a gentleman. Even though he's a rough guy, but I won't go -- with me he was a gentleman. But think about the word luck and think about working hard. I didn't want to go there. I said I'm not going. I refused to go. My secretary gave me one more chance. I went, I happened to sit next to the guy but I would have never sat next to him. And had I not gone and had I not sat next to him, and done well with him, I probably wouldn't be here because the empowerment group would say, who the hell wants a loser. Who the hell -- well maybe they'd me as head of blow a fortune, OK? So, the word luck -- and I consider that to be an important thing, because the word luck, you can make yourself luckier. Now, just a few other things. Passion. You need passion. You just have to do it. You need passion. Go against the tide, if you have talent. If you have talent, go against the tide. Some of the best deals I ever made were being -- like, I just bought Bank of America stock. I mean, I'm not a big fan of Bank of America. In fact, I'm suing them. You know I bought a winery down in Virginia, at a bankruptcy auction, and they have a house that should have been included and I'm suing them. And yet I go out and buy their stock. Now, you tell me, am I crazy or what? But. I went out and bought some Bank of America stock. I'm not a big stock guy, but -- but it's been so badly beaten, and it's sort of going against the tide. Go with your gut, go against the tide. I sort of like that. I mean, to me, I like it. Now, the lucky thing -- I'm going to go back to it, because some people are lucky, some to be more. You know if you're lucky. And if you're not lucky, enjoy your job. Go get a job and enjoy it. And there's nothing wrong with that. Because I hate to see people leave an auditorium and get all psyched because I heard a good speech by somebody, and they go out and they give up their job and they want to be an entrepreneur and they don't have whatever it takes or -- you know, it's hard to be an entrepreneur. You have to really have something very special. And sometimes what I'm happiest about is I convince people not to be an entrepreneur. It's not what this is all about, but there are a lot of people that are not equipped to do it and a lot of that word, pressure, is involved in this. You have guys, they're just as smart -- they're smarter, but they can't handle the pressure. You see it with golfers. I have friends that can't sink a three foot put. You put money on the line and you say, put that ball in the hole. They can't -- they can't even take the club. They're like this. I say, you're a basket case. Of course it doesn't help when I'm calling them a basket case brains. Now, there's a couple of other things and you know these are things you learn in business school. But, you know, I believe in it. Get even with people. If they screw you. Screw them back 10 times as hard. I really believe -- And I'll give you an example. Jennifer Hawkins. Where is Jennifer? Where is she sitting? Come up here Jen. First of all, how beautiful is Jennifer? Now, this is about getting even. I was so angry at her yesterday. Seriously, because as I said. I thought that she dissed me. I thought that my Jennifer -- I go here and I'm going around saying, she's my favorite Miss Universe. But I think I'd like the new one better Jennifer. So, I go around saying she's the greatest, she writes books. They call me, I say, I don't to answer another Jennifer Hawkins question. She's fantastic. And then why I came here. There was no Jennifer Hawkins to introduce. in my defense. That was miscommunication. Of course I wanted to come here. So I was -- I was actually going to get up and tell you that Jennifer is a beautiful girl on the outside but she's not very bright. That wouldn't have been true, but I would have said it anyway, because when -- I said, you know what, it would be great. I haven't seen Jennifer in a couple of years. She's so great and she did so well, and she's a big star here. And I helped her make it. I own the Miss Universe pageant. And I heard that she wouldn't introduce me. But I did. I know, but no -- but you did. So what happens is -- and you know what? She came tonight. She came. Came. She came. So they have the same filthy minds in Australia. . I was gonna refer to the -- explanation. No, but here's the beauty. When she found out about it, she got in that car and she got her ass over here and I love her. Can I just say one thing? I found out this morning, OK? There was miscommunication my management, but I'm sorry. I was so really bad. You know, I don't know too many women that are taller than me. I'm not taller. Look, look, look. I'm not taller. No you're not. Can I sit down now? Yes, go. You've embarrassed me. Thank you very much. She's great. Here's the thing. Get even with people in business. Because, if you don't, they will continue to go after you. And not even those people, but other people. And they're not necessarily teaching you this stuff in school, but this is things that I've learned over the years. You got to get even with people. Because even if you don't come into contact with them, everyone else knows you're a fighter and you're not going to take crap, and other people aren't going to take advantage of you. So I think it's really important, if somebody screws you screw them back in spades, and I really believe it's important whether you like it or not. Now, what you want to do is get out, work hard. You're in a great country. This country is a great country. I -- It really is. I have so many friends from Australia. A lot of them have like moved to New York but they always come back. I mean to them -- in a lot of countries they move to New York they don't want to come back to their country. Everybody from Australia when they go to New York they expect to come back. But I have so many friends from Australia. They love this country. It's a great country, it's a rich country. It's a really rich country and it's a beautiful country. And honestly, it's my great honor to be with this very beautiful full auditorium tonight. Was that good or bad? OK, I'm going to run through a couple of other points. Think big. Much easier. Think big. Focus on the positive. You know it's really important to focus on the positive. The word momentum is a word that you never hear in success talks, and it's a word that I felt to be very important. Some of you have great momentum going now. Play it. Others of you don't. Others of you it's over. And if it's over, know it's over. There's nothing wrong with it. But the word momentum, when you think of that, think of William Levitt. Just think about it. So, I just want to end by saying that I've enjoyed this. I've really enjoyed it. I'm going to come back. They want me back and we're going to be back again at some point in the not-too-distant future. But so much of success is seeing yourself as victorious. You have to see yourself. You have to really believe in yourself. And sometimes it's hard. You know you've had failures, you've had weaknesses, you've had other things. You have to see yourself as a one-man band. Don't rely too much on other people because they'll let you down. You have to see yourself as victorious. And to be a winner, you have to think like a winner. If you don't think like a winner, it's just never going to happen. And I have to tell you, it's a real honor. And even though the 22-hour trip is a little abnormally long, this is an amazing group of people and it's an amazing country, and I very much appreciate it. Thank you. Thank you. Thank you."}