{"id":524,"author":"Donald Trump","title":"Speech: Donald Trump Delivers a Speech in Nashua, NH","date":"2011-05-11","link":"https://factba.se/transcript/donald-trump-speech-nashua-nh-may-11-2011","paragraphs":["Thank you very much. It's a great honor to be here. And I have to tell you, this is sort of where it all started for me because, in 1989, a friend of mine -- a good friend of mine said, \"Would you do me a favor and come up to New Hampshire and make a speech?\" And I did, and it was really a speech in success and a motivational type speech to get people work in, and the nice part about New Hampshire, everybody works and we love workers and I think that's why I like New Hampshire, a lot of workers.","But I made this speech and I left and I came back to New York and I heard I was running for President, so that was the first time I heard about running for President for Donald Trump. And it was very interesting. But I will say that, all of my life, I've heard that very successful people cannot run for high office.","I've just heard it so many times. And, you know, it was interesting because nobody said it was going to be easy, but I had no idea I would get hammered like I'd been hammered over the last three or four weeks. It's -- it's actually I think a compliment. I'm not sure. I went, as an example, to the Washington Speakers Bureau where -- a dinner in Washington and it was very interesting.","The Washington Correspondents' dinner was packed with people. It was an amazing event actually. I'd been there before, so I knew what I was getting into, sort of the lion's den. But the President got up and very respectfully said things and he said a lot about me and they were jokes. He had a picture of the White House with the Trump on top of it and some other things and it was very nice.","There was a comedian that got up and he started talking about me. I looked at my wife, I said, \"Is this a good thing or a bad thing? Am I supposed to be honored or am I supposed to hide under the table?\" I wasn't exact -- so I sort of just sat there and listened and took it in. But it was actually a little bit amazing.","And I will say that it's been an amazing period of time for me because I'm not a professional politician, which I think is possibly an asset, other than our great Mayor who is a great, great leader, right? But I think that's actually turned out to be largely an asset according to a lot of people. And, you know, I -- I took on the President, I was very, very strong in saying, \"Put up your birth certificate.\" I was very strong on it. Now, whether I was right in doing that or wrong in doing that, I don't care.","I mean, why not show it? And why did it take so long? And I was honored that I was able to get him to do it. And I guess he will continue and that whole debate will rage and everything else. But my big thing, and it always has been from day one, has been jobs. It's been jobs, it's been the economy. I built a great business -- a really great business.","I built it over a period of years. It's doing unbelievably well in bad times. We've made a lot of good decisions. A lot of decisions that have been really terrific, and I love doing what I'm doing. I have to be honest. I mean, I hate getting out of that business and doing something else. But our country is in serious, serious trouble like it's never been before.","The kind of numbers we're hearing today are so unbelievable. They're so incredible in size. You know, three or four years ago, you never heard the word -- I don't know if you can agree with me on this. You never heard the word trillion -- trillion. And now, everything's trillion: deficits, debt, budgets.","It's trillion, with trillions of dollars in the hole. And a lot of people don't see how to get out of it. And, you know, my businesses can be good, but my businesses won't be good if this country is going to be going down, down, down, and it's got a very big shot at doing that. And I am a very no tax person.","But I can tell you, if President Obama gets re-elected, I think your taxes are going to go through the roof. And I do believe that he's holding them down now as long as he can because he wants to get through this election. But I said it before, I met with a great group of folks and some of the real community leaders, and we had a very frank discussion.","And I said, \"Look, if he gets in office, I believe -- I honestly believe that your taxes are going to go to a level that they haven't been at in a long time.\" And that's not going to be good for this country. That's not going to be good for business. It's not going to be good for New Hampshire. It's going to be good for no one.","So we have a real problem. And the problem that we also have is we don't use our best people. You know negotiation is an art. And I've seen it over many years. I know the guys in New York, I know the good ones, I know the bad ones. I can practically tell you who does the good deals, who does the bad deals.","The fact is it's an absolute art and we're not using our right people. As an example, and I say it all the time, China, this year, is going to make $300 billion off of this country. Call it profit. But beyond that, they're taking our jobs because they're making our product. So they make our product, they take our jobs, they do it through manipulation of their currency, very simply, and then the President of China comes to the United States and we hold a beautiful evening at the White House for him.","In other words, we honor a man that's taken advantage of this country. Now, I don't blame him because if you can get away with it, why not do it? So they then go out and buy our debt and we pay them interest. I mean, the whole thing is unbelievable. You look at what OPEC is doing to us. These folks sit around the table.","You probably saw last week, Saudi Arabia said, \"There's a lot of oil out there. We're cutting production, so we're going to cut it back.\" And they cut back production because they want to keep the prices high. And we don't have anybody that says, \"That's not going to happen, folks. That's not going to happen.","You're not doing it anymore.\" You know, we protect them. They pay us virtually nothing. We protect so many countries. We protect South Korea. I ordered 4,000 television sets last year for hotels and different things. And by the way, I heard this hotel's in trouble. I love things that are in trouble. That's when I like to buy.","I love it. Thank you for telling me, Chris. You're the broker, Chris, wherever you are. No, I'm only kidding. Actually, the food is very good. Although, I'm not kidding actually. Am I? I'm not kidding about that. Anyway, it's a nice hotel. In fact, I'm going to take a tour of the hotel later if you want to know the truth.","As opposed to saying hello to political leaders, I'm going to tour the hotel. I'm more used to doing that. But you look at what OPEC's doing to this country. And I always say, the worst abuser of the United States, and the word abuse is the right word to use, is OPEC. The second worst abuser is China. And then there are many countries after that.","And l -- as an example, Colombia, the fourth largest country in Latin America. They made last year on the United States four billion dollars. This isn't a huge country. We don't even do that much business with them. They made four billion dollars. It's like, what's going on? What are we doing? And we're now signing a new trade pact that I don't think, just in reviewing it, is going to be as good as the old one.","So you wonder, where is this thinking come from? How does that happen? And then you look at the deficits, and I have to say, I'm a very proud Republican. I'm very proud of our ideals, at least most of them. And I -- I look at a plan that was put forward, and I like Paul Ryan very much. But the plan that was put forward was early.","There was no reason to put a plan forward where they're even talking about touching Medicare at this point. There's no reason for it. So Medicare and Medicaid, all of a sudden, come in and it's put in by the Republicans. And you've got elections to win. The Republicans have elections to win. And the Democrats, you talk about demagogue.","The Democrats are doing a number on that plan like I've never seen. So in upstate New York, we lost a congressman who decided to go on whatever it was and show what kind of a great body he had. You know all about that. And he was looking for people on the Internet, and they caught him and they throw him out.","He should be thrown out. Do we all agree? Yes. So a very popular Republican woman is running for the office. She was expected to win easily. Republican area, easy like crazy. Well, the other day in front page of a major newspaper, there's a story that she may not win because she's having a hard time defending that whole situation with Medicare.","Now, the President -- I'm talking about negotiation, The Art of the Deal, one of the great business books of all time, right? Everybody erratic. You know, it's funny. It is the biggest selling or at least one, but I think the biggest selling business book of all time. And every time I mention it, people do applaud.","They love that book. A lot of people told me they got their start by reading that book. You know, whatever. But call it The Art of the Deal. You got to let him go first. He's supposed to be the leader. Let him put up a plan. Let him come in and put up the plan. And then you can use your debt limits and you can use all sorts of things to do what you have to do. When you look at what happened recently where they thought it was going to be 38 billion and it was 300 million in savings and the whole big thing.","There are so many things going on and I'm just saying, \"What is happening -- what is happening to this country?\" We have a chance to be great again. And honestly, right now, the way we're doing, we're a debtor nation. I mean, think of it. I saw recently a report. We are spending two billion dollars so Brazil -- Brazil can drill for oil.","Why aren't we drilling for oil? Why aren't we drilling for oil in this country? A friend of mine who's doing pretty well and not a real rich guy, but a guy who wa -- he's always wanted to do this. He bought an airplane or is buying it. And I said, \"What kind of a plane is it?\" He tells me the name of the plane.","Where is it made? \"Brazil.\" I said, \"Why in Brazil?\" He said, \"Because I get a $1.2 million tax credit than the United States if I buy this plane.\" And I'm saying, \"What is going on?\" So we don't use our right people. Now, I know Wall Street very well. I know all of the killers, I know all of the guys that are the smartest guys, I know the ones that aren't as smart, I know sort of all of them.","And why aren't we -- when we negotiate against China, against South Korea, against all of these countries, why aren't we using our smartest, greatest business people who, by the way, I'd put them against anybody. We have the best. I'd put them against anybody. But instead, we use a diplomat. And as I've said, a diplomat.","You know what a diplomat is? That's a person that studies how to be nice. I don't want a nice person. And that's why I may not make it in terms of getting -- I'm not that nice a person. But I'll tell you what, I'd make this country great again, that I can tell you. Now, we had a great victory last week with the killing of bin Laden.","That was great. An enhanced interrogation really led us to that. Now, enhanced interrogation, another thing. You know, we're so politically correct, and nobody wants to say it. Nobody ever wants to use the word. Isn't another word for that torture? And you know what, the people that I watched jumped off the World Trade Center.","That was torture. OK. So we catch this guy. They shoot him. Then they clean his body, they give him a religious ceremony. They take 45 minutes, they ta -- why? I don't understand it. OK. I don't understand it. And in terms of torture, in terms of enhanced interrogation, we wouldn't have caught bin Laden without it. That's what got us to him.","And we're -- right now, as you know, they're under investigation, numerous people that used enhanced interrogation, to use the nicer term, after September 11th. And I think those people should not be under the kind of gun that they're under. I don't think so at all. Now, one of the things that was recently found out is that bin Laden's plan, and one of his plans, and he had many of them, was to bankrupt what was the former Soviet Union, which he succeeded in doing and hence it broke up, and now it's called Russia, smaller version, very powerful, smaller version.","But that war bankrupted Russia. He wanted -- he want -- and he wanted to bankrupt the United States. Now we're spending $10 billion a month -- $10 billion on building schools, on all of the other things that we're doing in Afghanistan, and for what? What are we doing? And I heard something the other day that I have to really -- we're going to do a little research, you're all going to do this research.","While we're fighting in Afghanistan, I heard that they have tremendous mineral resources in Afghanistan. I always thought, you know, I look at the oil, I look at Iraq, I look at the different countries and I see things, but tremendous mineral resources. And you know who's in there trying to get them? China.","While we're out there fighting, spending billions and billions and billions of money, nobody knows how much money we're spending. Nobody knows. But we're spending billions of dollars on fighting. China is out there trying to get its foot to get the minerals in Afghanistan. I mean, think of that. But we can't build schools in our own cities.","We can't build roads in our own cities. I've been to China numerous times, and I see bridges going up and I see airports going up like you wouldn't believe. When was the last time you saw a major bridge being built in the United States? It doesn't happen. First of all, you can't get the environmental approvals.","It's impossible. You know, when I was over there was very interesting. A friend of mine from China. Hey, I respect what they do. If they can take advantage of our leaders, you know, I have great respect for that if they can do it. But they're filling in a big chunk of the ocean. I'm saying to myself . I said to my friend, \"How long did it take you to get your environmental permits?\" He looked at me, goes why?","What are you talking? He said, \"Donald, it's the ocean.\" You know, they're filling in about a quarter mile by a quarter mile. They're going to build a big complex, a huge thing, and they actually fill in parts of the ocean to build a city. You know that. They build new cities over there like in about 12 minutes, they say, \"We want a city over there.\" They start work the next day.","Mayor, it's a little different than what we do, right? But I know -- and I've gotten many environmental awards, so I don't want to sound like this guy that's , I'm totally into fairness, but I've seen jobs that we're going to employ thousands and thousands of people stopped because of a blade of grass that happens to be a unique blade of grass.","I've seen them stopped over a certain type of fish, over this and that, and I deal with environmental consultants all the time. And I look at them and I say, \"You know, that's horrible -- that's horrible.\" I mean, they're going to stop progress. Isn't that horrible? He goes, \"Actually, Donald, it's not horrible for me because I'm making a fortune and you're paying me a fortune and so is everybody else.\" And these guys actually go up to Albany, in the case of New York, and they make the restrictions harder, the consultants that are working for you, so that you have to hire them to get you through this horrible situation.","And in many cases, you can't get through. And if you're not rich, you can't get through at all because you can't go through the process. I mean, I could tell you job after job after job. And it's like even the drilling of oil where Abu Dhabi recently -- and they have so much energy, they have such resources.","They went out and they announced that they were going to have all of their transportation needs done in gas, OK? Because they just -- they wanted natural gas. That's it. Because they're going to sell the oil to the United States and other places. And yet, we're the king of natural gas. We have more natural gas than anybody.","Coal, natural gas. I mean, wind is limited, honestly. Solar really hasn't been perfected and it's very expensive. I know them all. You know, I go and I build a building and I say, \"I want to use solar. I want to use solar.\" And I'm good at dollars. So I looked, they come back, and the solar, they said, \"Yes, that will take you approximately 22 years -- 22-year payback.\" I said, \"That's not so good.\" Maybe I won't use solar.","It hasn't been perfected and it's going to get better. But we have tremendous -- we're the king of -- of coal, we're the -- the all time of natural gas, we don't use it. And then you hear a country like Abu Dhabi using natural gas so they can sell their oil. And it's just incredible to me. I look at what's going on. I look at Pakistan, not our friend.","And I have to say, if you look at Bill O'Reilly from a few weeks ago, if you look at Neil Cavuto from not so long ago, I said, \"Osama bin Laden is in Pakistan.\" And some of you probably heard this, and I was very loud and clear. We give Pakistan billions and billions of dollars a year. We're going to give them 3.2 billion, I think they're asking for now and even more.","And I said, \"Listen, I understand something about that. You tell them that we're not giving them\", this is on two shows little while ago, long before the event took place last week. \"You tell them we're not giving you any money unless you hand over to us Osama bin Laden.\" And everybody looked at me like . Nobody else picked it up. You know, it's amazing.","I make these statements and no politician picks them up, so obviously, they're not very good statements, I guess. But they never get picked up. And, you know, when they are good, it's interesting because I have another one. But when they are good, they pick them up and they don't give me credit. That's what I hate about politics, Mayor.","You know, when I buy a piece of real estate, I own it. OK? But, you know, when you come up with a good idea in politics, if they like it, they take it, they don't, you know, they say, \"I have an idea.\" And, you know, by that time, most people forgot it was Trump's idea. So Trump doesn't get any credit, and I love to get credit.","I love -- I love to get credit. But I said, right on their television -- you could look over the last number of weeks, those two shows. Let them give us this guy. Now, if anybody thinks that they didn't know that he was there when they have a sophisticated ma -- somebody said many times the size of West Point, that he wasn't sitting in this big house.","I didn't think it was particularly beautiful, but, you know. They made it like this incredible mansion. Does anybody in the audience want to live in that mansion? I don't think so. But if anybody thinks that Pakistan, that the government didn't know that he was there, they're foolish, OK? They're very foolish.","So they're not really our friend and they're not really our enemy. But now I say differently, and I think this is very important, because the bad guys could take over Pakistan very easily, very quickly. It could happen very quickly. We wouldn't even know what's going on. They have nuclear weapons. They desperately need our money.","We don't give them any money unless they get rid of their nuclear weapons. Now, to me, that's so simple. So I hope it does get picked up by some of the other people. But for us to be giving them money -- they go out -- by the way, they take our money, they use it for nuclear. They also use it for themselves, by the way, I guarantee you that.","But they go out and they use that money for nuclear weapons. And you know what, let's say, right now, they are semi-friendly, but they may not be at all friendly. They may be tremendously against us soon, including Israel. Because if that happens, Israel's in big, big trouble. They have serious nuclear weapons.","But they seriously need our money. And that's a deal that I would make and I wouldn't -- I wouldn't veer from it because you can not let them have those nuclear weapons. Another one I gave that some people did pick up and some people love it and some people think, \"But it's a sovereign nation\", Iraq. We go into Iraq.","We've spent $1.5 trillion. We've lost thousands of great young men and women. We have tens of thousands of people that are incredible people that are horribly wounded with legs and arms missing and just horribly wounded all over the cities -- all over the cities. I see it in New York. I see it all over. And we go in, we fight, and we leave.","Somebody said, \"Democracy.\" Give me a break. As soon as we leave, Iran is going to take over Iraq. We've decapitated their armies. It's going to happen. They're already planning it. I've heard that they're closer to the leaders of Iraq than we are. OK? Than our people are. And I'm not surprised to hear it. Iran is very cunning and very smart.","So they say they've been fighting for years and years. You know, for years, they were about equal. They moved two feet, they moved back two feet, back, back. The war's over, they go back, and for 20 more years, they don't fight. Right? And there's fight again. But now what we've done is we've decapitated one of those countries, so Iran will go in. But here's what they're going to go in for.","Sure, they want the country, sort of. What they really want is the oil. You know that Iraq has the second largest oil reserves in the world, $15 trillion. Interestingly, Mayor, that's very close to our -- our deficit, right? Isn't that interesting? Amazing number. So I've said to people, \"What is this?\" You know, maybe I'm old fashioned.","I say, we're in there -- and -- and I have friends and they're really good people and they're smart people and they're -- and they're -- some of them are very liberal, some are conservative. But a lot of them say, \"Donald, are you suggesting we take the oil? That's a sovereign nation.\" I say, \"Excuse me?\" And it's amazing.","Now, some people love it. I would say they're the smart ones. Because when we went into Iraq, if you remember, when we went into Iraq, a lot of the so-called smart ones were saying, \"Don't worry about -- we only went in for the oil.\" We didn't. We weren't smart. We didn't know what we were doing. We went in what -- for what?","He didn't knock down the World Trade Center. In all fairness, you like Saddam Hussein, you don't like Saddam. It doesn't make any difference. He did not knock down the World Trade Center, had nothing to do with it. And frankly, what he did do is kill terrorists. You could not be a terrorist in Iraq. He would kill you.","No trials, no nothing. He would kill you if you were a terrorist. Now, Iraq is the Harvard of terrorism. You want to be a terrorist? You go to Iraq. Everybody says that. You want to be a terrorist. Iraq is great. Afghanistan is pretty good too, right below. And I'm saying, \"What are we doing?\" So we've got our army over there, then somebody said, \"We don't want to stay longer.\" You know the kind of money we're talking about?","So they have $15 trillion worth of oil. We've spent 1.5 trillion. I say this, at a minimum, we get our money back and we pay each one of the families of those soldiers that died a couple of million dollars and we give our badly wounded and not wounded a lot of money. It's peanuts. You're talking about peanuts compared to what the numbers are in this incredible oil reserve, incredible.","And we pay those families back. Now, people say to me, you can't do that because of the sovereignty of the nation. But let me ask you this. When the families of those fallen soldiers are sitting home watching television in couple of years from now after we're gone, because they're not going to go when we're there.","But, you know, we have an appetite to get out, then we're never going to go back because we don't have that stomach. When the families of those great soldiers are sitting home a couple of years from now, when Iran goes in and takes over Iraq and takes over the oil and tells everybody how stupid the United States is, which is absolutely going to happen and they'd be right.","How do you think the parents of that 22 year old soldier -- how do you think the parents are going to feel about that? Because those soldiers will have died in vain. And again, all of the wounded, all of the money. What a terrible, terrible situation. Now, just like I said, because I've made a lot of good predictions.","You know, I had a book and I made a lot of predictions in the book and a lot of them came true. I said terrorism is going to happen, I said you can have a market crash. I don't know. I'm not saying I'm a great psychic, but I have a good instinct for things. And I think most good business people do. That's why, you know, we're a little bit ahead of the curve in a lot of ways.","But I have an instinct for things. And I said terrorism's going to be a big factor. And people sort of didn't know too much about what terrorism was then because that was 10 or 11 years ago. I say we're gong to have a great crash, and we really did have a great crash, that was a great crash. And we could have a second great crash.","If gasoline doesn't go down substantially, we've got to have a second crash. If oil stays at over $100, which I think it's going to for a while and it could go a lot higher, we could have a real, real problem and we could have a real second dip as they call it. So I know how to deal with OPEC. I know how to deal with China.","By the way, I had some of the smartest Chinese. I made a deal with them. I made a lot of money. I'm very proud of myself. I made a lot of money. And you got to know how to deal with these people. They're smart, they are cunning, and they are not our friends. Remember that. They are not our friends at all.","So I'm thinking about running. I must be honest, it's tough because I'm very anti-establishment. That even includes the Republicans, you know. Like, for instance, I tell you, I have great respect for Paul Ryan, but I would not have done it the way he did it, too early, too soon. There was no reason for him to do it. Let the other guy lead it in and then you go and do your number, and you get something that's going to make the country great again.","But I'm very anti-establishment. And I see even the Republicans taking shot. What's to take a shot at? What really -- now, there'll be people on television, they'll say bad things about me. But what really that I said today can people take a shot at? I want to take care of our fallen soldiers. I want to take care of our people.","I want the oil. I want reimbursement to us, and by the way, to the other countries that helped us like Britain and other countries. I want to take advantage of -- I really want to take advantage of a situation when we're there. Once we leave, we can't. But what -- when you think about it, what's controversial?","So I go back and I'm a Republican and I'm doing nicely. You know, I haven't done anything, in all fairness, I haven't even announced whether or not I'm running. And I think even the Republicans don't like it because I'm not in the club. I'm not in that club. You can't be in that club. And that club is not what's going to make us, in my opinion, a great country again.","We have tremendous potential, tremendous, unbelievable potential if we had the right people, if we knew what we were doing. We cannot let China drain us. We cannot let OPEC drain us. We cannot let South Korea drain us. When I ordered the 4,000 televisions, I said, \"Find an American company. I want to find an American company that makes them.\" We have the greatest people.","Nobody could do it. They can't find a company. Yeah, they had little companies that made a couple of -- I need 4,000 televisions. It's a lot of televisions. So we got LG from South Korea. And it's interesting because, you know, South Korea, we have thousands of soldiers in between North and South Korea. And you know what happened.","We're all set to sign this agreement and they said, \"No, no, no, we don't want it.\" Now, Barron Trump, who's my four year old son, would not have agreed to that agreement for the United States. That's how bad the agreement is. But South Korea, it wasn't good enough for them, so they embarrass the President by not signing when they were supposed to. But a couple of days later, some bombs started getting lobbed over to South Korea by North Korea, and we sent this magnificent aircraft carrier, the George Washington, like incredible, and 17 destroyers and boats and like an armada, just to turn on the engine is probably 2,000 bucks, OK? Two million dollars.","So we're sending this big armada over there, costing a fortune. And North Korea said, \"OK, look, we don't want to mess around. We'll stop. We'll stop bombing them.\" But South Korea said, \"But we want to sign the agreement. It's a wonderful agreement for all. You're our ally, you're our great friend.\" I mean, how stupid are we? They wouldn't do it, all of a sudden, as soon as the bombs got lofted, \"Please, send it over here, we want to sign it immediately.","Who's going to notarize the agreement for me, OK?\" So we have to use our heads. South Korea makes a fortune -- a fortune selling us televisions and lots of other things. They have to pay us a lot of money for protection. They have to pay us. We can't protect them. What are we protecting them for? So they can make money on the United States.","Now, unfortunately, a politician is not going to say what I'm saying because I guess it doesn't work, probably it doesn't work. I don't know why. And by the way, if you spoke to South Korea, you're not going to be enemies. They're actually going to respect you more. They're going to say, \"Finally, they got smart.\" They're going to actually have more respect.","You ever see that a lot of great business people in the room where when you're firm and tough with somebody, you actually develop a better relationship with them because they respect you. Whereas, when they make a lot more money because you're stupid, they don't respect you. You don't have as good a relationship.","Right now, they don't respect this country. They don't respect our leaders. They don't respect what we're doing. And right now, this country is going to be going over a cliff. Now, just in closing, and I think we're going to take a couple of questions, but in closing, I want to say and I think it's very important.","I honestly believe that the upcoming election, if not the, is one of the most important elections ever in this country's history. We have a chance to be great. We have a chance to be an unbelievable power again. And I'm talking about from an economic standpoint. I don't want China in Afghanistan. Why isn't China helping with Libya?","You know who gets a lot of their oil from Libya? Not the United States. We get nothing. China. Why aren't they involved? We don't have the right leaders. They don't see it. Now, if I run and if I win, and that's a big if, this country will be great again, this country will be rich again, and maybe most importantly of all, this country will be respected again.","And thank you very much. It's a great honor to be here. Thank you. Thank you.","Thank you.","Thank you.","Make them nice and easy, please.","Thank you.","Rug business, right?","Good negotiator. I'll let him negotiate against China. It's true. Those rug guys, they can negotiate. OK.","Go ahead, Sy. I know you, Sy. Go ahead.","Well, it's a great question and a lot of towns are having -- whether it's Walmart or some of the other big ones and that's probably what you're referring to, they're coming in and they have these massive stores, and, you know, it's a whole different thing and it's a changing time, and it is changing times, and a lot of towns are knocking them out.","I would say this, in all fairness, if the economy were good, and it's not great in New Hampshire at all and it's not great almost anywhere. You know where it's good? It's a good in Washington. I have this big club in Washington, and it's doing great. You know why? Because everybody's moving to Washington because Washington is sort of running everything and they own everything, and that's the exact opposite of what we want.","If -- Sy, if this economy were raging again, you would do so great because guys like me and plenty of others in this room will be going to your store, we're not going to wherever else it may be. But there's room for everybody -- everybody. So if we could get this economy going again, if we could get jobs back instead of having them going to India and having them go -- I mean, Mexico.","There's a place called Newton, Iowa where Maytag was given a huge incentive to move out of Newton, Iowa, and that was the big employer, and they moved to Mexico with our incentive. And now, Newton is devastated. Just absolutely devastated. And this was years ago and they haven't come back. If we could use the right brain power, you would have so much business and so would everyone else because you hate to restrict these big companies from coming in. I think even you would agree to that.","So -- and I've seen plenty of towns do it and they end up getting hurt in a different way -- in a much different way. But if we could make our country strong again economically, we're just teetering along and it's going to start getting worse and worse because of what's happening with fuel and other things.","And remember this, we have no interest rate. I went to a bank the other day, they don't want to -- if you have CD's, they don't give you anything. And you know what, if you want to borrow money today, if you're super prime, you can borrow whatever you want and pay almost nothing. Problem is if you want to buy a house, they won't give you any money for a house.","The people in this community never -- you go to the banks and it's very, very hard. Don't worry, I'm talking about the big banks. I'm not talking about you. Your -- your bank is wonderful. But, you know, they've taken this -- they've taken these tremendous subsidies -- tremendous subsidies from the government, and now what they're doing is sitting on them and then not loaning money for those.","And that's one of the big problems with us. Now, the real problem is what's going with gasoline in terms of bringing the world back -- in terms of bringing our world back, which is the United States. And eventually, interest rates are going to have to go up because the dollar is being decimated. And if you look at your food costs, look at the cost of cotton, that blows away gasoline.","But if you look at your food costs, if you look at your clothing cost, and if you look at your gasoline costs, it -- they're setting records. And a lot of that is because of the decimation of the dollar. So we have to get a strong dollar back. We have to get the country going again. And you, Sy, and everybody else going to make a lot of money.","OK? Thank you.","Hi. Thank you.","Well, thank you very much. Thank you. I do respect it greatly.","OK. It's a very fair question. And she's a comedian. First of all, I do -- I hope I am a nice guy, and I say that. But I hope I am a nice guy","Yes, go ahead.","OK. I -- I thought she was talking about candidates, I'm trying to figure out which ones. Well, that's right, the Celebrity Apprentice. That's right. Thank you. It's very funny. Do we have two of them named John? OK. Number one, I hope I am a nice guy. But when I say nice, we don't have much room for big negotiation.","We've given that up over the last 10 years -- 12 years -- 15 years. We have to do it right. And the problem that we do have is there has been so much compro -- let's compromise, let's compromise, let's do this, let's do that. And in the end, we have so much debt. We have more debt than ever, you add it all up in the history of the country.","We have more now than all of it added up together. So we need not compromise. We need smart people and we need good people. And maybe we need lame duck people. Maybe people are going to say, you know what, we have to do the right thing for this country. And we have to do it. And if it's popular, if it's not popular, whatever it may be that it is to get this whole thing in order.","Because if we don't get it in order, this country is going over a cliff. And, you know, they were comparing it to Greece and they were comparing us to lots of other countries that you've been reading about, and I was watching on one of the shows the other day and they were saying, actually, we're in worse shape proportionately than some of these countries that we're reading about all the time.","And it's true. 40 cents out of every dollar goes to pay interest to China and to other places that are making a fortune on us. So we really -- I think compromise is a great thing and I've made plenty of compromises all my life. But I think we're beyond compromise. We have to make -- we have to do what's right for the country.","And if we don't do it, we're not going to have much of a country left. OK. Thank you, it's a great question. Thank you.","OK.","Well, I do actually. I do have a lot of strategies for new jobs. We have to take our manufacturing back from China and many other places that are doing it. It's really easy. You know, I toured -- I toured -- two weeks ago, I toured New Hampshire and we had a great time. And I have never seen -- we had some companies that I looked at that were absolutely unbelievable, the -- the -- the level of detail, the -- the technology, the whole thing.","These are great manufacturing companies. I was so proud. I almost didn't think we had this anymore in this country. We have some great, great people in this country. But when China manipulates their currency, so they take jobs out of New Hampshire and New England, and you look at what's happened in New England, generally, where NAFTA with everyone going down to Mexico.","I mean, I see plants that are empty and they're -- they are thriving over in Mexico. And do you think these people want to be in Mexico? The fact is we have to manufacture our own product. We have to. We have to start manufacturing again. We have to, by the way, get rid of Obamacare. It's a disaster. If we don't get rid of Obamacare -- I have six friends who are in business, modest-sized businesses, good businesses.","Of the six, two are going to close their business. Another two are thinking about it because they're saying, \"We can't afford Obamacare. We can't afford the health care. We can't do it.\" And these are good guys. These are guys that employ a lot of people. They have really good companies, mid-sized companies.","They're fantastic people. And they're thinking about closing. I never heard them even mention that word and I've known them for -- two of them went to Wharton -- a couple of them went to Wharton with me, the Wharton School of Finance. I never even heard this. We have to get rid of Obamacare. And one other thing, I really think the President is doing this country a tremendous disservice just like he should have given his birth certificate years ago instead of making everyone wait.","And believe it or not, I'm very proud of what I did, getting him to finally produce it. Believe me. But it's sort of the same thing. We're going through all these court systems, you're reading about it today. They're in Virginia, they're all over the place. Why doesn't he allow it just to go to the Supreme Court?","You'll save a year and maybe more than a year. And I have -- I know people that are going absolutely crazy with their business because they're doing this very, very, very complicated restructuring on the assumption that Obamacare happens, and if it doesn't happen, they've got to go all the way back, and this is thousands and millions of businesses in this country.","Why don't the various legal entities involved, headed by the President, in all fairness. Why doesn't he let his people go directly to the Supreme Court? Win or lose. But at least they'll be certain. You know, business -- when I talk about business, there's a word that's very important, it's called certainty -- certainty.","You need certainty. And at least this way, we'll get a faster decision because, ultimately, those people on the Supreme Court are going to be ruling on Obamacare, and they may approve it and they may not. But wouldn't it be good if we knew what was going to happen instead of waiting a year and a half, maybe two years, and nobody knows what's going to happen.","Certainty. It's been an honor to be with you. This has been a lot of fun and thank you all very much. Thank you. Thank you. Thank you."],"text":" Men who died in combat. Thank you very much. It's a great honor to be here. And I have to tell you, this is sort of where it all started for me because, in 1989, a friend of mine -- a good friend of mine said, \"Would you do me a favor and come up to New Hampshire and make a speech?\" And I did, and it was really a speech in success and a motivational type speech to get people work in, and the nice part about New Hampshire, everybody works and we love workers and I think that's why I like New Hampshire, a lot of workers. But I made this speech and I left and I came back to New York and I heard I was running for President, so that was the first time I heard about running for President for Donald Trump. And it was very interesting. But I will say that, all of my life, I've heard that very successful people cannot run for high office. I've just heard it so many times. And, you know, it was interesting because nobody said it was going to be easy, but I had no idea I would get hammered like I'd been hammered over the last three or four weeks. It's -- it's actually I think a compliment. I'm not sure. I went, as an example, to the Washington Speakers Bureau where -- a dinner in Washington and it was very interesting. The Washington Correspondents' dinner was packed with people. It was an amazing event actually. I'd been there before, so I knew what I was getting into, sort of the lion's den. But the President got up and very respectfully said things and he said a lot about me and they were jokes. He had a picture of the White House with the Trump on top of it and some other things and it was very nice. There was a comedian that got up and he started talking about me. I looked at my wife, I said, \"Is this a good thing or a bad thing? Am I supposed to be honored or am I supposed to hide under the table?\" I wasn't exact -- so I sort of just sat there and listened and took it in. But it was actually a little bit amazing. And I will say that it's been an amazing period of time for me because I'm not a professional politician, which I think is possibly an asset, other than our great Mayor who is a great, great leader, right? But I think that's actually turned out to be largely an asset according to a lot of people. And, you know, I -- I took on the President, I was very, very strong in saying, \"Put up your birth certificate.\" I was very strong on it. Now, whether I was right in doing that or wrong in doing that, I don't care. I mean, why not show it? And why did it take so long? And I was honored that I was able to get him to do it. And I guess he will continue and that whole debate will rage and everything else. But my big thing, and it always has been from day one, has been jobs. It's been jobs, it's been the economy. I built a great business -- a really great business. I built it over a period of years. It's doing unbelievably well in bad times. We've made a lot of good decisions. A lot of decisions that have been really terrific, and I love doing what I'm doing. I have to be honest. I mean, I hate getting out of that business and doing something else. But our country is in serious, serious trouble like it's never been before. The kind of numbers we're hearing today are so unbelievable. They're so incredible in size. You know, three or four years ago, you never heard the word -- I don't know if you can agree with me on this. You never heard the word trillion -- trillion. And now, everything's trillion: deficits, debt, budgets. It's trillion, with trillions of dollars in the hole. And a lot of people don't see how to get out of it. And, you know, my businesses can be good, but my businesses won't be good if this country is going to be going down, down, down, and it's got a very big shot at doing that. And I am a very no tax person. But I can tell you, if President Obama gets re-elected, I think your taxes are going to go through the roof. And I do believe that he's holding them down now as long as he can because he wants to get through this election. But I said it before, I met with a great group of folks and some of the real community leaders, and we had a very frank discussion. And I said, \"Look, if he gets in office, I believe -- I honestly believe that your taxes are going to go to a level that they haven't been at in a long time.\" And that's not going to be good for this country. That's not going to be good for business. It's not going to be good for New Hampshire. It's going to be good for no one. So we have a real problem. And the problem that we also have is we don't use our best people. You know negotiation is an art. And I've seen it over many years. I know the guys in New York, I know the good ones, I know the bad ones. I can practically tell you who does the good deals, who does the bad deals. The fact is it's an absolute art and we're not using our right people. As an example, and I say it all the time, China, this year, is going to make $300 billion off of this country. Call it profit. But beyond that, they're taking our jobs because they're making our product. So they make our product, they take our jobs, they do it through manipulation of their currency, very simply, and then the President of China comes to the United States and we hold a beautiful evening at the White House for him. In other words, we honor a man that's taken advantage of this country. Now, I don't blame him because if you can get away with it, why not do it? So they then go out and buy our debt and we pay them interest. I mean, the whole thing is unbelievable. You look at what OPEC is doing to us. These folks sit around the table. You probably saw last week, Saudi Arabia said, \"There's a lot of oil out there. We're cutting production, so we're going to cut it back.\" And they cut back production because they want to keep the prices high. And we don't have anybody that says, \"That's not going to happen, folks. That's not going to happen. You're not doing it anymore.\" You know, we protect them. They pay us virtually nothing. We protect so many countries. We protect South Korea. I ordered 4,000 television sets last year for hotels and different things. And by the way, I heard this hotel's in trouble. I love things that are in trouble. That's when I like to buy. I love it. Thank you for telling me, Chris. You're the broker, Chris, wherever you are. No, I'm only kidding. Actually, the food is very good. Although, I'm not kidding actually. Am I? I'm not kidding about that. Anyway, it's a nice hotel. In fact, I'm going to take a tour of the hotel later if you want to know the truth. As opposed to saying hello to political leaders, I'm going to tour the hotel. I'm more used to doing that. But you look at what OPEC's doing to this country. And I always say, the worst abuser of the United States, and the word abuse is the right word to use, is OPEC. The second worst abuser is China. And then there are many countries after that. And l -- as an example, Colombia, the fourth largest country in Latin America. They made last year on the United States four billion dollars. This isn't a huge country. We don't even do that much business with them. They made four billion dollars. It's like, what's going on? What are we doing? And we're now signing a new trade pact that I don't think, just in reviewing it, is going to be as good as the old one. So you wonder, where is this thinking come from? How does that happen? And then you look at the deficits, and I have to say, I'm a very proud Republican. I'm very proud of our ideals, at least most of them. And I -- I look at a plan that was put forward, and I like Paul Ryan very much. But the plan that was put forward was early. There was no reason to put a plan forward where they're even talking about touching Medicare at this point. There's no reason for it. So Medicare and Medicaid, all of a sudden, come in and it's put in by the Republicans. And you've got elections to win. The Republicans have elections to win. And the Democrats, you talk about demagogue. The Democrats are doing a number on that plan like I've never seen. So in upstate New York, we lost a congressman who decided to go on whatever it was and show what kind of a great body he had. You know all about that. And he was looking for people on the Internet, and they caught him and they throw him out. He should be thrown out. Do we all agree? Yes. So a very popular Republican woman is running for the office. She was expected to win easily. Republican area, easy like crazy. Well, the other day in front page of a major newspaper, there's a story that she may not win because she's having a hard time defending that whole situation with Medicare. Now, the President -- I'm talking about negotiation, The Art of the Deal, one of the great business books of all time, right? Everybody erratic. You know, it's funny. It is the biggest selling or at least one, but I think the biggest selling business book of all time. And every time I mention it, people do applaud. They love that book. A lot of people told me they got their start by reading that book. You know, whatever. But call it The Art of the Deal. You got to let him go first. He's supposed to be the leader. Let him put up a plan. Let him come in and put up the plan. And then you can use your debt limits and you can use all sorts of things to do what you have to do. When you look at what happened recently where they thought it was going to be 38 billion and it was 300 million in savings and the whole big thing. There are so many things going on and I'm just saying, \"What is happening -- what is happening to this country?\" We have a chance to be great again. And honestly, right now, the way we're doing, we're a debtor nation. I mean, think of it. I saw recently a report. We are spending two billion dollars so Brazil -- Brazil can drill for oil. Why aren't we drilling for oil? Why aren't we drilling for oil in this country? A friend of mine who's doing pretty well and not a real rich guy, but a guy who wa -- he's always wanted to do this. He bought an airplane or is buying it. And I said, \"What kind of a plane is it?\" He tells me the name of the plane. Where is it made? \"Brazil.\" I said, \"Why in Brazil?\" He said, \"Because I get a $1.2 million tax credit than the United States if I buy this plane.\" And I'm saying, \"What is going on?\" So we don't use our right people. Now, I know Wall Street very well. I know all of the killers, I know all of the guys that are the smartest guys, I know the ones that aren't as smart, I know sort of all of them. And why aren't we -- when we negotiate against China, against South Korea, against all of these countries, why aren't we using our smartest, greatest business people who, by the way, I'd put them against anybody. We have the best. I'd put them against anybody. But instead, we use a diplomat. And as I've said, a diplomat. You know what a diplomat is? That's a person that studies how to be nice. I don't want a nice person. And that's why I may not make it in terms of getting -- I'm not that nice a person. But I'll tell you what, I'd make this country great again, that I can tell you. Now, we had a great victory last week with the killing of bin Laden. That was great. An enhanced interrogation really led us to that. Now, enhanced interrogation, another thing. You know, we're so politically correct, and nobody wants to say it. Nobody ever wants to use the word. Isn't another word for that torture? And you know what, the people that I watched jumped off the World Trade Center. That was torture. OK. So we catch this guy. They shoot him. Then they clean his body, they give him a religious ceremony. They take 45 minutes, they ta -- why? I don't understand it. OK. I don't understand it. And in terms of torture, in terms of enhanced interrogation, we wouldn't have caught bin Laden without it. That's what got us to him. And we're -- right now, as you know, they're under investigation, numerous people that used enhanced interrogation, to use the nicer term, after September 11th. And I think those people should not be under the kind of gun that they're under. I don't think so at all. Now, one of the things that was recently found out is that bin Laden's plan, and one of his plans, and he had many of them, was to bankrupt what was the former Soviet Union, which he succeeded in doing and hence it broke up, and now it's called Russia, smaller version, very powerful, smaller version. But that war bankrupted Russia. He wanted -- he want -- and he wanted to bankrupt the United States. Now we're spending $10 billion a month -- $10 billion on building schools, on all of the other things that we're doing in Afghanistan, and for what? What are we doing? And I heard something the other day that I have to really -- we're going to do a little research, you're all going to do this research. While we're fighting in Afghanistan, I heard that they have tremendous mineral resources in Afghanistan. I always thought, you know, I look at the oil, I look at Iraq, I look at the different countries and I see things, but tremendous mineral resources. And you know who's in there trying to get them? China. While we're out there fighting, spending billions and billions and billions of money, nobody knows how much money we're spending. Nobody knows. But we're spending billions of dollars on fighting. China is out there trying to get its foot to get the minerals in Afghanistan. I mean, think of that. But we can't build schools in our own cities. We can't build roads in our own cities. I've been to China numerous times, and I see bridges going up and I see airports going up like you wouldn't believe. When was the last time you saw a major bridge being built in the United States? It doesn't happen. First of all, you can't get the environmental approvals. It's impossible. You know, when I was over there was very interesting. A friend of mine from China. Hey, I respect what they do. If they can take advantage of our leaders, you know, I have great respect for that if they can do it. But they're filling in a big chunk of the ocean. I'm saying to myself . I said to my friend, \"How long did it take you to get your environmental permits?\" He looked at me, goes why? What are you talking? He said, \"Donald, it's the ocean.\" You know, they're filling in about a quarter mile by a quarter mile. They're going to build a big complex, a huge thing, and they actually fill in parts of the ocean to build a city. You know that. They build new cities over there like in about 12 minutes, they say, \"We want a city over there.\" They start work the next day. Mayor, it's a little different than what we do, right? But I know -- and I've gotten many environmental awards, so I don't want to sound like this guy that's , I'm totally into fairness, but I've seen jobs that we're going to employ thousands and thousands of people stopped because of a blade of grass that happens to be a unique blade of grass. I've seen them stopped over a certain type of fish, over this and that, and I deal with environmental consultants all the time. And I look at them and I say, \"You know, that's horrible -- that's horrible.\" I mean, they're going to stop progress. Isn't that horrible? He goes, \"Actually, Donald, it's not horrible for me because I'm making a fortune and you're paying me a fortune and so is everybody else.\" And these guys actually go up to Albany, in the case of New York, and they make the restrictions harder, the consultants that are working for you, so that you have to hire them to get you through this horrible situation. And in many cases, you can't get through. And if you're not rich, you can't get through at all because you can't go through the process. I mean, I could tell you job after job after job. And it's like even the drilling of oil where Abu Dhabi recently -- and they have so much energy, they have such resources. They went out and they announced that they were going to have all of their transportation needs done in gas, OK? Because they just -- they wanted natural gas. That's it. Because they're going to sell the oil to the United States and other places. And yet, we're the king of natural gas. We have more natural gas than anybody. Coal, natural gas. I mean, wind is limited, honestly. Solar really hasn't been perfected and it's very expensive. I know them all. You know, I go and I build a building and I say, \"I want to use solar. I want to use solar.\" And I'm good at dollars. So I looked, they come back, and the solar, they said, \"Yes, that will take you approximately 22 years -- 22-year payback.\" I said, \"That's not so good.\" Maybe I won't use solar. It hasn't been perfected and it's going to get better. But we have tremendous -- we're the king of -- of coal, we're the -- the all time of natural gas, we don't use it. And then you hear a country like Abu Dhabi using natural gas so they can sell their oil. And it's just incredible to me. I look at what's going on. I look at Pakistan, not our friend. And I have to say, if you look at Bill O'Reilly from a few weeks ago, if you look at Neil Cavuto from not so long ago, I said, \"Osama bin Laden is in Pakistan.\" And some of you probably heard this, and I was very loud and clear. We give Pakistan billions and billions of dollars a year. We're going to give them 3.2 billion, I think they're asking for now and even more. And I said, \"Listen, I understand something about that. You tell them that we're not giving them\", this is on two shows little while ago, long before the event took place last week. \"You tell them we're not giving you any money unless you hand over to us Osama bin Laden.\" And everybody looked at me like . Nobody else picked it up. You know, it's amazing. I make these statements and no politician picks them up, so obviously, they're not very good statements, I guess. But they never get picked up. And, you know, when they are good, it's interesting because I have another one. But when they are good, they pick them up and they don't give me credit. That's what I hate about politics, Mayor. You know, when I buy a piece of real estate, I own it. OK? But, you know, when you come up with a good idea in politics, if they like it, they take it, they don't, you know, they say, \"I have an idea.\" And, you know, by that time, most people forgot it was Trump's idea. So Trump doesn't get any credit, and I love to get credit. I love -- I love to get credit. But I said, right on their television -- you could look over the last number of weeks, those two shows. Let them give us this guy. Now, if anybody thinks that they didn't know that he was there when they have a sophisticated ma -- somebody said many times the size of West Point, that he wasn't sitting in this big house. I didn't think it was particularly beautiful, but, you know. They made it like this incredible mansion. Does anybody in the audience want to live in that mansion? I don't think so. But if anybody thinks that Pakistan, that the government didn't know that he was there, they're foolish, OK? They're very foolish. So they're not really our friend and they're not really our enemy. But now I say differently, and I think this is very important, because the bad guys could take over Pakistan very easily, very quickly. It could happen very quickly. We wouldn't even know what's going on. They have nuclear weapons. They desperately need our money. We don't give them any money unless they get rid of their nuclear weapons. Now, to me, that's so simple. So I hope it does get picked up by some of the other people. But for us to be giving them money -- they go out -- by the way, they take our money, they use it for nuclear. They also use it for themselves, by the way, I guarantee you that. But they go out and they use that money for nuclear weapons. And you know what, let's say, right now, they are semi-friendly, but they may not be at all friendly. They may be tremendously against us soon, including Israel. Because if that happens, Israel's in big, big trouble. They have serious nuclear weapons. But they seriously need our money. And that's a deal that I would make and I wouldn't -- I wouldn't veer from it because you can not let them have those nuclear weapons. Another one I gave that some people did pick up and some people love it and some people think, \"But it's a sovereign nation\", Iraq. We go into Iraq. We've spent $1.5 trillion. We've lost thousands of great young men and women. We have tens of thousands of people that are incredible people that are horribly wounded with legs and arms missing and just horribly wounded all over the cities -- all over the cities. I see it in New York. I see it all over. And we go in, we fight, and we leave. Somebody said, \"Democracy.\" Give me a break. As soon as we leave, Iran is going to take over Iraq. We've decapitated their armies. It's going to happen. They're already planning it. I've heard that they're closer to the leaders of Iraq than we are. OK? Than our people are. And I'm not surprised to hear it. Iran is very cunning and very smart. So they say they've been fighting for years and years. You know, for years, they were about equal. They moved two feet, they moved back two feet, back, back. The war's over, they go back, and for 20 more years, they don't fight. Right? And there's fight again. But now what we've done is we've decapitated one of those countries, so Iran will go in. But here's what they're going to go in for. Sure, they want the country, sort of. What they really want is the oil. You know that Iraq has the second largest oil reserves in the world, $15 trillion. Interestingly, Mayor, that's very close to our -- our deficit, right? Isn't that interesting? Amazing number. So I've said to people, \"What is this?\" You know, maybe I'm old fashioned. I say, we're in there -- and -- and I have friends and they're really good people and they're smart people and they're -- and they're -- some of them are very liberal, some are conservative. But a lot of them say, \"Donald, are you suggesting we take the oil? That's a sovereign nation.\" I say, \"Excuse me?\" And it's amazing. Now, some people love it. I would say they're the smart ones. Because when we went into Iraq, if you remember, when we went into Iraq, a lot of the so-called smart ones were saying, \"Don't worry about -- we only went in for the oil.\" We didn't. We weren't smart. We didn't know what we were doing. We went in what -- for what? He didn't knock down the World Trade Center. In all fairness, you like Saddam Hussein, you don't like Saddam. It doesn't make any difference. He did not knock down the World Trade Center, had nothing to do with it. And frankly, what he did do is kill terrorists. You could not be a terrorist in Iraq. He would kill you. No trials, no nothing. He would kill you if you were a terrorist. Now, Iraq is the Harvard of terrorism. You want to be a terrorist? You go to Iraq. Everybody says that. You want to be a terrorist. Iraq is great. Afghanistan is pretty good too, right below. And I'm saying, \"What are we doing?\" So we've got our army over there, then somebody said, \"We don't want to stay longer.\" You know the kind of money we're talking about? So they have $15 trillion worth of oil. We've spent 1.5 trillion. I say this, at a minimum, we get our money back and we pay each one of the families of those soldiers that died a couple of million dollars and we give our badly wounded and not wounded a lot of money. It's peanuts. You're talking about peanuts compared to what the numbers are in this incredible oil reserve, incredible. And we pay those families back. Now, people say to me, you can't do that because of the sovereignty of the nation. But let me ask you this. When the families of those fallen soldiers are sitting home watching television in couple of years from now after we're gone, because they're not going to go when we're there. But, you know, we have an appetite to get out, then we're never going to go back because we don't have that stomach. When the families of those great soldiers are sitting home a couple of years from now, when Iran goes in and takes over Iraq and takes over the oil and tells everybody how stupid the United States is, which is absolutely going to happen and they'd be right. How do you think the parents of that 22 year old soldier -- how do you think the parents are going to feel about that? Because those soldiers will have died in vain. And again, all of the wounded, all of the money. What a terrible, terrible situation. Now, just like I said, because I've made a lot of good predictions. You know, I had a book and I made a lot of predictions in the book and a lot of them came true. I said terrorism is going to happen, I said you can have a market crash. I don't know. I'm not saying I'm a great psychic, but I have a good instinct for things. And I think most good business people do. That's why, you know, we're a little bit ahead of the curve in a lot of ways. But I have an instinct for things. And I said terrorism's going to be a big factor. And people sort of didn't know too much about what terrorism was then because that was 10 or 11 years ago. I say we're gong to have a great crash, and we really did have a great crash, that was a great crash. And we could have a second great crash. If gasoline doesn't go down substantially, we've got to have a second crash. If oil stays at over $100, which I think it's going to for a while and it could go a lot higher, we could have a real, real problem and we could have a real second dip as they call it. So I know how to deal with OPEC. I know how to deal with China. By the way, I had some of the smartest Chinese. I made a deal with them. I made a lot of money. I'm very proud of myself. I made a lot of money. And you got to know how to deal with these people. They're smart, they are cunning, and they are not our friends. Remember that. They are not our friends at all. So I'm thinking about running. I must be honest, it's tough because I'm very anti-establishment. That even includes the Republicans, you know. Like, for instance, I tell you, I have great respect for Paul Ryan, but I would not have done it the way he did it, too early, too soon. There was no reason for him to do it. Let the other guy lead it in and then you go and do your number, and you get something that's going to make the country great again. But I'm very anti-establishment. And I see even the Republicans taking shot. What's to take a shot at? What really -- now, there'll be people on television, they'll say bad things about me. But what really that I said today can people take a shot at? I want to take care of our fallen soldiers. I want to take care of our people. I want the oil. I want reimbursement to us, and by the way, to the other countries that helped us like Britain and other countries. I want to take advantage of -- I really want to take advantage of a situation when we're there. Once we leave, we can't. But what -- when you think about it, what's controversial? So I go back and I'm a Republican and I'm doing nicely. You know, I haven't done anything, in all fairness, I haven't even announced whether or not I'm running. And I think even the Republicans don't like it because I'm not in the club. I'm not in that club. You can't be in that club. And that club is not what's going to make us, in my opinion, a great country again. We have tremendous potential, tremendous, unbelievable potential if we had the right people, if we knew what we were doing. We cannot let China drain us. We cannot let OPEC drain us. We cannot let South Korea drain us. When I ordered the 4,000 televisions, I said, \"Find an American company. I want to find an American company that makes them.\" We have the greatest people. Nobody could do it. They can't find a company. Yeah, they had little companies that made a couple of -- I need 4,000 televisions. It's a lot of televisions. So we got LG from South Korea. And it's interesting because, you know, South Korea, we have thousands of soldiers in between North and South Korea. And you know what happened. We're all set to sign this agreement and they said, \"No, no, no, we don't want it.\" Now, Barron Trump, who's my four year old son, would not have agreed to that agreement for the United States. That's how bad the agreement is. But South Korea, it wasn't good enough for them, so they embarrass the President by not signing when they were supposed to. But a couple of days later, some bombs started getting lobbed over to South Korea by North Korea, and we sent this magnificent aircraft carrier, the George Washington, like incredible, and 17 destroyers and boats and like an armada, just to turn on the engine is probably 2,000 bucks, OK? Two million dollars. So we're sending this big armada over there, costing a fortune. And North Korea said, \"OK, look, we don't want to mess around. We'll stop. We'll stop bombing them.\" But South Korea said, \"But we want to sign the agreement. It's a wonderful agreement for all. You're our ally, you're our great friend.\" I mean, how stupid are we? They wouldn't do it, all of a sudden, as soon as the bombs got lofted, \"Please, send it over here, we want to sign it immediately. Who's going to notarize the agreement for me, OK?\" So we have to use our heads. South Korea makes a fortune -- a fortune selling us televisions and lots of other things. They have to pay us a lot of money for protection. They have to pay us. We can't protect them. What are we protecting them for? So they can make money on the United States. Now, unfortunately, a politician is not going to say what I'm saying because I guess it doesn't work, probably it doesn't work. I don't know why. And by the way, if you spoke to South Korea, you're not going to be enemies. They're actually going to respect you more. They're going to say, \"Finally, they got smart.\" They're going to actually have more respect. You ever see that a lot of great business people in the room where when you're firm and tough with somebody, you actually develop a better relationship with them because they respect you. Whereas, when they make a lot more money because you're stupid, they don't respect you. You don't have as good a relationship. Right now, they don't respect this country. They don't respect our leaders. They don't respect what we're doing. And right now, this country is going to be going over a cliff. Now, just in closing, and I think we're going to take a couple of questions, but in closing, I want to say and I think it's very important. I honestly believe that the upcoming election, if not the, is one of the most important elections ever in this country's history. We have a chance to be great. We have a chance to be an unbelievable power again. And I'm talking about from an economic standpoint. I don't want China in Afghanistan. Why isn't China helping with Libya? You know who gets a lot of their oil from Libya? Not the United States. We get nothing. China. Why aren't they involved? We don't have the right leaders. They don't see it. Now, if I run and if I win, and that's a big if, this country will be great again, this country will be rich again, and maybe most importantly of all, this country will be respected again. And thank you very much. It's a great honor to be here. Thank you. Thank you. Thank you very much. Thank you. Mr. Trump, thank you very much for those remarks. Thank you. And per your courtesy, we will take three questions from the audience. Make them nice and easy, please. I'll be happy to come around. I only ask that you give your -- and if you could, I'll start here right next to me. Mr. Trump, thank you very much for coming today. Appreciate it. Thank you. As a small businessman -- Rug business, right? Rug business, that's right. Thank you. Good negotiator. I'll let him negotiate against China. It's true. Those rug guys, they can negotiate. OK. I actually -- Go ahead, Sy. I know you, Sy. Go ahead. Thank you. As a small business man who's been downtown for 53 years and a fourth generation business. The concern we all have downtown is we're losing market share. The old single owner businesses are going away as malls and shopping centers are being built up. What would you do as you see these downtown suffering? What would you have as a recommendation for us to maybe change direction and look at it from another point of view to -- to be -- to be viable again, to be healthy again, and to be able to have the next generation do well. Well, it's a great question and a lot of towns are having -- whether it's Walmart or some of the other big ones and that's probably what you're referring to, they're coming in and they have these massive stores, and, you know, it's a whole different thing and it's a changing time, and it is changing times, and a lot of towns are knocking them out. I would say this, in all fairness, if the economy were good, and it's not great in New Hampshire at all and it's not great almost anywhere. You know where it's good? It's a good in Washington. I have this big club in Washington, and it's doing great. You know why? Because everybody's moving to Washington because Washington is sort of running everything and they own everything, and that's the exact opposite of what we want. If -- Sy, if this economy were raging again, you would do so great because guys like me and plenty of others in this room will be going to your store, we're not going to wherever else it may be. But there's room for everybody -- everybody. So if we could get this economy going again, if we could get jobs back instead of having them going to India and having them go -- I mean, Mexico. There's a place called Newton, Iowa where Maytag was given a huge incentive to move out of Newton, Iowa, and that was the big employer, and they moved to Mexico with our incentive. And now, Newton is devastated. Just absolutely devastated. And this was years ago and they haven't come back. If we could use the right brain power, you would have so much business and so would everyone else because you hate to restrict these big companies from coming in. I think even you would agree to that. So -- and I've seen plenty of towns do it and they end up getting hurt in a different way -- in a much different way. But if we could make our country strong again economically, we're just teetering along and it's going to start getting worse and worse because of what's happening with fuel and other things. And remember this, we have no interest rate. I went to a bank the other day, they don't want to -- if you have CD's, they don't give you anything. And you know what, if you want to borrow money today, if you're super prime, you can borrow whatever you want and pay almost nothing. Problem is if you want to buy a house, they won't give you any money for a house. The people in this community never -- you go to the banks and it's very, very hard. Don't worry, I'm talking about the big banks. I'm not talking about you. Your -- your bank is wonderful. But, you know, they've taken this -- they've taken these tremendous subsidies -- tremendous subsidies from the government, and now what they're doing is sitting on them and then not loaning money for those. And that's one of the big problems with us. Now, the real problem is what's going with gasoline in terms of bringing the world back -- in terms of bringing our world back, which is the United States. And eventually, interest rates are going to have to go up because the dollar is being decimated. And if you look at your food costs, look at the cost of cotton, that blows away gasoline. But if you look at your food costs, if you look at your clothing cost, and if you look at your gasoline costs, it -- they're setting records. And a lot of that is because of the decimation of the dollar. So we have to get a strong dollar back. We have to get the country going again. And you, Sy, and everybody else going to make a lot of money. OK? Thank you. Mr. Trump, we'll take the second question over here in this corner. I'm right back -- right back here playing Where's Waldo with you. There we go. Good afternoon, Mr. Trump. Thank you for coming today. Hi. Thank you. My name is Marie Mayotte with my husband and my son. We own a small business across the river in Hudson. It's called Red Brick Clothing. And before I ask my question, I would like to just say as the mother of a young naval officer who did four -- six month deployments in the Persian Gulf between 2003 and 2005, I do apprecia -- appreciate your respect for the job that those young men and women have done. Thank you. Well, thank you very much. Thank you. I do respect it greatly. My question to you is you have made some statements about not being a nice guy and being anti-establishment and some things like that. To that end, if you do enter the political arena, the art of compromise is something that is kind of important. Is that something that you -- a skill that you will develop or something that you will kind of tap into your inner nice guy at some point just to get the job done? OK. It's a very fair question. And she's a comedian. First of all, I do -- I hope I am a nice guy, and I say that. But I hope I am a nice guy Can I -- can I say one other thing? Yes, go ahead. I hope the two Johns go head to head in the final of the OK. I -- I thought she was talking about candidates, I'm trying to figure out which ones. Well, that's right, the Celebrity Apprentice. That's right. Thank you. It's very funny. Do we have two of them named John? OK. Number one, I hope I am a nice guy. But when I say nice, we don't have much room for big negotiation. We've given that up over the last 10 years -- 12 years -- 15 years. We have to do it right. And the problem that we do have is there has been so much compro -- let's compromise, let's compromise, let's do this, let's do that. And in the end, we have so much debt. We have more debt than ever, you add it all up in the history of the country. We have more now than all of it added up together. So we need not compromise. We need smart people and we need good people. And maybe we need lame duck people. Maybe people are going to say, you know what, we have to do the right thing for this country. And we have to do it. And if it's popular, if it's not popular, whatever it may be that it is to get this whole thing in order. Because if we don't get it in order, this country is going over a cliff. And, you know, they were comparing it to Greece and they were comparing us to lots of other countries that you've been reading about, and I was watching on one of the shows the other day and they were saying, actually, we're in worse shape proportionately than some of these countries that we're reading about all the time. And it's true. 40 cents out of every dollar goes to pay interest to China and to other places that are making a fortune on us. So we really -- I think compromise is a great thing and I've made plenty of compromises all my life. But I think we're beyond compromise. We have to make -- we have to do what's right for the country. And if we don't do it, we're not going to have much of a country left. OK. Thank you, it's a great question. Thank you. Mr. Trump, I'm over in the corner to your right shoulder and we'll take the third and final question this afternoon. OK. Good afternoon, Mr. Trump. My name is Mike Brunker. I work for BAE Systems as an Engineer Intel. My question is, you've spoken a lot about getting respect back for our country abroad, but more importantly here in our community, what are we going to do for new jobs? Do you have any novel strategies to develop new jobs or to grow the eco -- excuse me, to grow the economy? Well, I do actually. I do have a lot of strategies for new jobs. We have to take our manufacturing back from China and many other places that are doing it. It's really easy. You know, I toured -- I toured -- two weeks ago, I toured New Hampshire and we had a great time. And I have never seen -- we had some companies that I looked at that were absolutely unbelievable, the -- the -- the level of detail, the -- the technology, the whole thing. These are great manufacturing companies. I was so proud. I almost didn't think we had this anymore in this country. We have some great, great people in this country. But when China manipulates their currency, so they take jobs out of New Hampshire and New England, and you look at what's happened in New England, generally, where NAFTA with everyone going down to Mexico. I mean, I see plants that are empty and they're -- they are thriving over in Mexico. And do you think these people want to be in Mexico? The fact is we have to manufacture our own product. We have to. We have to start manufacturing again. We have to, by the way, get rid of Obamacare. It's a disaster. If we don't get rid of Obamacare -- I have six friends who are in business, modest-sized businesses, good businesses. Of the six, two are going to close their business. Another two are thinking about it because they're saying, \"We can't afford Obamacare. We can't afford the health care. We can't do it.\" And these are good guys. These are guys that employ a lot of people. They have really good companies, mid-sized companies. They're fantastic people. And they're thinking about closing. I never heard them even mention that word and I've known them for -- two of them went to Wharton -- a couple of them went to Wharton with me, the Wharton School of Finance. I never even heard this. We have to get rid of Obamacare. And one other thing, I really think the President is doing this country a tremendous disservice just like he should have given his birth certificate years ago instead of making everyone wait. And believe it or not, I'm very proud of what I did, getting him to finally produce it. Believe me. But it's sort of the same thing. We're going through all these court systems, you're reading about it today. They're in Virginia, they're all over the place. Why doesn't he allow it just to go to the Supreme Court? You'll save a year and maybe more than a year. And I have -- I know people that are going absolutely crazy with their business because they're doing this very, very, very complicated restructuring on the assumption that Obamacare happens, and if it doesn't happen, they've got to go all the way back, and this is thousands and millions of businesses in this country. Why don't the various legal entities involved, headed by the President, in all fairness. Why doesn't he let his people go directly to the Supreme Court? Win or lose. But at least they'll be certain. You know, business -- when I talk about business, there's a word that's very important, it's called certainty -- certainty. You need certainty. And at least this way, we'll get a faster decision because, ultimately, those people on the Supreme Court are going to be ruling on Obamacare, and they may approve it and they may not. But wouldn't it be good if we knew what was going to happen instead of waiting a year and a half, maybe two years, and nobody knows what's going to happen. Certainty. It's been an honor to be with you. This has been a lot of fun and thank you all very much. Thank you. Thank you. Thank you."}