{"id":525,"author":"Donald Trump","title":"Donald Trump Addresses Nevada Republican Party Gathering in Las Vegas","date":"2011-04-28","link":"https://factba.se/transcript/donald-trump-speech-nevada-gop-las-vegas-april-28-2011","paragraphs":["So nice. Thank you very much. Well, I'm glad you mentioned that so-called birther issue, because yesterday, I was traveling up to New Hampshire and I got a call. I was in a helicopter, I got a call in the helicopter. I was just about to exit the car, the chopper, and what happens? I hear that Obama finally gave his birth certificate, and I've got such credit for that, because I accomplished something that nobody else had accomplished.","Everybody said it is amazing. They all said, you know, Hillary Clinton tried to get him to do it Bill Clinton tried to get him to do a John McCain who's a wonderful guy tried to get him to do it. Nobody could get him to do it, and he did it because we went after him hard. We're tough negotiators like this country needs.","I just ask one thing: Why didn't he do it two or three years ago? Why does he have to put... why does he have to put this country through turmoil, which is what it's going through right now.","I'll give you an example. Obamacare is a disaster, right? It's a disaster, and I know lots about litigation. I've been lucky in courts, and I guess a little bit unlucky every once in a while, but overall, I understand the system, and we're going through a process right now.","That's a disgrace. Either you have it or you don't have it. Why do we have to go through the lower courts? Why don't we just let it go right to the Supreme Court? I have friends, you know, they're a little like the birth certificate to be honest. Why didn't he do it three years ago? I have friends, and a lot of friends that are destroying their companies over Obamacare, that preparing for it, but they don't know if it's even going to exist, because the court could overrule it very easily, very quickly and that's it.","Now, they spent millions of dollars preparing their company changing the documents doing everything that you have to do years of work and then the courts could take a vote in lose and it's over by the way, that would be a great vote. But, but it would be over and you say why don't you... thank you... you say, why aren't you just allow it -- it's going to go there.","Why don't you just allow it to go to the Supreme Court? If you win, great. If you lose great. at least we know what the hell we're doing. Now -- and I want to thank Phil Ruffin too, because you know gave us his room. I mean, he's my friend my pal, and Phil and I have another very very successful building. You know, we have a building right down the road called Trump International Hotel and Tower. The tallest building in Las Vegas. We got it built, its doing great and we're very proud of it is one of the great signs of all time, right down the middle of that strip, you drive down that strip, what do you see? Trump. You better believe it.","So we've had a great time, and he's been a great partner in a great friend, and I mean much more importantly, he has been a great friend and he's a great guy for the state of Nevada. He's a great guy for Las Vegas and, and I made it... and you know when I was thinking about Obama, I said, hey, I'm gonna come here. I'm gonna make a speech, and I remember a few years ago when things weren't so good, and Obama did a whole big thing on not coming to Las Vegas, and he didn't do it once, he did it twice, and I have a lot of friends including Steve Wynn and others that were not happy, and the bank's cancelled out, and all sorts of people cancelled out.","And you know you look at what you have, and even now, unemployment over 13% think of it, uh no, we have a president saying don't go to Las Vegas. Unemployment, number one in foreclosures in the nation. Not great.","I mean, I don't want to make you people depressed, but this is what you've got your visitors have decreased markedly and the gaming revenue as you understand this, way down. I mean, it's it's got some serious problems, and yet when we have a president, we have to have a cheerleader, you know, I've seen the best politicians, I've dealt with all -- somebody said, but Donald you're running for president, but do you have any experience in politics? I've dealt with these freaking politicians all my life and and they're fine.","Find some are good. Some are -- some crooks, you mean you got them all they come in all shapes and sizes that you know, but I think it's good. I think you know having the perspective that I have as a businessman, and I made a lot of money. I mean I've done well, they criticized me because I contribute the Democrats also, excuse me. If you're in New York, we only have Democrats.","Somebody said, oh gee, you didn't contribute to Republican. Well, the polls come out, number believer in the polls. The polls come out. The Republican is scheduled to get if he really does well for percent of the vote, and then he comes up to my office. Mr. Trump. I think I can get five or six percent, they say, you know what? I love you very much. No, thank you.","So it's amazing. Now speaking of poll, as you probably just saw the Rasmussen poll, which is a great one. You saw it just came out and who's number one Trump. So hey look, I've never done this before and who the hell knows what's going to happen. It's brutal, and I've always heard from the time.","I'm a young guy that a really successful person cannot run for high political office and I've heard it a hundred times. You can't run even now people are saying Donald don't run. Don't run please. Don't run. Thank you, baby. I love you too, but they're saying don't run. Please. Don't run to you know, they're gonna go They're gonna say, oh gee you weren't nice to these people from China where I made a lot of money, by the way with people in China.","I made it out of money. I mean on one deal. I own a big chunk of the Bank of America building in San Francisco a big chunk of another one Phil could tell you I did what Phil did I do? Well with the Chinese he said you certainly did and we need somebody I'm not blaming, you know when China this year, as an example is going to make, call it profit -- s,imple word is going to make on this country three this year $300 billion. 300 billion, and then they say, you know, these idiots they say oh, but you don't want a fair trade and this because I don't want to trade when somebody's taking away 300 billion.","I want to trade at least words of break even. But ideally, what we make 300 billion. Why shouldn't we make for a change now? And what China's really done is they manipulate their currencies? They are professionals at manipulation. They are abusing this country. Like we've never been abused before except of course for OPEC. I always have them I have them as a special category.","Did you see recently where a couple of days ago Saudi Arabia said, uh, let's raise the price. Let's cut back production. Can you believe it? You're going to be paying five and six dollars a gallon for gasoline pretty soon, and they want to they want to go in and raise the price of oil, because we have nobody in Washington that sits back and said you're not gonna raise that fucking price.","You understand me, and it's unbelievable. So we're in Libya, you know part of the reason we're in Libya, because the Arab League, which is Saudi Arabia and a few of the other richer countries in the world. They have money coming out of their ears. You go to those countries. You see the most incredible airports being built or already built. You see bridges that make the George Washington Bridge in New York look like a toy.","You see the most unbelievable things and you come home like a third world nation, you land at LaGuardia? It's broken. It's dirty. I mean, you know, I don't mind going over potholes in my car. I don't like doing it in a plane, but you got them and they wouldn't be there except for us. We protect them for nothing for nothing.","So Libya, Saudi Arabia and the others say we don't like Qaddafi, like mmm. We'd like you to take him out, and Obama said, okay, so we form a group -- meaning NATO, which is us by the way, just so you understand, NATO is us, you know, a lot of people say NATO, but NATO is largely us.","So we don't even have control of what the hell we're doing... Qaddafi tonight is driving down the streets. Can you believe this? He's waving at everybody. So we form a group and listen to this one. Who's the leader of the group? France. France. France wanted to go in first now, of course, we haven't seen them since, but they were there the first day, and they got all the glamour. They took the glamour.","So they form a group and they go in and Obama talks about the regime, maybe not and we don't want to kill anybody. We don't want to hurt anybody. We do want to change government, but we don't want to hurt anyone. Nobody knows what the hell he's talking about, and you know, the other thing about Libya that really bothers me, because we get back again -- it always gets back to China because while we're spending billions of dollars being policemen of the world, China's spending billions of dollars a day buying the world and calling us stupid.","You know, I have a lot of friends. I just sold recently an apartment for $33 million. Can you believe it? Only in New York in this happens. But an apartment was sold in a building that I have on Central Park West. $33 million to a Chinese gentleman, and I get to know a lot of guys, and a lot of big people from China, and they look at me. This is before, you know, by the way, about two months ago. They stop talking to me so much. You understood they're saying shit.","Do you believe we're talking to this guy and now maybe something crazy could happen. They see these balls, but it's amazing but they sit there, and before I did this that say to me, because there's sort of friends of mine, you know, and competitors but friends. They say Donald, we don't believe that the government allows us to do this. The one guy looks at me. Are they stupid? And I say, absolutely they're stupid.","So, you know, I don't blame them. It's like if you make a bad business deal, if you don't know what you're doing, you know, you know, you have to blame yourself. I blame our leaders here. We have China ripping this country off like nobody's ever seen before and we have the president of China came a few months ago to Washington and we give them a state dinner.","Now when people are screwing you you don't give them State dinners. You don't do it. So what happens is we send them home and then you heard my statement, right? I said no. No, we're not giving dinners. What we do is we sit down in my office for a couple of hours. We the make a deal where you stop manipulating your currency or not. If we make a deal you can have a state dinner if you want. If you don't make a deal, you take McDonald's and you go home, that's it. That's it.","Now, the Chinese economy is growing so fast. It's unbelievable our economy. We had some very bad news. It's just not growing. You say how can it grow? How can we have jobs? Ben Bernanke said fairly recently that the job... the jobs won't come back for a long time. And I think you mentioned five years, and how can you have jobs come back when every time I want to buy a product, I want to buy a product, like as an example television sets, as you know, I buy a lot of television, we bought a lot of sets at Trump International, tremendous, thousands of television sets one order.","So I said, I want an American company my people look at me like I'm crazy. There's no American company. But so we end up buying LG's from South Korea, good television set, but why don't we make them? Why are we making them? You know, I'll tell you a great one. I'll tell you a great one and I like the people of South Korea. It's great. I mean I do business with them. I made a great deal with them in New York on Trump World Tower was a great deal. They were wonderful, but they don't even believe it.","So here's the... here's what happens recently. We have this contract and it's going to be signed with South Korea and it's a big big deal and Barron Trump, who's four years old, wouldn't sign it from our standpoint, because the deal is so bad. It's so bad like a moron would not sign it. Nobody would sign it and what happens is our president goes there and he wants to send but they don't want to sign because they want better. It's not good enough to just you know, whip the hell out of us.","They want it to be even more. So now what happens is times are a little bit different and a couple of bombs get lobbed over, you know to the island and from North Korea. So all of a sudden North Korea's hitting them with a couple of little like lobbing over some bombs, they call us. They said we would like very much to sign contract. You are a wonderful wonderful trading partner. We love you very much. Oh and by the way, do you mind sending the great aircraft carrier the George Washington and about 17 ship because North Korea shooting at us.","So what do we do? We have this great aircraft carrier head over to North Korea. We have all these the whole Navy. I mean a big portion of our Navy is going over there North Korea says, holy shit. This is bad news. This is a little bit more than we counted on and they stop we sign a terrible agreement. So then I said to somebody, you know to start up that engine on a carrier like the George Washington that course you probably a million dollars just to see if it's working. You know, you go boom a million. We know right?","In fact finest engines of the world Listen. Mr. Trump. I said don't start it. I'll save I take your word for it. I don't have to hear the engines. Okay. I like to save money. I don't care how much money you have you like to say. So so listen to this so we send the George Washington with all of the planes and the crew and all of the side ships and the Destroyers, you know how much they paid us. Nothing. It was stupid.","Our leaders are stupid this stupid people. It's just it's very very sad and there are so many stories like that you look at it. You know how many soldiers thousands and thousands of soldiers in between North and South Korea. Give us nothing. In fact, they take our trade now, what would I do do a lot different I'd say, thank you darling. I'll think about that. I'm gonna I think I'm gonna make you very happy about it. So we have thousands of troops and you talk about you know, they have an expression In Harm's Way. How would you like to be sitting between North Korea and South Korea?","And you're sitting in a little barracks those guys are in danger. And you know what? That's fine. I'd say the South Korea all those television sets you sell us and all the billions and billions and billions of dollars you make we're going to protect you and we're going to make sure you're in good shape, but you're going to pay for it. You got to pay for it and you want to know something they would do it in two minutes. If you said that you know, somebody said these people are so protective of President Obama.","I mean, it's like unbelievable some of the reporters come up and they say you don't mean that I said what kind of a you know, there's supposed to be like impartial they go to me on television. You don't mean it. He's good. He's good. I'm telling you. He's good. I said are you all right. Take it easy. I have never","Seen anybody protected like this guy you look at what he's doing. Now. I said something and it came out about two or three weeks ago, but I've been thinking about it for a long time, but you know, nobody cared. Who am I telling Phil Ruffin, the hell does he mean contractors? What the hell do they I've been telling friends, but I've been thinking about it for a long time when we went to Iraq. Everybody said, oh we're going to Iraq. They have weapons of mass destruction. Well, they didn't and by the way, they did knock down the World Trade Center and they also killed terrorists. Now, it's Harvard, you know, this is like going to Harvard of terrorism.","If you want to go to Iraq in terms of a terrorist. This is called the Wharton School of Finance or Harvard of terrorism in the old days. He used to shoot the son of a bitches. They had no terrorists. The terrorists had no way I'm going there. So what happens is we've decapitated their army. I mean they have no -- their armies corrupt and they have no Army by the way their leaders that we put in hate us and their leaders are dealing with Iran and I don't even think a shots going to be fired.","So what happens is I said the other day when Bill O'Reilly show and some others but I say, you know, this could be risky because a lot of people might not get it but the funny thing is the reporters don't get it, you know gets it the people get it. So here's what I said. It's true. You are smarter than the press now.","I have to tell you I've been dealing with the press some is great and fair and honorable and some is really scum that dishonest horrible people. I really mean it. You know, they have a horrible. They have a horrible relationship with a lot of people but they're very dishonest some not all some are great. But I said just about three weeks ago listen upon information and belief Iran, which has been fighting with Iraq forever.","Years and years and they were about the same. You know, that's the way it evolved one would push 10 feet this way. Yeah, they throw some gas. They throw a bomb then they go back home.","Okay, because they were equal but now what we've done is decapitated Iraq so Iran, which is looking to take over the entire the including by the way Libya, you know, the the rebels which you here are Gone With the Wind, you know, the rebels they talk about the rebels carrying the flag. They're wonderful people. I hear they're iran-backed and Al-Qaeda Peck. How about we get rid of Qaddafi. We're already in there for a billion dollars.","We get rid of Gaddafi we end up with worse. Okay that could happen. And the other thing is why isn't China doing it they get that we don't get anything from Libya. You know what I did say in Libya. I'm interested in Libya if we keep the oil and everyone said oh and some of the press said, oh my God, that's the Sovereign Nation. Give me a fucking break.","So what happens with Iraq what happens with Iraq is sort of similar we spend in Iraq. We spend this one trillion trillion dollars so far, you know, we could build we could build a big chunk of our country for that we go to Afghanistan we go to Iraq, we build a school. We build a road they blow up the road. They blow up the school. We build another school. We build another road. They blow them up we build again the meantime, we can't get a fucking school built in Brooklyn. It's unbelievable. No, it's unbelievable.","So when I heard we were going to Iraq, somebody said, oh we're going for the oil. I said, huh. That makes sense. That's smart. Okay now all of a sudden I'm saying that makes sense. Second largest oil fields in the world second largest reserves in the world fifteen trillion dollars that does a lot to solve our deficit problem doesn't fifteen trillion dollars second after Saudi Arabia. So they said we're going to Iraq. They said the smart people said we're going for the oil but the small people didn't happen to be running things. So we're gonna rack now, here's what we do we go into Iraq. We decimate their army.","The people can't stand us the war is over but we're policemen we have policemen. We're not soldiers over there were policemen. Okay, we need a policeman over here and everybody hates us. They don't want us. So what I said is something very Sinister, but true Iran within 15 minutes after we leave is going to walk in they're not going to be fighting anymore. They're going to walk into Iraq.","They're going to take over Iraq and they're gonna take over the oil was now we lost thousands of soldiers with tens of thousands of soldiers and I see it in New York. No arms. No legs. I mean seriously wounded and horribly wounded people Brave great people and these are tens of thousands. So here we have fifteen trillion dollars worth of oil that we're going to hand over hand over to Iran.","So I said, it ain't gonna happen if I'm president. Okay, it ain't gonna happen. So what we do is very simple and explain this three weeks ago for the first time I said, what we do is very simple we stay we get our exxonmobil's and we go to our grade oil companies we go in there. We give plenty to Iraq more than they getting now because it's all absolutely crap. They don't even know what they're doing and they never will.","I mean you think they're going to be a democracy who here thinks. They're gonna be democracy. I'm give me a break. So we go into Iraq and you know in the old days I'm like an old-fashioned Warrior the old days when you had a war and you won the war was yours when we have a war. It's amazing when we have a war we go in we lose thousands of lives tens of thousands wounded spend a trillion and then you know, we do we leave nothing. What do we do this for? So I said we go in we take the oil now Bill O'Reilly who I love I think he's great.","He thought that was Radical somebody else said very very strongly Donald. It's a Sovereign Nation. We can't do that. I said Sovereign Nation, they don't even know. I mean, they're not they got wiped out they got nothing, but you know, what if weren't going to take it over which they are 100 percent, 95 percent and you know, there's a real good chance no matter what happens. I will win because you know, one of these blood-sucking politicians whose been bullshitting people for years will end up, you know getting elected and they'll end up leaving and you know, somebody else or in I guarantee you if that happens Iran takes over the oil Iran becomes a force like never before in history.","They then take over for Saudi Arabia. They go after Saudi Arabia, which frankly I would protect if they pay us, you know, only if they pass otherwise, I'm not interested. I'm interested in protecting none of them unless they pay but think of this we have a great ally think of this. We have a great ally over there a real ally Israel and Iran is already said that they want to blow Israel off the face of the Earth that developing nuclear weapons.","Our leadership is weak and pathetic. I mean we can't even beat Libya. Okay, our leadership is weak and pathetic. So when Iran which is really a power and going to be a great great power very soon, especially when they take over a couple of more countries, they can have so much money and we don't do anything about it. And by the way when they take over Iraq, there's no way we go back honestly because we won't have the stomach to go back. We won't have the stomach. You got to stay you got to take the you got to do it.","But what's gonna happen to Israel when you have a controlling? Probably Libya you have them controlling Egypt, which they're going to control already there talkin about that. They're going to control everything over there with all of the money. It's really blackmail money with all of the money. We've paid for years and years and years to take these people. I don't know if you saw the vote. There was a vote in Egypt the other day.","99% of the people want to break the peace treaty with Israel.","Did you see that? Did anybody see that 99% so we have problems we have weak pathetic leadership. We have we have incompetent leadership. Now, I'm gonna make a decision fairly soon and I would rather you know, I love my life Phil can tell you I'm having a great time. I built a great company. I have a television show. That's one of the top shows.","It's the top show on NBC. It's the number one show on NBC. It's doing great. Even the New York Times the other day wrote a nice little piece about it talkin about how great the ratings were one of the evening at one. It wins the 10 o'clock hour for the whole week.","It's a show I mean I have to give a lot of stuff up but you know what its peanuts compared to the importance of this country. And when I see what OPEC is doing to us when I see what China's doing. I'll give you a little China story. Also China I said the other day very very hard to buy anyting outside of China certain other countries also, but China's, you know, the one and I said, somebody said, well, what would you do","What can you do? So easy? I drop a 25% tax on China and and get I said to somebody that is really the messenger. The messenger is important. I could have one man. Say we're gonna tax you 25%, and I could say another -- listen you motherfuckers, we're going to tax you 25%.","Now, you've said the same exact thing. You've said the same exact thing, but it's a different messenger, and I'll tell you what will happen with China, in my opinion, and I'm not looking at enemies with China. You know, I actually get along. I'm a lover not a fighter.","Okay, you've been reading about that for years, but... but I'll tell you something: when they really believe it, when they don't have Obama bowing to the king of Saudi Arabia -- bow, bow down. Remember that one? Does everybody remember that? Remember they were all screaming \"drop to your knees, drop to your knees.\"","So what we don't have Obama having all these State dinners and everything. Well, we have somebody that's real and tough and smart and saying -- I'm not saying -- I'm saying smart and you say to China. I'm sorry. We're gonna have to put a 25 percent tax on your products. They'll say when I said how about this evening? Not like, you know, they have -- everybody knows they're abusing us. Everybody knows what's going on. Everybody knows they are manipulating their currencies and they're brought up on it. They're brought up on charges.","But we, you know, we take six months just to put in a judge and then we don't do anyting. So I'm not putting charges in. We're gonna charge 25 percent, now the real number based on the manipulation. It's so severe that the real number should be 45 percent. Twenty five, let's start with 25. We can always raise it.","I'll tell you what's gonna happen when they believe the message. They don't believe it right now when they believe the message they're going to do one thing. They're gonna give us anything they want because you know, the IMF did you see the international monetary fund they came out with the statement last week that this is unheard of this is that in 2016 that's just like four years, China is going to eclipse the United States as a great economic power.","We're going to be in second and if you would have said that 10 years ago, if you would have said that during the time of the late great, Ronald Reagan people would have left at you. They would have laughed so China's going to Eclipse Us in four years now under the Trump doctrine that doesn't happen. You know, why because we're gonna start making our own products.","We're not going to let them made in China, you know, when you go to China and you want to sell stuff in China, they make you build a plant and they take all your technology and they pirate everything you have look at the deal that General Electric Man they gave up all of this high technology in order to go there. They had to build factories. When the Chinese sell to us just come on in. Come on in folks will pay you whatever we are stupid.","Unbelievable. So under the Trump Doctrine, it doesn't work that way. It's fellas, it's fellas, we love you very much. You want to sell to us build your plant in Alabama build your plant in Nevada Bill get plant. Whatever the hell you wanted, but you're not bringing it all your crap. Including Errata sheet rock. That's making everybody sick.","Let me tell you something. The other thing is we make a much better product, but you can't compete price wise because of the manipulation. So one of two things is going to happen and I hope it's the second the first is they stop screwing around but the second is they don't so here's what happens about 60 percent of their sales will stop we will increase the hell out of employment will be building plants.","I saw one the other day a fantastic Wilcox, a fantastic plant yesterday in New Hampshire we will start building. They make Weaponry most incredible plans. I didn't even know we had anything like that anymore because everything's made in other countries unbelievable. And this is high technology stuff. Incredible Wilcox look it up great and I don't even have a piece of the company.","I wish I did but they make their own products, but you'll have thousands of those places once you do that so they'll behave but if they don't behave that's even better for us because we're gonna start building our own plans and will tell Apple and will tell all these other companies. You got to build your own factories. I'm sorry. You can't make it over there. We got to put our own people to work. So I'll just go one step further. It can happen. So fast one other thing oil you look at what's going on you look at what's going on.","And we can't drill in the Gulf and we can't drill in Alaska. Now. Nobody knows more infill can tell you about the environment than I do. I'm I actually receive a lot of people find it hard to believe but I receive a lot of environmental Awards in China and other countries. They just burn whatever the hell is available and that smoke is spewing out of those chimneys and those factories are cheap as hell and they don't give a shit over here.","We want clean technology. We want green, green. What the hell good. Is it green here? If this guy over here is spewing all sorts of crap into the what are we doing? So and I believe in the green but what we're doing with our oil we've got to drill in Alaska. We've got to drill in the we've got to drill we've got to drill because there is so much oil plus we have natural gas and we have thing called, you know, we have enough natural gas. We have more natural gas than all of the oil in the entire world put together likewise with call.","We have so much call and yet, you know in Abu Dhabi very rich unbelievably which they reek. I mean the poorest people have money pouring out of their ears. Okay. Did you see what they did the other day they are making all of their transportation all of their transportation is going to run on natural gas so they can sell the stupid United States oil.","We don't want to use the oil we can sell it to the idiots. So I only say this we have the potential to have a great country again, and I have to say again, we're not a great country now, we're not a great country. We love our country, but we're not a great country if I run and if I win and I hope you're going to be really pleasantly.","We're not talking long, believe me. Before June, if I run and if I win, we will have a rich country again. We'll have a great country again, and you know in a certain way what I almost like the most will be respected as a country again. Okay? Thank you. Thank you very much. Thank you. Thank you very much."],"text":" This transcript was generated by Factba.se's AI. It has not been edited by a human. Please verify any quotes with the corresponding video.] So nice. Thank you very much. Well, I'm glad you mentioned that so-called birther issue, because yesterday, I was traveling up to New Hampshire and I got a call. I was in a helicopter, I got a call in the helicopter. I was just about to exit the car, the chopper, and what happens? I hear that Obama finally gave his birth certificate, and I've got such credit for that, because I accomplished something that nobody else had accomplished. Everybody said it is amazing. They all said, you know, Hillary Clinton tried to get him to do it Bill Clinton tried to get him to do a John McCain who's a wonderful guy tried to get him to do it. Nobody could get him to do it, and he did it because we went after him hard. We're tough negotiators like this country needs. I just ask one thing: Why didn't he do it two or three years ago? Why does he have to put... why does he have to put this country through turmoil, which is what it's going through right now. I'll give you an example. Obamacare is a disaster, right? It's a disaster, and I know lots about litigation. I've been lucky in courts, and I guess a little bit unlucky every once in a while, but overall, I understand the system, and we're going through a process right now. That's a disgrace. Either you have it or you don't have it. Why do we have to go through the lower courts? Why don't we just let it go right to the Supreme Court? I have friends, you know, they're a little like the birth certificate to be honest. Why didn't he do it three years ago? I have friends, and a lot of friends that are destroying their companies over Obamacare, that preparing for it, but they don't know if it's even going to exist, because the court could overrule it very easily, very quickly and that's it. Now, they spent millions of dollars preparing their company changing the documents doing everything that you have to do years of work and then the courts could take a vote in lose and it's over by the way, that would be a great vote. But, but it would be over and you say why don't you... thank you... you say, why aren't you just allow it -- it's going to go there. Why don't you just allow it to go to the Supreme Court? If you win, great. If you lose great. at least we know what the hell we're doing. Now -- and I want to thank Phil Ruffin too, because you know gave us his room. I mean, he's my friend my pal, and Phil and I have another very very successful building. You know, we have a building right down the road called Trump International Hotel and Tower. The tallest building in Las Vegas. We got it built, its doing great and we're very proud of it is one of the great signs of all time, right down the middle of that strip, you drive down that strip, what do you see? Trump. You better believe it. So we've had a great time, and he's been a great partner in a great friend, and I mean much more importantly, he has been a great friend and he's a great guy for the state of Nevada. He's a great guy for Las Vegas and, and I made it... and you know when I was thinking about Obama, I said, hey, I'm gonna come here. I'm gonna make a speech, and I remember a few years ago when things weren't so good, and Obama did a whole big thing on not coming to Las Vegas, and he didn't do it once, he did it twice, and I have a lot of friends including Steve Wynn and others that were not happy, and the bank's cancelled out, and all sorts of people cancelled out. And you know you look at what you have, and even now, unemployment over 13% think of it, uh no, we have a president saying don't go to Las Vegas. Unemployment, number one in foreclosures in the nation. Not great. I mean, I don't want to make you people depressed, but this is what you've got your visitors have decreased markedly and the gaming revenue as you understand this, way down. I mean, it's it's got some serious problems, and yet when we have a president, we have to have a cheerleader, you know, I've seen the best politicians, I've dealt with all -- somebody said, but Donald you're running for president, but do you have any experience in politics? I've dealt with these freaking politicians all my life and and they're fine. Find some are good. Some are -- some crooks, you mean you got them all they come in all shapes and sizes that you know, but I think it's good. I think you know having the perspective that I have as a businessman, and I made a lot of money. I mean I've done well, they criticized me because I contribute the Democrats also, excuse me. If you're in New York, we only have Democrats. Somebody said, oh gee, you didn't contribute to Republican. Well, the polls come out, number believer in the polls. The polls come out. The Republican is scheduled to get if he really does well for percent of the vote, and then he comes up to my office. Mr. Trump. I think I can get five or six percent, they say, you know what? I love you very much. No, thank you. So it's amazing. Now speaking of poll, as you probably just saw the Rasmussen poll, which is a great one. You saw it just came out and who's number one Trump. So hey look, I've never done this before and who the hell knows what's going to happen. It's brutal, and I've always heard from the time. I'm a young guy that a really successful person cannot run for high political office and I've heard it a hundred times. You can't run even now people are saying Donald don't run. Don't run please. Don't run. Thank you, baby. I love you too, but they're saying don't run. Please. Don't run to you know, they're gonna go They're gonna say, oh gee you weren't nice to these people from China where I made a lot of money, by the way with people in China. I made it out of money. I mean on one deal. I own a big chunk of the Bank of America building in San Francisco a big chunk of another one Phil could tell you I did what Phil did I do? Well with the Chinese he said you certainly did and we need somebody I'm not blaming, you know when China this year, as an example is going to make, call it profit -- s,imple word is going to make on this country three this year $300 billion. 300 billion, and then they say, you know, these idiots they say oh, but you don't want a fair trade and this because I don't want to trade when somebody's taking away 300 billion. I want to trade at least words of break even. But ideally, what we make 300 billion. Why shouldn't we make for a change now? And what China's really done is they manipulate their currencies? They are professionals at manipulation. They are abusing this country. Like we've never been abused before except of course for OPEC. I always have them I have them as a special category. Did you see recently where a couple of days ago Saudi Arabia said, uh, let's raise the price. Let's cut back production. Can you believe it? You're going to be paying five and six dollars a gallon for gasoline pretty soon, and they want to they want to go in and raise the price of oil, because we have nobody in Washington that sits back and said you're not gonna raise that fucking price. You understand me, and it's unbelievable. So we're in Libya, you know part of the reason we're in Libya, because the Arab League, which is Saudi Arabia and a few of the other richer countries in the world. They have money coming out of their ears. You go to those countries. You see the most incredible airports being built or already built. You see bridges that make the George Washington Bridge in New York look like a toy. You see the most unbelievable things and you come home like a third world nation, you land at LaGuardia? It's broken. It's dirty. I mean, you know, I don't mind going over potholes in my car. I don't like doing it in a plane, but you got them and they wouldn't be there except for us. We protect them for nothing for nothing. So Libya, Saudi Arabia and the others say we don't like Qaddafi, like mmm. We'd like you to take him out, and Obama said, okay, so we form a group -- meaning NATO, which is us by the way, just so you understand, NATO is us, you know, a lot of people say NATO, but NATO is largely us. So we don't even have control of what the hell we're doing... Qaddafi tonight is driving down the streets. Can you believe this? He's waving at everybody. So we form a group and listen to this one. Who's the leader of the group? France. France. France wanted to go in first now, of course, we haven't seen them since, but they were there the first day, and they got all the glamour. They took the glamour. So they form a group and they go in and Obama talks about the regime, maybe not and we don't want to kill anybody. We don't want to hurt anybody. We do want to change government, but we don't want to hurt anyone. Nobody knows what the hell he's talking about, and you know, the other thing about Libya that really bothers me, because we get back again -- it always gets back to China because while we're spending billions of dollars being policemen of the world, China's spending billions of dollars a day buying the world and calling us stupid. You know, I have a lot of friends. I just sold recently an apartment for $33 million. Can you believe it? Only in New York in this happens. But an apartment was sold in a building that I have on Central Park West. $33 million to a Chinese gentleman, and I get to know a lot of guys, and a lot of big people from China, and they look at me. This is before, you know, by the way, about two months ago. They stop talking to me so much. You understood they're saying shit. Do you believe we're talking to this guy and now maybe something crazy could happen. They see these balls, but it's amazing but they sit there, and before I did this that say to me, because there's sort of friends of mine, you know, and competitors but friends. They say Donald, we don't believe that the government allows us to do this. The one guy looks at me. Are they stupid? And I say, absolutely they're stupid. So, you know, I don't blame them. It's like if you make a bad business deal, if you don't know what you're doing, you know, you know, you have to blame yourself. I blame our leaders here. We have China ripping this country off like nobody's ever seen before and we have the president of China came a few months ago to Washington and we give them a state dinner. Now when people are screwing you you don't give them State dinners. You don't do it. So what happens is we send them home and then you heard my statement, right? I said no. No, we're not giving dinners. What we do is we sit down in my office for a couple of hours. We the make a deal where you stop manipulating your currency or not. If we make a deal you can have a state dinner if you want. If you don't make a deal, you take McDonald's and you go home, that's it. That's it. Now, the Chinese economy is growing so fast. It's unbelievable our economy. We had some very bad news. It's just not growing. You say how can it grow? How can we have jobs? Ben Bernanke said fairly recently that the job... the jobs won't come back for a long time. And I think you mentioned five years, and how can you have jobs come back when every time I want to buy a product, I want to buy a product, like as an example television sets, as you know, I buy a lot of television, we bought a lot of sets at Trump International, tremendous, thousands of television sets one order. So I said, I want an American company my people look at me like I'm crazy. There's no American company. But so we end up buying LG's from South Korea, good television set, but why don't we make them? Why are we making them? You know, I'll tell you a great one. I'll tell you a great one and I like the people of South Korea. It's great. I mean I do business with them. I made a great deal with them in New York on Trump World Tower was a great deal. They were wonderful, but they don't even believe it. So here's the... here's what happens recently. We have this contract and it's going to be signed with South Korea and it's a big big deal and Barron Trump, who's four years old, wouldn't sign it from our standpoint, because the deal is so bad. It's so bad like a moron would not sign it. Nobody would sign it and what happens is our president goes there and he wants to send but they don't want to sign because they want better. It's not good enough to just you know, whip the hell out of us. They want it to be even more. So now what happens is times are a little bit different and a couple of bombs get lobbed over, you know to the island and from North Korea. So all of a sudden North Korea's hitting them with a couple of little like lobbing over some bombs, they call us. They said we would like very much to sign contract. You are a wonderful wonderful trading partner. We love you very much. Oh and by the way, do you mind sending the great aircraft carrier the George Washington and about 17 ship because North Korea shooting at us. So what do we do? We have this great aircraft carrier head over to North Korea. We have all these the whole Navy. I mean a big portion of our Navy is going over there North Korea says, holy shit. This is bad news. This is a little bit more than we counted on and they stop we sign a terrible agreement. So then I said to somebody, you know to start up that engine on a carrier like the George Washington that course you probably a million dollars just to see if it's working. You know, you go boom a million. We know right? In fact finest engines of the world Listen. Mr. Trump. I said don't start it. I'll save I take your word for it. I don't have to hear the engines. Okay. I like to save money. I don't care how much money you have you like to say. So so listen to this so we send the George Washington with all of the planes and the crew and all of the side ships and the Destroyers, you know how much they paid us. Nothing. It was stupid. Our leaders are stupid this stupid people. It's just it's very very sad and there are so many stories like that you look at it. You know how many soldiers thousands and thousands of soldiers in between North and South Korea. Give us nothing. In fact, they take our trade now, what would I do do a lot different I'd say, thank you darling. I'll think about that. I'm gonna I think I'm gonna make you very happy about it. So we have thousands of troops and you talk about you know, they have an expression In Harm's Way. How would you like to be sitting between North Korea and South Korea? And you're sitting in a little barracks those guys are in danger. And you know what? That's fine. I'd say the South Korea all those television sets you sell us and all the billions and billions and billions of dollars you make we're going to protect you and we're going to make sure you're in good shape, but you're going to pay for it. You got to pay for it and you want to know something they would do it in two minutes. If you said that you know, somebody said these people are so protective of President Obama. I mean, it's like unbelievable some of the reporters come up and they say you don't mean that I said what kind of a you know, there's supposed to be like impartial they go to me on television. You don't mean it. He's good. He's good. I'm telling you. He's good. I said are you all right. Take it easy. I have never Seen anybody protected like this guy you look at what he's doing. Now. I said something and it came out about two or three weeks ago, but I've been thinking about it for a long time, but you know, nobody cared. Who am I telling Phil Ruffin, the hell does he mean contractors? What the hell do they I've been telling friends, but I've been thinking about it for a long time when we went to Iraq. Everybody said, oh we're going to Iraq. They have weapons of mass destruction. Well, they didn't and by the way, they did knock down the World Trade Center and they also killed terrorists. Now, it's Harvard, you know, this is like going to Harvard of terrorism. If you want to go to Iraq in terms of a terrorist. This is called the Wharton School of Finance or Harvard of terrorism in the old days. He used to shoot the son of a bitches. They had no terrorists. The terrorists had no way I'm going there. So what happens is we've decapitated their army. I mean they have no -- their armies corrupt and they have no Army by the way their leaders that we put in hate us and their leaders are dealing with Iran and I don't even think a shots going to be fired. So what happens is I said the other day when Bill O'Reilly show and some others but I say, you know, this could be risky because a lot of people might not get it but the funny thing is the reporters don't get it, you know gets it the people get it. So here's what I said. It's true. You are smarter than the press now. I have to tell you I've been dealing with the press some is great and fair and honorable and some is really scum that dishonest horrible people. I really mean it. You know, they have a horrible. They have a horrible relationship with a lot of people but they're very dishonest some not all some are great. But I said just about three weeks ago listen upon information and belief Iran, which has been fighting with Iraq forever. Years and years and they were about the same. You know, that's the way it evolved one would push 10 feet this way. Yeah, they throw some gas. They throw a bomb then they go back home. Okay, because they were equal but now what we've done is decapitated Iraq so Iran, which is looking to take over the entire the including by the way Libya, you know, the the rebels which you here are Gone With the Wind, you know, the rebels they talk about the rebels carrying the flag. They're wonderful people. I hear they're iran-backed and Al-Qaeda Peck. How about we get rid of Qaddafi. We're already in there for a billion dollars. We get rid of Gaddafi we end up with worse. Okay that could happen. And the other thing is why isn't China doing it they get that we don't get anything from Libya. You know what I did say in Libya. I'm interested in Libya if we keep the oil and everyone said oh and some of the press said, oh my God, that's the Sovereign Nation. Give me a fucking break. So what happens with Iraq what happens with Iraq is sort of similar we spend in Iraq. We spend this one trillion trillion dollars so far, you know, we could build we could build a big chunk of our country for that we go to Afghanistan we go to Iraq, we build a school. We build a road they blow up the road. They blow up the school. We build another school. We build another road. They blow them up we build again the meantime, we can't get a fucking school built in Brooklyn. It's unbelievable. No, it's unbelievable. So when I heard we were going to Iraq, somebody said, oh we're going for the oil. I said, huh. That makes sense. That's smart. Okay now all of a sudden I'm saying that makes sense. Second largest oil fields in the world second largest reserves in the world fifteen trillion dollars that does a lot to solve our deficit problem doesn't fifteen trillion dollars second after Saudi Arabia. So they said we're going to Iraq. They said the smart people said we're going for the oil but the small people didn't happen to be running things. So we're gonna rack now, here's what we do we go into Iraq. We decimate their army. The people can't stand us the war is over but we're policemen we have policemen. We're not soldiers over there were policemen. Okay, we need a policeman over here and everybody hates us. They don't want us. So what I said is something very Sinister, but true Iran within 15 minutes after we leave is going to walk in they're not going to be fighting anymore. They're going to walk into Iraq. They're going to take over Iraq and they're gonna take over the oil was now we lost thousands of soldiers with tens of thousands of soldiers and I see it in New York. No arms. No legs. I mean seriously wounded and horribly wounded people Brave great people and these are tens of thousands. So here we have fifteen trillion dollars worth of oil that we're going to hand over hand over to Iran. So I said, it ain't gonna happen if I'm president. Okay, it ain't gonna happen. So what we do is very simple and explain this three weeks ago for the first time I said, what we do is very simple we stay we get our exxonmobil's and we go to our grade oil companies we go in there. We give plenty to Iraq more than they getting now because it's all absolutely crap. They don't even know what they're doing and they never will. I mean you think they're going to be a democracy who here thinks. They're gonna be democracy. I'm give me a break. So we go into Iraq and you know in the old days I'm like an old-fashioned Warrior the old days when you had a war and you won the war was yours when we have a war. It's amazing when we have a war we go in we lose thousands of lives tens of thousands wounded spend a trillion and then you know, we do we leave nothing. What do we do this for? So I said we go in we take the oil now Bill O'Reilly who I love I think he's great. He thought that was Radical somebody else said very very strongly Donald. It's a Sovereign Nation. We can't do that. I said Sovereign Nation, they don't even know. I mean, they're not they got wiped out they got nothing, but you know, what if weren't going to take it over which they are 100 percent, 95 percent and you know, there's a real good chance no matter what happens. I will win because you know, one of these blood-sucking politicians whose been bullshitting people for years will end up, you know getting elected and they'll end up leaving and you know, somebody else or in I guarantee you if that happens Iran takes over the oil Iran becomes a force like never before in history. They then take over for Saudi Arabia. They go after Saudi Arabia, which frankly I would protect if they pay us, you know, only if they pass otherwise, I'm not interested. I'm interested in protecting none of them unless they pay but think of this we have a great ally think of this. We have a great ally over there a real ally Israel and Iran is already said that they want to blow Israel off the face of the Earth that developing nuclear weapons. Our leadership is weak and pathetic. I mean we can't even beat Libya. Okay, our leadership is weak and pathetic. So when Iran which is really a power and going to be a great great power very soon, especially when they take over a couple of more countries, they can have so much money and we don't do anything about it. And by the way when they take over Iraq, there's no way we go back honestly because we won't have the stomach to go back. We won't have the stomach. You got to stay you got to take the you got to do it. But what's gonna happen to Israel when you have a controlling? Probably Libya you have them controlling Egypt, which they're going to control already there talkin about that. They're going to control everything over there with all of the money. It's really blackmail money with all of the money. We've paid for years and years and years to take these people. I don't know if you saw the vote. There was a vote in Egypt the other day. 99% of the people want to break the peace treaty with Israel. Did you see that? Did anybody see that 99% so we have problems we have weak pathetic leadership. We have we have incompetent leadership. Now, I'm gonna make a decision fairly soon and I would rather you know, I love my life Phil can tell you I'm having a great time. I built a great company. I have a television show. That's one of the top shows. It's the top show on NBC. It's the number one show on NBC. It's doing great. Even the New York Times the other day wrote a nice little piece about it talkin about how great the ratings were one of the evening at one. It wins the 10 o'clock hour for the whole week. It's a show I mean I have to give a lot of stuff up but you know what its peanuts compared to the importance of this country. And when I see what OPEC is doing to us when I see what China's doing. I'll give you a little China story. Also China I said the other day very very hard to buy anyting outside of China certain other countries also, but China's, you know, the one and I said, somebody said, well, what would you do What can you do? So easy? I drop a 25% tax on China and and get I said to somebody that is really the messenger. The messenger is important. I could have one man. Say we're gonna tax you 25%, and I could say another -- listen you motherfuckers, we're going to tax you 25%. Now, you've said the same exact thing. You've said the same exact thing, but it's a different messenger, and I'll tell you what will happen with China, in my opinion, and I'm not looking at enemies with China. You know, I actually get along. I'm a lover not a fighter. Okay, you've been reading about that for years, but... but I'll tell you something: when they really believe it, when they don't have Obama bowing to the king of Saudi Arabia -- bow, bow down. Remember that one? Does everybody remember that? Remember they were all screaming \"drop to your knees, drop to your knees.\" So what we don't have Obama having all these State dinners and everything. Well, we have somebody that's real and tough and smart and saying -- I'm not saying -- I'm saying smart and you say to China. I'm sorry. We're gonna have to put a 25 percent tax on your products. They'll say when I said how about this evening? Not like, you know, they have -- everybody knows they're abusing us. Everybody knows what's going on. Everybody knows they are manipulating their currencies and they're brought up on it. They're brought up on charges. But we, you know, we take six months just to put in a judge and then we don't do anyting. So I'm not putting charges in. We're gonna charge 25 percent, now the real number based on the manipulation. It's so severe that the real number should be 45 percent. Twenty five, let's start with 25. We can always raise it. I'll tell you what's gonna happen when they believe the message. They don't believe it right now when they believe the message they're going to do one thing. They're gonna give us anything they want because you know, the IMF did you see the international monetary fund they came out with the statement last week that this is unheard of this is that in 2016 that's just like four years, China is going to eclipse the United States as a great economic power. We're going to be in second and if you would have said that 10 years ago, if you would have said that during the time of the late great, Ronald Reagan people would have left at you. They would have laughed so China's going to Eclipse Us in four years now under the Trump doctrine that doesn't happen. You know, why because we're gonna start making our own products. We're not going to let them made in China, you know, when you go to China and you want to sell stuff in China, they make you build a plant and they take all your technology and they pirate everything you have look at the deal that General Electric Man they gave up all of this high technology in order to go there. They had to build factories. When the Chinese sell to us just come on in. Come on in folks will pay you whatever we are stupid. Unbelievable. So under the Trump Doctrine, it doesn't work that way. It's fellas, it's fellas, we love you very much. You want to sell to us build your plant in Alabama build your plant in Nevada Bill get plant. Whatever the hell you wanted, but you're not bringing it all your crap. Including Errata sheet rock. That's making everybody sick. Let me tell you something. The other thing is we make a much better product, but you can't compete price wise because of the manipulation. So one of two things is going to happen and I hope it's the second the first is they stop screwing around but the second is they don't so here's what happens about 60 percent of their sales will stop we will increase the hell out of employment will be building plants. I saw one the other day a fantastic Wilcox, a fantastic plant yesterday in New Hampshire we will start building. They make Weaponry most incredible plans. I didn't even know we had anything like that anymore because everything's made in other countries unbelievable. And this is high technology stuff. Incredible Wilcox look it up great and I don't even have a piece of the company. I wish I did but they make their own products, but you'll have thousands of those places once you do that so they'll behave but if they don't behave that's even better for us because we're gonna start building our own plans and will tell Apple and will tell all these other companies. You got to build your own factories. I'm sorry. You can't make it over there. We got to put our own people to work. So I'll just go one step further. It can happen. So fast one other thing oil you look at what's going on you look at what's going on. And we can't drill in the Gulf and we can't drill in Alaska. Now. Nobody knows more infill can tell you about the environment than I do. I'm I actually receive a lot of people find it hard to believe but I receive a lot of environmental Awards in China and other countries. They just burn whatever the hell is available and that smoke is spewing out of those chimneys and those factories are cheap as hell and they don't give a shit over here. We want clean technology. We want green, green. What the hell good. Is it green here? If this guy over here is spewing all sorts of crap into the what are we doing? So and I believe in the green but what we're doing with our oil we've got to drill in Alaska. We've got to drill in the we've got to drill we've got to drill because there is so much oil plus we have natural gas and we have thing called, you know, we have enough natural gas. We have more natural gas than all of the oil in the entire world put together likewise with call. We have so much call and yet, you know in Abu Dhabi very rich unbelievably which they reek. I mean the poorest people have money pouring out of their ears. Okay. Did you see what they did the other day they are making all of their transportation all of their transportation is going to run on natural gas so they can sell the stupid United States oil. We don't want to use the oil we can sell it to the idiots. So I only say this we have the potential to have a great country again, and I have to say again, we're not a great country now, we're not a great country. We love our country, but we're not a great country if I run and if I win and I hope you're going to be really pleasantly. We're not talking long, believe me. Before June, if I run and if I win, we will have a rich country again. We'll have a great country again, and you know in a certain way what I almost like the most will be respected as a country again. Okay? Thank you. Thank you very much. Thank you. Thank you very much."}