{"id":527,"author":"Donald Trump","title":"Speech: Donald Trump Attends a Tea Party Rally in Boca Raton, FL","date":"2011-04-16","link":"https://factba.se/transcript/donald-trump-speech-tea-party-boca-raton-florida-april-16-2011","paragraphs":["This is really amazing. Well, I want to thank especially Congressman Allen West. He's an amazing guy. I've been his supporter over the time. He's tough, he's smart and a real patriot. So Allen, thank you very much. Also, Rick Scott. I was there at the beginning for Rick. He's doing a good job. It's not easy, I will tell you, and he's doing a hell of a job.","You know, my second home is right down the road in your little competitive community called Palm Beach. You know that, right? I love Florida. I love it. I'd like to thank, first of all, the South Florida Tax Day Tea Party. The opportunity to address this group of really hard working, incredible people is my great honor.","Believe me. You know, over the last period of probably six months since I started thinking about this, I've been asked so much about the Tea Party by reporters, by people, by a lot of different folks. And I've come up with a very truthful, but very standard answer. They're great. They're great because they made Washington start thinking, both Democrat and Republican, but they've made Washington start thinking.","So I just want to thank you all. I mean, it's fantastic. I also know that when I was asked to do this speech today for a friend of mine, he said it was going to be in a little auditorium with two hundred and fifty people. What happened? What happened? And with all this wind, now at least you know it's my real hair, right?","The United States has become the laughing stock and a whipping post for the rest of the world. Whether we like it or not, and we don't like it, the world is laughing at us. They're laughing at our leaders. They're taking advantage of us, and it's a disgrace. I've said on numerous occasions that countries like China, India, South Korea, Mexico, the OPEC nations and many others view our leaders as weak and ineffective, and we have repeatedly unfortunately been taken advantage of to the tune of hundreds of billions of dollars a year.","We have to take our country back. I know a lot of people in other countries. I know the top people. I know the wealthy people. They deal with me on a constant basis. They tell me not so much lately, by the way. But before this whole thing started, they would sit with me at dinners and say, \"Donald, we can't believe what we're getting away with.","I can't believe it.\" You know, these are guys talking to me. I'm talking to them. I can't believe what we're getting away with. And one called up said, \"I can't believe now you're running for, maybe, president. What are you doing? After what I said? Please, you're doing great. Your negotiators are fantastic.\" But they meant that.","They meant that. And they say, \"Who are these leaders? Where did they come from? Over the years, I participated with people like this in many battles. And I've come out almost always as the victor. And I have to say that because, you know, I don't want to be braggadocious, but that's -- you need that kind of a person, whether it's me or somebody else.","You know, when I read that line to my wife this morning, she said, \"Donald, it's too conceited.\" But we need people that win. We don't need people that lose all the time, right? So I took a little bit of a chance because I didn't know when I said that what I didn't know I said maybe there'll be boos maybe but who the hell knows.","But that's what we need. I've beaten many people and companies and I've won many wars. I've fairly but intelligently earned many, many billions of dollars. And if I run, you'll see that because I really look forward to disclosing my financials. I built a great, great company. And the reason I like that is it's both a scorecard and an acknowledgement of certain abilities, and this is what we need.","During my lifetime, I've always been told, and this is very sad, that a person of great accomplishment and achievement cannot become a politician or run for political office because there are too many enemies, both very smart and not so smart, strewn all along the highway to success. I've heard this for years.","People who have been in wars, even the most successful of them, leave themselves open to great criticism from the many that they've beaten and those that have watched these battles. The fact is, this theory of a very successful person running for office, is rarely tested because most very successful people, the kind of people that we need leading our country, don't want to be scrutinized and abused.","And that's what happens. Unfortunately, however, this is the kind of person that this country must have right now. Right now. Our current president, they all want me to say, \"You're fired.\" I mean, this has been like -- we've got a long way to go before I start using that. It's too early. And to be honest, it's too trivial.","But I have it in the back of my mind. Our current president came out of nowhere with no track record. So there was absolutely nothing to criticize. He didn't do anything, so I can't look at his 75 deals and say, \"Oh, gee, look. His secretary didn't dot the i and therefore he did something so wrong. Look what happened.","His lawyer made a mistake.\" He didn't do anything. I never lived my life with a view toward running for office. So when bad things are said about me, and I'm sure they will be said, you have to remember I'm a successful businessman and not a politician. Thank goodness. Businessweek magazine, which is now Bloomberg Businessweek -- and in fact, I'd be very careful to say this because we have a reporter -- where is the reporter from Businessweek?","Where are you? Where is she? Stand up. Stand up. Oh, there. Where? That's not it, no. She's actually a beautiful woman. Anyway, but I have a reporter here in group. Businessweek magazine said in a vote of its readers that Donald Trump was the world's most competitive business person, with Bill Gates being No. 2 and Warren Buffett being No. 3. Steve Forbes stated that I was one of the greatest entrepreneurs in the history of free trade something which this country is not doing very well in folks, I have to tell you.","Considering the shape the United States is in now, we need a competitive and highly competent person to deal with what's going on. And by the way, if instead of China making three hundred billion dollars projection this year, let's call it profit, instead of all of these other companies and countries just absolutely draining our money, you wouldn't be having that kind of fight that we're having in Washington right now between the Democrats and the Republicans.","We'd be having a much more thriving country. We'd be doing great. But you can't have China taking our jobs, taking our money, making our products, leasing. And the amazing thing, then they do all of this and then they loan us money and we pay them interest. And what do they do? They manipulate our currency.","Now I know how to stop it. Most of you have heard me on television. I know how to stop it. They have a problem. You know everyone says, \"Oh they've loaned us money.\" Hey, I've known banks all my life. I'm doing very well. They've loaned us money. It doesn't matter. We have all the cards. Because if we ever did anything, look, they're manipulating their currency.","It's almost impossible for our companies to compete. We have all the cards because if we ever did anything to stop that tremendous inflow of cash, you know, they're rebuilding their cities. They're rebuilding their airports. They're building bridges. When was the last time in this country that you saw a big bridge getting built?","Like what? 50 years ago? When was the last time that you saw an airport being built? We fix them up. We don't even fix them up. You know, I'm in -- I land at LaGuardia. It's like I leave China, or I leave Abu Dhabi, or I leave Qatar, or I leave Saudi Arabia, and it's like coming into a third world country when I land at LaGuardia.","It's old, it's dirty, it's falling apart, it's disgusting. They have a sign, we love New York or welcome to New York. It's made out of two by fours painted white and they're rotten, right? You know, on a little grass bound and they're rotten. You go to a place like Qatar. It's the most unbelievable thing you've ever seen.","I go into the airport and the manager, he's a great guy. Hey look, I don't blame these countries if they outsmart us. Why would I blame them? I blame our people. If China and these other countries can outsmart us, I'm not angry at China. I'm angry at our leaders for letting it happen. So I'm in Qatar. And I see the most beautiful airport I've ever seen, and the manager is taking me around.","The top guy, it's beautiful, oh, Mr. Trump, massage parlor everything. You have no idea. You can get a massage before you get onto a flight, massage. LaGuardia, I can tell you the massages they give you. But you can get anything. So I say to the man, this is the most -- Akhbar. I say, \"Akhbar, this is the most beautiful airport I've ever seen.\" \"No, no, no, Donald.","No, no, no. This is just temporary. There is the airport that we're building right now.\" I said, \"You have to be kidding.\" And we are living like in a third world. country and it's all being done because of our leadership is so bad. OK. I've said on numerous occasions that we should watch China. We should watch OPEC and what they are doing.","We have -- and this is something, I just bring it up because it's so sad. And this could be taken care of. I always say give me one good admiral and a few ships. We have Somali pirates. You believe this? Somali pirates, taking over these five hundred million dollar, the largest tankers in the world. And now we have Germany wants to buy the New York Stock Exchange.","Think of it. I don't want -- you know what. I'm all for free enterprise. I don't want Germany owning the New York Stock Exchange. As a businessman, I've seen what China and OPEC had been doing while politicians, and that's our politicians, have chosen to cast a blind eye and have state dinners in their honor.","How about when the president of China came over a few weeks ago and we gave him a steak dinner and all he does is rip us off. It's unbelievable. He would have gone to McDonald's. Me, he goes to me. If I run and win, our country will be respected again. And China, OPEC, and all of the many nations that are ripping off this great country of ours will be dealt with very, very differently.","And I'll tell you what, that will be a pleasure to do. You know, Obama used to go change. What was that change been? He used to go change. And even he is embarrassed by the word. But I like to cover just a few topics very quickly see you know where I stand on different issues. I am pro-life. I'm against gun control.","You know, it's interesting, gun control because the bad guys are going to have the guns. People that are good, people that are really wonderful, they'll go get licensed. And then they'll hear, \"Oh, gee, they didn't make enough income. Well, they didn't make some crap.\" They won't be -- the bad guys are going to walk into your house with a gun, you're going to say, \"Gee, I wished I would have given me a gun.","At least I would have a chance.\" You know, if the bad guys would get rid of the guns -- but that's not going to happen, never has and it never will. So I am against gun control. I will fight and get rid of Obamacare, which is a total disaster. By the way, just a quick little sideline. I went to the Wharton School of Finance.","And by the way, you know, I always say what a good -- you know, that I was really smart. You know why? Because if you believe that Obama should be giving his birth certificate, they -- the press goes crazy. They make you like you've got an IQ of 13. So I always say, \"You know, I have very high aptitude. I was a great student.","I went to the best school.\" I always started off by saying. Again, it's not to brag. It's almost like I'm trying to defend myself because the level of animosity even with our own party -- I heard Karl Rove today on television. It was terrible. He's -- no, no. What he said was amazing. He was so against me because I am questioning.","All I want to do is see this guy's birth certificate. And look, I watched. And you know, the Republicans have to be very careful of that because obviously Karl Rove didn't do very well the last couple of years in the Bush administration because, hey, whether you like him or not, George Bush gave us Obama, and I'm not happy about it. OK. I'm not happy about it. We have a disaster on our hands.","We have a man right now that almost certainly will go down as the worst president in the history of the United States. And the other thing is that I will create jobs. I'll bring jobs back home. When you call up for your credit card, you want to find out, \"Hey, somebody charged -- used my credit card I'm off by two and a half dollars.\" You know who answers the phone most likely?","Somebody from a foreign country usually India. And what's that all about? And then they have incentives for doing business outsourcing, they call it, overseas. What about us.? And you know, I was watching the other day, Ben Bernanke, and he was saying that the job growth is very slow, much slower. How can it be fast when a -- when like China is making all our products.","How can it be fast when kids are going to college here and then they want to move to China because that's the only place they can get a job? Pretty sad. Pretty sad. OK. A couple of words on foreign policy because I'm watching things going on. We can't afford education. We can't afford to build a road, and yet we're in Iraq, Afghanistan, now Libya.","How about Libya? It's not a beauty. We don't want to -- listen to this. We don't want to change the regime. We want nothing to do with the regime, but we want them out, \"Oh.\" So now people have said, I could just imagine our soldiers and pilots, they're probably saying, \"What does he mean? He said he's not going to be involved in the regime change.","And then in another speech, he says we want them out.\" What does it mean? In the meantime, it's a total disaster because nobody knows what the hell they're doing. And Gaddafi is winning. I mean, I see him riding through the streets waving at all his people. It's amazing. So in the old days -- and really listen to this one because this is the thing I don't understand.","In the old days -- well, I would say bring them home. Somebody said bring them home, and that's cool. But just listen for a sec. This is somebody that has common sense and business sense and -- OK. Ready? In the old days, when we won a war, we won a war. We won a war. Not only us. Everybody, throughout history for thousands of years.","You win a war, you win a war. You keep the nation. You keep the land. You keep the oil. You keep it. So here. In the old days, when we won a war, we won a war. To the victor belong the spoils. Now we go in and fight wars, hand over the keys after we're finished years and years trillions of dollars. Hand over the keys to people that we do not know, do not trust.","And who in most cases do not like us. We're spending many billions of dollars a week in Iraq, Afghanistan and Libya and nobody even knows what our end game is. I want this money to be spent rebuilding the United States. And by the way, with that being said, I am, of any candidate and potential candidate, the strongest person on military spending and military strength.","But what we're doing over there is ridiculous. I gave an example, in Afghanistan, we build a road, we build a school. They blow up the road, they blow up the school. We then go back. We rebuild the road. We rebuild the school. In the meantime, in Alabama and Florida and New York, where they're always fighting for school money, and everywhere else, we can't get any money.","OK? It's crazy. All right. So globalization so far -- and that's really because of the leadership. I'm OK with globalization, but not with countries that are making so much money that they're destroying us. We will change that. You know, in New York, I know all of the great businesspeople and they're vicious, ruthless, horrible human beings in many cases.","And I want them negotiating for me. I don't want a diplomat. You know a diplomat is a person that studies hard. You know what they learn? How to be nice people. I don't want nice people. China. What China does. And they have a system that's a little different, tougher. What China does, is from the time they're born, they send over their toughest, meanest, smartest people.","They don't laugh, they don't cry. They're tough and they're nasty. But we have people that are just as tough, even smarter. And I know them. Why aren't we using them to negotiate? You know when Japan -- which I like very much. I have a lot of Japanese friends. But I was asked I got a little bit a little heat for this but I don't care because I'll say it again now take even with all this press here.","But you know when Japan, rich in all this trouble I was called by one of the news outlets. They said, \"Well, what do you think? Isn't it sad?\" I said, \"Well here's the story. For 30 years they've been ripping this off and taking advantage of us., but I still think we should help.\" See Donald have a great heart.","Oh, for 30 years, let's face it, with the cars, and the this and the that. Just unbelievable what they got away with. But that's OK. We should still help. They're nice people. Ready? Now when we first entered Iraq, and this is the point that I think is very important. Many people said, that is the smart people, that we were going in because of oil remember?","We're going into Iraq. Of course, Iraq has the second largest oil wells in the world after Saudi Arabia. I don't know if you know that. Iraq, good book, great book. I like that guy. The second largest oil wells in the world, in the world, after Saudi. So they said, we're going in. Now what turned out sadly is that wasn't the case.","We've now spent, after many years, like ten, eleven, and twelve, nobody even knows what the year is, $1.5 trillion. Think of this. If you want to have a million dollars for Governor Scott to rebuild a school, you can't get it. We've spent $1.5 trillion. I've never even heard the word trillion until about two years ago.","Two years ago, like trillion became a part. They don't talk billion any more than trillion. I used to have to say, \"Gee, what does trillion mean?\" Let me let me figure this out. I'm a smart guy. Let me figure this out. We don't hear billions anymore, but you don't hear millions. But if you need a million dollars to fix up a school in Boca or any place, you can't get it. So we spent $1.5 trillion and more importantly lost thousands of brave soldiers and military personnel, not to mention, because I do a lot of work with them, the soldiers that are all over with one arm and no legs and problems.","OK? Problems. And they're not even treated well with everything that they did. Oh, that sounds scary. I'm not surprised. That was Obama. So we spent all this money, all these lives, all of these wounded. because of the fact that we've decapitated the military power of Iraq. You know, for years, Iraq and Iran moved back and forth.","One would gain three feet, the others, that's the way it works. It's life. Thousands of years, it's life. One goes this way, one goes that way. You know, they start throwing bad bombs. They start doing all sorts of, you know, crap with the gases, with -- I mean, it's a disaster. It's great to be in New York.","It's great to be in Boca. But for years, they have equal strength. So one would get a little victory. All of a sudden, you'd see it be turned around then they'd sit back in this area. Look, we'll fight each other in another 20 years. Well, we decapitated the armies in Iraq. And Iraq, within a short period of time, after we leave, Iran will take over Iraq.","And I do it. They're already in the process of doing it. They probably won't even have to fire a shot because they're closer to the so-called leaders of Iraq who can't stand us. And frankly, we can't stand them. They're closer to the leaders of Iraq than we are. So as soon as we leave -- and by the way, they don't want to mess with us but we've lost our heart.","You know, it's been 10 to 12 years. We've lost our -- so I'm saying very simply. And as sure as you're sitting there that Iraq, within minutes after we leave, will be taken over by Iran. And if that happens, all of those brave soldiers and military personnel that have died for our country will have died in vain, not to mention the vast amounts of money that's been wasted and could have been used to rebuild the United States.","OK? So ready? It's supposedly controversial. You know, sometimes I say, \"Why is it controversial? Why?\" So if Iran is going to take over the oil, which we all know it's going to, I think almost -- do you agree with me that Iran will take it over soon? Does everybody agree? So if Iran is going to take over the oil, we take the oil, we take.","Now by the way, it's estimated that they have $15 trillion worth of oil in Iraq. People don't realize that. They don't realize how rich they are in terms of the oil fields. We give some to Iraq. We pay back ourselves, plus, plus, plus, of course. And also, we pay back Great Britain and the other nations that helped us. They should be paid back, too, plus, plus, plus.","Now in addition to paying ourselves back, I want to pay back the families of the soldiers who died. And also . And you know what? If you gave them a couple of million dollars apiece can I tell you what? It's peanuts compared to what you're talking about. It's peanuts. It's nothing. Nothing can ever replace their sons and daughters.","But at least, it can help a little bit. And you're talking about literally peanuts. OK. In other words, we don't fight a war, hand over the keys to people that hate us and leave. That's what we do. Think of these wars. We go to Afghanistan. We fight a little while, we fight. Our kids get blown up in their machines, then we leave.","But when we win, but we don't win. We're policemen. We're not soldiers anymore, we're policemen. You know, they're all saying very strongly, very, very strongly. There is no public government. There's no in the government. It was supposed to be our government but it's not working out. It's not working out.","And that's the problem that we have in this country. People like this, that is the problem that we have in this country. It's a big problem. Now as far as Libya is concerned, we don't have any policy in Libya. We don't know what we're doing in Libya. We have no idea. We have no idea who the rebels are. You know, it sounds great, Gone with the Wind, the rebels.","I hear the rebels are from Iran. I hear they're Al-Qaeda. I hear there's lots of problems with the rebels. So I'm only interested in Libya if, again, we get the oil. If we're not going to get the oil, no interest, no interest, whatsoever. Now very interesting. The Arab League, this was one of the great moments in the history of the United States from an embarrassment standpoint.","First of all, France led the charge. You believe this? First time ever. Do you remember France sent the first planes and they wanted to be first. Obama couldn't even give us that privilege. The Arab League composed of Saudi Arabia and the richest nations in the world asked us to go in and rid them of Gaddafi who they don't like.","Why aren't they paying us for this. Why didn't we ask them for payment? They would have paid whatever we wanted. If I would have said, \"Listen we want five million dollars.\" You know what that is? That's nothing for these people. I just told you the airport story. That's nothing for these people. They should pay us. So we're already into Libya for hundreds and hundreds of billions of dollars like we are in there for so much hundreds and hundreds of million dollars.","Unbelievable. We'll be breaking the sacred barriers very soon in terms of cost and what are we doing it for? Why are we doing it? With all the problems we have here, why are we doing it? So if we do it, we want the oil. OK. It was recently reported that China's economy grew at a far higher rate. You know, Geithner said, \"Oh, no. They're not doing so well.\" Listen to this one.","9.8% in the fourth quarter. Would we like that just for one quarter? Because we're stagnant and we're like nothing. 9.8. Where were we? 1, 1.4? Yeah. And that was -- and those numbers were a little bit tinged, too, believe me. The fact is this happened again because of all of the business they're getting from the world but mostly from the United States because of manipulation.","Now we're fast becoming a country of broken dreams sadly and I'm hearing it all the time and it really is a very serious matter. I am very strong on concise borders. We either have a country or we don't. But one thing I've never ever heard, and that's people of achievement, I know many incredible people from South America, from Europe, from Asia.","They can't get into the country. They went to the best colleges, they went to our colleges. They want to be here they want to work. They want to create jobs. We don't let them in. And yet -- and I've had it so many times, I've had so many people begging me, can I help them. They think I know all the senators.","Can I help them. It's impossible almost to get them in. You come from Europe. You come from Latin America. You come from different places. You graduate with Master's degrees. You're going to put people to work. You can't come into this country. But sadly, if you're a criminal, a sex offender, a rapist, a murderer, well, quite frankly somebody who's never ever achieved anything and you're able to cross the borders, you stay in our country, in some cases with benefits and never leave.","What is going on? Now despite what you hear from Washington -- and this is going to be the big problem because they've so weakened the dollar, but despite what you hear in Washington Inflation is rampant. Rampant. Food prices had their biggest increase since 1974. 1974. That will be nothing compared to what's going to happen to you at the gasoline pump.","Gasoline prices have gone up 67% since Obama took office two years ago, and rising gas prices will absolutely kill any movement in the economy. We can't -- that's the blood of the economy. And by the way, the 67%, I've got that stat four weeks ago. Since then, you know what's happened? It's much higher. Between our pathetically weak dollar and our president's inability to rein in the OPEC nations, fuel prices will be hitting levels never even dreamt of before.","Good luck, folks, when you want to take a nice ride with your wife or your husband. Clothing and all other goods you'll be buying likewise are and will be going through the roof. Cotton is probably the worst thing that's happened anywhere. Cotton, they say, is just unbelievable what's happened to cotton prices which is clothing.","And yet you speak to President Obama and he'll tell you that inflation is under control. Where is he living? The truth is he lives in the world of the make-believe. In my opinion and even the fact that he became president is the world that the make-believe. How did this happen? Obama is unwilling or unable to show his birth certificate.","He had lousy marks in school, and he got into Harvard on a scholarship. Explain that one. By the way, I have friends that have kids that have all As that have the highest aptitude test, they can't get into Harvard. They can't get into Wharton either, by the way, which I'm very proud to tell you. But they can't get into Harvard.","He got into Harvard. Huh? Oh, Israel. She's saying how about Israel? How about Israel? How can -- hey, I have so many Jewish friends that are supporting Obama and I'm saying, \"Are you crazy? There's never been anybody worse to Israel than Obama.\" I mean -- thank you. Thanks. Stand up, take a bow. There has never been any president worse to Israel.","And yet all her friends I was thinking about doing this, \"Oh, you'll have to come to a fundraiser on my Park Avenue apartment. We're having a...\" I say, \"For who?\" \"Obama.\" \"No thanks.\" I said, \"Why would you have a fundraiser for Obama?\" You know, it's hard to believe. Anyway, he did one deal.","Now listen to this. He did one deal in his life and that was a real estate deal for the purchase and expansion of his house at below fair market value from a mobster and campaign contributor and one of his best friends who ended up going to jail. And Obama was hardly even looked at. OK? When I heard -- his name is Tony Rezko.","If anybody in the audience did what he did, you wouldn't be here today. I guarantee you'd be someplace else. How he got away with that one, how he's getting away with this whole birth certificate scam, this whole thing is incredible. All right. A couple of little things. Who? Give me some good -- oh, Ayers.","Well, you people are worse than I am. OK, Bill Ayers. I'll give you this real fair. Should I do it or do you have time? You want to leave? Because I'm having a good -- you're my people. I love you. OK. She's just shouting out what about Bill Ayers? Well, Bill Ayers was a bad guy. He was a real terrorist, a real bad guy.","Well, he was Obama's best friend. By the way, Obama dropped all of his best friends. He dropped Tony Rezko -- oh, Tony Rezko, I hardly know. Think of a -- before I get to Bill Ayers, I have to finish with Rezko. Think of this. He buys a house. Right alongside, there's another housing site. Now we all know about houses, right?","We're all -- I'm very good at real estate and most of you are good in real estate. OK. So now he buys Rezko, buys the house lot, just a lot next to him. Obama wants to make a larger room in his house. So Rezko sells him, at below market value, a little chunk of the back in the line. Now what does that do? That ruins the lot for Rezko.","In other words, nobody's going to buy, \"Oh, gee. let me buy that lot. And by the way how come the back of my lot is gone? Where is it? Oh, your senator's on it.\" OK. So he buys this chunk. So now if you think about it, not only was it under market, but he rendered the rest of the piece of land useless. Now when I heard that, I said, \"Well, that's the end of his campaign.","That's the end of him. I didn't know, I didn't care. But I just heard it. I said, \"That's the end of his campaign.\" Nothing. He's president of the United States. Can you believe this? All right, Bill Ayers. To satisfy that -- because I love the Bill Ayers thing. I just didn't want to do it because I didn't want to get wordy as Obama would say.","But Bill Ayers, Bill Ayers is a bad guy, terrorist, lots of bad thoughts. But he is a genius. OK? He's a genius. And there's been a long controversy about Obama's first book. Who wrote it? Well, Bill Ayers came out recently and actually said you know he no longer likes Obama because Obama has not treated him well because he dropped him like he did Rezko.","And like he did, the legendary Reverend Wright. OK? You know, Reverend -- we're talking about Reverend Wright. So what happens is Bill Ayers, in my opinion -- hey, I wrote The Art of the Deal, one of the biggest-selling business books of all time. They say the biggest-selling business book. And I have many -- I think I have eleven or twelve books.","Virtually all of them were bestsellers. Some were No. 1 bestsellers. So I know a lot about books. The man that wrote the second book, he made a big mistake when he wrote the second book. He probably did it for a couple of bucks. The man that wrote the second book didn't write the first book. The first book was written by Ernest Hemingway plus.","The second book was written by a high school graduate. The difference was like chicken salad and chicken shit. OK? That's what it is. And yet, if you think about it, without that first book, which he did not write, there is no way -- because I read both books, there is no way that he wrote that first book.","There's no way. Because we know he wrote the second book because Bill Ayres wasn't involved. He wrote the second book. There is no way the man that wrote the second book wrote the first book. Now here's the story. Here's the story. If he doesn't write the first book, and if the first book isn't brilliant, and it isn't brilliant, he's not president because his whole aura was caused by the genius of the first book which was written by Bill Ayers.","Terrible. So it's very, very sad. OK. Oh, forget Soros. Leave him alone. we got -- he's got enough problems. She goes, what about Soros? Let's talk about somebody else. OK, ready? OK. OK. I want to finish by stating the following. It's hard to believe what's happened. It's hard to believe that Obama became the president of the United States, not because of race, not because of color, not because of anything, but because of all of the things that we don't know about.","Why did he spend millions of dollars trying to get out of the birth certificate issue? Why is it that his grandmother said he was born in Kenya and then 51 seconds later, with all those handlers in the room, it was like, uh, uh, uh, well, I mean, uh? Why -- how did this all happen? How did this happen? So I ask another question.","He got the Nobel Peace Prize. OK? Think of it. He got the Nobel Peace Prize. So I mean, just think about it. Just like -- you know, Al Gore was a big step above what. Our country has so many bad issues, three wars, an economy that's absolutely terrible, rampant inflation that our leaders refuse to acknowledge, an infrastructure that's crumbling, and many, many more problems in places like China, India, Saudi Arabia, and many others they are building, as I said, airports, bridges.","It's the most unbelievable sight. There's a crane on every corner. Now we are the Saudi Arabia of natural gas. We don't use it. We are a country that actually, despite what everyone thinks, we have a lot of oil and we don't let people drill. We have coal, we have oil, we have lots of different things. We don't let our people use it. Now it all has to do with what's going on. It all has to do with your leadership.","It all has to do with the person on top. You know, a little story, the Wollman Ice Skating Rink in Central Park, which I'm sure you all know, is a good example of what can be done in the free market. The city of New York spent eight years and $21 million. You probably all remember it before you all left here because taxes are too high in New York and the weather is not as nice as this.","$21 million and we're unable to get the rink open. It was a political nightmare and a great embarrassment to the city. I asked to take over the project before Ivanka and my kids got too old. They were little kids. I want them to go ice skating. I couldn't take them ice skating. Oh, I asked to take over the project.","After four months and $1.8 million and a big portion of that was in demolishing all of the incompetent work that was done in open. And today, it's a case study in many of the great business. I did it in four months. It took them eight years. I did it for $1.8 million. Now just a little local circus, you know this.","Fairly recently, right down the road in Palm Beach, I bought a house in bankruptcy court for $41 million. Only Palm Beach has houses for $41 million. What can I tell you? I bought a house in bankruptcy court has one to go a lot higher for $41 million and sold it a fairly short time later for almost $100 million dollars.","Now isn't that the kind of thinking that this country needs? Making good deals. Making good deals is how a country thrives. That's why you see all these countries that are taking effect. They're thriving because they have so much money. They can build their airports and their schools and their hospitals and all the things we need.","So you need that kind of thinking. And by the way, whether it's me or whether it's somebody else, you must have that kind of thinking. It's imperative. We cannot continue to go on like this. Now if I decide to run and if I win -- thank you. I will not be raising taxes, but will be taking in billions of dollars from other countries and will be creating vast numbers of productive jobs, productive, and will rebuild our country.","The United States will be great again. Thank you all very much. Thank you. Thank you."],"text":" This is really amazing. Well, I want to thank especially Congressman Allen West. He's an amazing guy. I've been his supporter over the time. He's tough, he's smart and a real patriot. So Allen, thank you very much. Also, Rick Scott. I was there at the beginning for Rick. He's doing a good job. It's not easy, I will tell you, and he's doing a hell of a job. You know, my second home is right down the road in your little competitive community called Palm Beach. You know that, right? I love Florida. I love it. I'd like to thank, first of all, the South Florida Tax Day Tea Party. The opportunity to address this group of really hard working, incredible people is my great honor. Believe me. You know, over the last period of probably six months since I started thinking about this, I've been asked so much about the Tea Party by reporters, by people, by a lot of different folks. And I've come up with a very truthful, but very standard answer. They're great. They're great because they made Washington start thinking, both Democrat and Republican, but they've made Washington start thinking. So I just want to thank you all. I mean, it's fantastic. I also know that when I was asked to do this speech today for a friend of mine, he said it was going to be in a little auditorium with two hundred and fifty people. What happened? What happened? And with all this wind, now at least you know it's my real hair, right? The United States has become the laughing stock and a whipping post for the rest of the world. Whether we like it or not, and we don't like it, the world is laughing at us. They're laughing at our leaders. They're taking advantage of us, and it's a disgrace. I've said on numerous occasions that countries like China, India, South Korea, Mexico, the OPEC nations and many others view our leaders as weak and ineffective, and we have repeatedly unfortunately been taken advantage of to the tune of hundreds of billions of dollars a year. We have to take our country back. I know a lot of people in other countries. I know the top people. I know the wealthy people. They deal with me on a constant basis. They tell me not so much lately, by the way. But before this whole thing started, they would sit with me at dinners and say, \"Donald, we can't believe what we're getting away with. I can't believe it.\" You know, these are guys talking to me. I'm talking to them. I can't believe what we're getting away with. And one called up said, \"I can't believe now you're running for, maybe, president. What are you doing? After what I said? Please, you're doing great. Your negotiators are fantastic.\" But they meant that. They meant that. And they say, \"Who are these leaders? Where did they come from? Over the years, I participated with people like this in many battles. And I've come out almost always as the victor. And I have to say that because, you know, I don't want to be braggadocious, but that's -- you need that kind of a person, whether it's me or somebody else. You know, when I read that line to my wife this morning, she said, \"Donald, it's too conceited.\" But we need people that win. We don't need people that lose all the time, right? So I took a little bit of a chance because I didn't know when I said that what I didn't know I said maybe there'll be boos maybe but who the hell knows. But that's what we need. I've beaten many people and companies and I've won many wars. I've fairly but intelligently earned many, many billions of dollars. And if I run, you'll see that because I really look forward to disclosing my financials. I built a great, great company. And the reason I like that is it's both a scorecard and an acknowledgement of certain abilities, and this is what we need. During my lifetime, I've always been told, and this is very sad, that a person of great accomplishment and achievement cannot become a politician or run for political office because there are too many enemies, both very smart and not so smart, strewn all along the highway to success. I've heard this for years. People who have been in wars, even the most successful of them, leave themselves open to great criticism from the many that they've beaten and those that have watched these battles. The fact is, this theory of a very successful person running for office, is rarely tested because most very successful people, the kind of people that we need leading our country, don't want to be scrutinized and abused. And that's what happens. Unfortunately, however, this is the kind of person that this country must have right now. Right now. Our current president, they all want me to say, \"You're fired.\" I mean, this has been like -- we've got a long way to go before I start using that. It's too early. And to be honest, it's too trivial. But I have it in the back of my mind. Our current president came out of nowhere with no track record. So there was absolutely nothing to criticize. He didn't do anything, so I can't look at his 75 deals and say, \"Oh, gee, look. His secretary didn't dot the i and therefore he did something so wrong. Look what happened. His lawyer made a mistake.\" He didn't do anything. I never lived my life with a view toward running for office. So when bad things are said about me, and I'm sure they will be said, you have to remember I'm a successful businessman and not a politician. Thank goodness. Businessweek magazine, which is now Bloomberg Businessweek -- and in fact, I'd be very careful to say this because we have a reporter -- where is the reporter from Businessweek? Where are you? Where is she? Stand up. Stand up. Oh, there. Where? That's not it, no. She's actually a beautiful woman. Anyway, but I have a reporter here in group. Businessweek magazine said in a vote of its readers that Donald Trump was the world's most competitive business person, with Bill Gates being No. 2 and Warren Buffett being No. 3. Steve Forbes stated that I was one of the greatest entrepreneurs in the history of free trade something which this country is not doing very well in folks, I have to tell you. Considering the shape the United States is in now, we need a competitive and highly competent person to deal with what's going on. And by the way, if instead of China making three hundred billion dollars projection this year, let's call it profit, instead of all of these other companies and countries just absolutely draining our money, you wouldn't be having that kind of fight that we're having in Washington right now between the Democrats and the Republicans. We'd be having a much more thriving country. We'd be doing great. But you can't have China taking our jobs, taking our money, making our products, leasing. And the amazing thing, then they do all of this and then they loan us money and we pay them interest. And what do they do? They manipulate our currency. Now I know how to stop it. Most of you have heard me on television. I know how to stop it. They have a problem. You know everyone says, \"Oh they've loaned us money.\" Hey, I've known banks all my life. I'm doing very well. They've loaned us money. It doesn't matter. We have all the cards. Because if we ever did anything, look, they're manipulating their currency. It's almost impossible for our companies to compete. We have all the cards because if we ever did anything to stop that tremendous inflow of cash, you know, they're rebuilding their cities. They're rebuilding their airports. They're building bridges. When was the last time in this country that you saw a big bridge getting built? Like what? 50 years ago? When was the last time that you saw an airport being built? We fix them up. We don't even fix them up. You know, I'm in -- I land at LaGuardia. It's like I leave China, or I leave Abu Dhabi, or I leave Qatar, or I leave Saudi Arabia, and it's like coming into a third world country when I land at LaGuardia. It's old, it's dirty, it's falling apart, it's disgusting. They have a sign, we love New York or welcome to New York. It's made out of two by fours painted white and they're rotten, right? You know, on a little grass bound and they're rotten. You go to a place like Qatar. It's the most unbelievable thing you've ever seen. I go into the airport and the manager, he's a great guy. Hey look, I don't blame these countries if they outsmart us. Why would I blame them? I blame our people. If China and these other countries can outsmart us, I'm not angry at China. I'm angry at our leaders for letting it happen. So I'm in Qatar. And I see the most beautiful airport I've ever seen, and the manager is taking me around. The top guy, it's beautiful, oh, Mr. Trump, massage parlor everything. You have no idea. You can get a massage before you get onto a flight, massage. LaGuardia, I can tell you the massages they give you. But you can get anything. So I say to the man, this is the most -- Akhbar. I say, \"Akhbar, this is the most beautiful airport I've ever seen.\" \"No, no, no, Donald. No, no, no. This is just temporary. There is the airport that we're building right now.\" I said, \"You have to be kidding.\" And we are living like in a third world. country and it's all being done because of our leadership is so bad. OK. I've said on numerous occasions that we should watch China. We should watch OPEC and what they are doing. We have -- and this is something, I just bring it up because it's so sad. And this could be taken care of. I always say give me one good admiral and a few ships. We have Somali pirates. You believe this? Somali pirates, taking over these five hundred million dollar, the largest tankers in the world. And now we have Germany wants to buy the New York Stock Exchange. Think of it. I don't want -- you know what. I'm all for free enterprise. I don't want Germany owning the New York Stock Exchange. As a businessman, I've seen what China and OPEC had been doing while politicians, and that's our politicians, have chosen to cast a blind eye and have state dinners in their honor. How about when the president of China came over a few weeks ago and we gave him a steak dinner and all he does is rip us off. It's unbelievable. He would have gone to McDonald's. Me, he goes to me. If I run and win, our country will be respected again. And China, OPEC, and all of the many nations that are ripping off this great country of ours will be dealt with very, very differently. And I'll tell you what, that will be a pleasure to do. You know, Obama used to go change. What was that change been? He used to go change. And even he is embarrassed by the word. But I like to cover just a few topics very quickly see you know where I stand on different issues. I am pro-life. I'm against gun control. You know, it's interesting, gun control because the bad guys are going to have the guns. People that are good, people that are really wonderful, they'll go get licensed. And then they'll hear, \"Oh, gee, they didn't make enough income. Well, they didn't make some crap.\" They won't be -- the bad guys are going to walk into your house with a gun, you're going to say, \"Gee, I wished I would have given me a gun. At least I would have a chance.\" You know, if the bad guys would get rid of the guns -- but that's not going to happen, never has and it never will. So I am against gun control. I will fight and get rid of Obamacare, which is a total disaster. By the way, just a quick little sideline. I went to the Wharton School of Finance. And by the way, you know, I always say what a good -- you know, that I was really smart. You know why? Because if you believe that Obama should be giving his birth certificate, they -- the press goes crazy. They make you like you've got an IQ of 13. So I always say, \"You know, I have very high aptitude. I was a great student. I went to the best school.\" I always started off by saying. Again, it's not to brag. It's almost like I'm trying to defend myself because the level of animosity even with our own party -- I heard Karl Rove today on television. It was terrible. He's -- no, no. What he said was amazing. He was so against me because I am questioning. All I want to do is see this guy's birth certificate. And look, I watched. And you know, the Republicans have to be very careful of that because obviously Karl Rove didn't do very well the last couple of years in the Bush administration because, hey, whether you like him or not, George Bush gave us Obama, and I'm not happy about it. OK. I'm not happy about it. We have a disaster on our hands. We have a man right now that almost certainly will go down as the worst president in the history of the United States. And the other thing is that I will create jobs. I'll bring jobs back home. When you call up for your credit card, you want to find out, \"Hey, somebody charged -- used my credit card I'm off by two and a half dollars.\" You know who answers the phone most likely? Somebody from a foreign country usually India. And what's that all about? And then they have incentives for doing business outsourcing, they call it, overseas. What about us.? And you know, I was watching the other day, Ben Bernanke, and he was saying that the job growth is very slow, much slower. How can it be fast when a -- when like China is making all our products. How can it be fast when kids are going to college here and then they want to move to China because that's the only place they can get a job? Pretty sad. Pretty sad. OK. A couple of words on foreign policy because I'm watching things going on. We can't afford education. We can't afford to build a road, and yet we're in Iraq, Afghanistan, now Libya. How about Libya? It's not a beauty. We don't want to -- listen to this. We don't want to change the regime. We want nothing to do with the regime, but we want them out, \"Oh.\" So now people have said, I could just imagine our soldiers and pilots, they're probably saying, \"What does he mean? He said he's not going to be involved in the regime change. And then in another speech, he says we want them out.\" What does it mean? In the meantime, it's a total disaster because nobody knows what the hell they're doing. And Gaddafi is winning. I mean, I see him riding through the streets waving at all his people. It's amazing. So in the old days -- and really listen to this one because this is the thing I don't understand. In the old days -- well, I would say bring them home. Somebody said bring them home, and that's cool. But just listen for a sec. This is somebody that has common sense and business sense and -- OK. Ready? In the old days, when we won a war, we won a war. We won a war. Not only us. Everybody, throughout history for thousands of years. You win a war, you win a war. You keep the nation. You keep the land. You keep the oil. You keep it. So here. In the old days, when we won a war, we won a war. To the victor belong the spoils. Now we go in and fight wars, hand over the keys after we're finished years and years trillions of dollars. Hand over the keys to people that we do not know, do not trust. And who in most cases do not like us. We're spending many billions of dollars a week in Iraq, Afghanistan and Libya and nobody even knows what our end game is. I want this money to be spent rebuilding the United States. And by the way, with that being said, I am, of any candidate and potential candidate, the strongest person on military spending and military strength. But what we're doing over there is ridiculous. I gave an example, in Afghanistan, we build a road, we build a school. They blow up the road, they blow up the school. We then go back. We rebuild the road. We rebuild the school. In the meantime, in Alabama and Florida and New York, where they're always fighting for school money, and everywhere else, we can't get any money. OK? It's crazy. All right. So globalization so far -- and that's really because of the leadership. I'm OK with globalization, but not with countries that are making so much money that they're destroying us. We will change that. You know, in New York, I know all of the great businesspeople and they're vicious, ruthless, horrible human beings in many cases. And I want them negotiating for me. I don't want a diplomat. You know a diplomat is a person that studies hard. You know what they learn? How to be nice people. I don't want nice people. China. What China does. And they have a system that's a little different, tougher. What China does, is from the time they're born, they send over their toughest, meanest, smartest people. They don't laugh, they don't cry. They're tough and they're nasty. But we have people that are just as tough, even smarter. And I know them. Why aren't we using them to negotiate? You know when Japan -- which I like very much. I have a lot of Japanese friends. But I was asked I got a little bit a little heat for this but I don't care because I'll say it again now take even with all this press here. But you know when Japan, rich in all this trouble I was called by one of the news outlets. They said, \"Well, what do you think? Isn't it sad?\" I said, \"Well here's the story. For 30 years they've been ripping this off and taking advantage of us., but I still think we should help.\" See Donald have a great heart. Oh, for 30 years, let's face it, with the cars, and the this and the that. Just unbelievable what they got away with. But that's OK. We should still help. They're nice people. Ready? Now when we first entered Iraq, and this is the point that I think is very important. Many people said, that is the smart people, that we were going in because of oil remember? We're going into Iraq. Of course, Iraq has the second largest oil wells in the world after Saudi Arabia. I don't know if you know that. Iraq, good book, great book. I like that guy. The second largest oil wells in the world, in the world, after Saudi. So they said, we're going in. Now what turned out sadly is that wasn't the case. We've now spent, after many years, like ten, eleven, and twelve, nobody even knows what the year is, $1.5 trillion. Think of this. If you want to have a million dollars for Governor Scott to rebuild a school, you can't get it. We've spent $1.5 trillion. I've never even heard the word trillion until about two years ago. Two years ago, like trillion became a part. They don't talk billion any more than trillion. I used to have to say, \"Gee, what does trillion mean?\" Let me let me figure this out. I'm a smart guy. Let me figure this out. We don't hear billions anymore, but you don't hear millions. But if you need a million dollars to fix up a school in Boca or any place, you can't get it. So we spent $1.5 trillion and more importantly lost thousands of brave soldiers and military personnel, not to mention, because I do a lot of work with them, the soldiers that are all over with one arm and no legs and problems. OK? Problems. And they're not even treated well with everything that they did. Oh, that sounds scary. I'm not surprised. That was Obama. So we spent all this money, all these lives, all of these wounded. because of the fact that we've decapitated the military power of Iraq. You know, for years, Iraq and Iran moved back and forth. One would gain three feet, the others, that's the way it works. It's life. Thousands of years, it's life. One goes this way, one goes that way. You know, they start throwing bad bombs. They start doing all sorts of, you know, crap with the gases, with -- I mean, it's a disaster. It's great to be in New York. It's great to be in Boca. But for years, they have equal strength. So one would get a little victory. All of a sudden, you'd see it be turned around then they'd sit back in this area. Look, we'll fight each other in another 20 years. Well, we decapitated the armies in Iraq. And Iraq, within a short period of time, after we leave, Iran will take over Iraq. And I do it. They're already in the process of doing it. They probably won't even have to fire a shot because they're closer to the so-called leaders of Iraq who can't stand us. And frankly, we can't stand them. They're closer to the leaders of Iraq than we are. So as soon as we leave -- and by the way, they don't want to mess with us but we've lost our heart. You know, it's been 10 to 12 years. We've lost our -- so I'm saying very simply. And as sure as you're sitting there that Iraq, within minutes after we leave, will be taken over by Iran. And if that happens, all of those brave soldiers and military personnel that have died for our country will have died in vain, not to mention the vast amounts of money that's been wasted and could have been used to rebuild the United States. OK? So ready? It's supposedly controversial. You know, sometimes I say, \"Why is it controversial? Why?\" So if Iran is going to take over the oil, which we all know it's going to, I think almost -- do you agree with me that Iran will take it over soon? Does everybody agree? So if Iran is going to take over the oil, we take the oil, we take. Now by the way, it's estimated that they have $15 trillion worth of oil in Iraq. People don't realize that. They don't realize how rich they are in terms of the oil fields. We give some to Iraq. We pay back ourselves, plus, plus, plus, of course. And also, we pay back Great Britain and the other nations that helped us. They should be paid back, too, plus, plus, plus. Now in addition to paying ourselves back, I want to pay back the families of the soldiers who died. And also . And you know what? If you gave them a couple of million dollars apiece can I tell you what? It's peanuts compared to what you're talking about. It's peanuts. It's nothing. Nothing can ever replace their sons and daughters. But at least, it can help a little bit. And you're talking about literally peanuts. OK. In other words, we don't fight a war, hand over the keys to people that hate us and leave. That's what we do. Think of these wars. We go to Afghanistan. We fight a little while, we fight. Our kids get blown up in their machines, then we leave. But when we win, but we don't win. We're policemen. We're not soldiers anymore, we're policemen. You know, they're all saying very strongly, very, very strongly. There is no public government. There's no in the government. It was supposed to be our government but it's not working out. It's not working out. And that's the problem that we have in this country. People like this, that is the problem that we have in this country. It's a big problem. Now as far as Libya is concerned, we don't have any policy in Libya. We don't know what we're doing in Libya. We have no idea. We have no idea who the rebels are. You know, it sounds great, Gone with the Wind, the rebels. I hear the rebels are from Iran. I hear they're Al-Qaeda. I hear there's lots of problems with the rebels. So I'm only interested in Libya if, again, we get the oil. If we're not going to get the oil, no interest, no interest, whatsoever. Now very interesting. The Arab League, this was one of the great moments in the history of the United States from an embarrassment standpoint. First of all, France led the charge. You believe this? First time ever. Do you remember France sent the first planes and they wanted to be first. Obama couldn't even give us that privilege. The Arab League composed of Saudi Arabia and the richest nations in the world asked us to go in and rid them of Gaddafi who they don't like. Why aren't they paying us for this. Why didn't we ask them for payment? They would have paid whatever we wanted. If I would have said, \"Listen we want five million dollars.\" You know what that is? That's nothing for these people. I just told you the airport story. That's nothing for these people. They should pay us. So we're already into Libya for hundreds and hundreds of billions of dollars like we are in there for so much hundreds and hundreds of million dollars. Unbelievable. We'll be breaking the sacred barriers very soon in terms of cost and what are we doing it for? Why are we doing it? With all the problems we have here, why are we doing it? So if we do it, we want the oil. OK. It was recently reported that China's economy grew at a far higher rate. You know, Geithner said, \"Oh, no. They're not doing so well.\" Listen to this one. 9.8% in the fourth quarter. Would we like that just for one quarter? Because we're stagnant and we're like nothing. 9.8. Where were we? 1, 1.4? Yeah. And that was -- and those numbers were a little bit tinged, too, believe me. The fact is this happened again because of all of the business they're getting from the world but mostly from the United States because of manipulation. Now we're fast becoming a country of broken dreams sadly and I'm hearing it all the time and it really is a very serious matter. I am very strong on concise borders. We either have a country or we don't. But one thing I've never ever heard, and that's people of achievement, I know many incredible people from South America, from Europe, from Asia. They can't get into the country. They went to the best colleges, they went to our colleges. They want to be here they want to work. They want to create jobs. We don't let them in. And yet -- and I've had it so many times, I've had so many people begging me, can I help them. They think I know all the senators. Can I help them. It's impossible almost to get them in. You come from Europe. You come from Latin America. You come from different places. You graduate with Master's degrees. You're going to put people to work. You can't come into this country. But sadly, if you're a criminal, a sex offender, a rapist, a murderer, well, quite frankly somebody who's never ever achieved anything and you're able to cross the borders, you stay in our country, in some cases with benefits and never leave. What is going on? Now despite what you hear from Washington -- and this is going to be the big problem because they've so weakened the dollar, but despite what you hear in Washington Inflation is rampant. Rampant. Food prices had their biggest increase since 1974. 1974. That will be nothing compared to what's going to happen to you at the gasoline pump. Gasoline prices have gone up 67% since Obama took office two years ago, and rising gas prices will absolutely kill any movement in the economy. We can't -- that's the blood of the economy. And by the way, the 67%, I've got that stat four weeks ago. Since then, you know what's happened? It's much higher. Between our pathetically weak dollar and our president's inability to rein in the OPEC nations, fuel prices will be hitting levels never even dreamt of before. Good luck, folks, when you want to take a nice ride with your wife or your husband. Clothing and all other goods you'll be buying likewise are and will be going through the roof. Cotton is probably the worst thing that's happened anywhere. Cotton, they say, is just unbelievable what's happened to cotton prices which is clothing. And yet you speak to President Obama and he'll tell you that inflation is under control. Where is he living? The truth is he lives in the world of the make-believe. In my opinion and even the fact that he became president is the world that the make-believe. How did this happen? Obama is unwilling or unable to show his birth certificate. He had lousy marks in school, and he got into Harvard on a scholarship. Explain that one. By the way, I have friends that have kids that have all As that have the highest aptitude test, they can't get into Harvard. They can't get into Wharton either, by the way, which I'm very proud to tell you. But they can't get into Harvard. He got into Harvard. Huh? Oh, Israel. She's saying how about Israel? How about Israel? How can -- hey, I have so many Jewish friends that are supporting Obama and I'm saying, \"Are you crazy? There's never been anybody worse to Israel than Obama.\" I mean -- thank you. Thanks. Stand up, take a bow. There has never been any president worse to Israel. And yet all her friends I was thinking about doing this, \"Oh, you'll have to come to a fundraiser on my Park Avenue apartment. We're having a...\" I say, \"For who?\" \"Obama.\" \"No thanks.\" I said, \"Why would you have a fundraiser for Obama?\" You know, it's hard to believe. Anyway, he did one deal. Now listen to this. He did one deal in his life and that was a real estate deal for the purchase and expansion of his house at below fair market value from a mobster and campaign contributor and one of his best friends who ended up going to jail. And Obama was hardly even looked at. OK? When I heard -- his name is Tony Rezko. If anybody in the audience did what he did, you wouldn't be here today. I guarantee you'd be someplace else. How he got away with that one, how he's getting away with this whole birth certificate scam, this whole thing is incredible. All right. A couple of little things. Who? Give me some good -- oh, Ayers. Well, you people are worse than I am. OK, Bill Ayers. I'll give you this real fair. Should I do it or do you have time? You want to leave? Because I'm having a good -- you're my people. I love you. OK. She's just shouting out what about Bill Ayers? Well, Bill Ayers was a bad guy. He was a real terrorist, a real bad guy. Well, he was Obama's best friend. By the way, Obama dropped all of his best friends. He dropped Tony Rezko -- oh, Tony Rezko, I hardly know. Think of a -- before I get to Bill Ayers, I have to finish with Rezko. Think of this. He buys a house. Right alongside, there's another housing site. Now we all know about houses, right? We're all -- I'm very good at real estate and most of you are good in real estate. OK. So now he buys Rezko, buys the house lot, just a lot next to him. Obama wants to make a larger room in his house. So Rezko sells him, at below market value, a little chunk of the back in the line. Now what does that do? That ruins the lot for Rezko. In other words, nobody's going to buy, \"Oh, gee. let me buy that lot. And by the way how come the back of my lot is gone? Where is it? Oh, your senator's on it.\" OK. So he buys this chunk. So now if you think about it, not only was it under market, but he rendered the rest of the piece of land useless. Now when I heard that, I said, \"Well, that's the end of his campaign. That's the end of him. I didn't know, I didn't care. But I just heard it. I said, \"That's the end of his campaign.\" Nothing. He's president of the United States. Can you believe this? All right, Bill Ayers. To satisfy that -- because I love the Bill Ayers thing. I just didn't want to do it because I didn't want to get wordy as Obama would say. But Bill Ayers, Bill Ayers is a bad guy, terrorist, lots of bad thoughts. But he is a genius. OK? He's a genius. And there's been a long controversy about Obama's first book. Who wrote it? Well, Bill Ayers came out recently and actually said you know he no longer likes Obama because Obama has not treated him well because he dropped him like he did Rezko. And like he did, the legendary Reverend Wright. OK? You know, Reverend -- we're talking about Reverend Wright. So what happens is Bill Ayers, in my opinion -- hey, I wrote The Art of the Deal, one of the biggest-selling business books of all time. They say the biggest-selling business book. And I have many -- I think I have eleven or twelve books. Virtually all of them were bestsellers. Some were No. 1 bestsellers. So I know a lot about books. The man that wrote the second book, he made a big mistake when he wrote the second book. He probably did it for a couple of bucks. The man that wrote the second book didn't write the first book. The first book was written by Ernest Hemingway plus. The second book was written by a high school graduate. The difference was like chicken salad and chicken shit. OK? That's what it is. And yet, if you think about it, without that first book, which he did not write, there is no way -- because I read both books, there is no way that he wrote that first book. There's no way. Because we know he wrote the second book because Bill Ayres wasn't involved. He wrote the second book. There is no way the man that wrote the second book wrote the first book. Now here's the story. Here's the story. If he doesn't write the first book, and if the first book isn't brilliant, and it isn't brilliant, he's not president because his whole aura was caused by the genius of the first book which was written by Bill Ayers. Terrible. So it's very, very sad. OK. Oh, forget Soros. Leave him alone. we got -- he's got enough problems. She goes, what about Soros? Let's talk about somebody else. OK, ready? OK. OK. I want to finish by stating the following. It's hard to believe what's happened. It's hard to believe that Obama became the president of the United States, not because of race, not because of color, not because of anything, but because of all of the things that we don't know about. Why did he spend millions of dollars trying to get out of the birth certificate issue? Why is it that his grandmother said he was born in Kenya and then 51 seconds later, with all those handlers in the room, it was like, uh, uh, uh, well, I mean, uh? Why -- how did this all happen? How did this happen? So I ask another question. He got the Nobel Peace Prize. OK? Think of it. He got the Nobel Peace Prize. So I mean, just think about it. Just like -- you know, Al Gore was a big step above what. Our country has so many bad issues, three wars, an economy that's absolutely terrible, rampant inflation that our leaders refuse to acknowledge, an infrastructure that's crumbling, and many, many more problems in places like China, India, Saudi Arabia, and many others they are building, as I said, airports, bridges. It's the most unbelievable sight. There's a crane on every corner. Now we are the Saudi Arabia of natural gas. We don't use it. We are a country that actually, despite what everyone thinks, we have a lot of oil and we don't let people drill. We have coal, we have oil, we have lots of different things. We don't let our people use it. Now it all has to do with what's going on. It all has to do with your leadership. It all has to do with the person on top. You know, a little story, the Wollman Ice Skating Rink in Central Park, which I'm sure you all know, is a good example of what can be done in the free market. The city of New York spent eight years and $21 million. You probably all remember it before you all left here because taxes are too high in New York and the weather is not as nice as this. $21 million and we're unable to get the rink open. It was a political nightmare and a great embarrassment to the city. I asked to take over the project before Ivanka and my kids got too old. They were little kids. I want them to go ice skating. I couldn't take them ice skating. Oh, I asked to take over the project. After four months and $1.8 million and a big portion of that was in demolishing all of the incompetent work that was done in open. And today, it's a case study in many of the great business. I did it in four months. It took them eight years. I did it for $1.8 million. Now just a little local circus, you know this. Fairly recently, right down the road in Palm Beach, I bought a house in bankruptcy court for $41 million. Only Palm Beach has houses for $41 million. What can I tell you? I bought a house in bankruptcy court has one to go a lot higher for $41 million and sold it a fairly short time later for almost $100 million dollars. Now isn't that the kind of thinking that this country needs? Making good deals. Making good deals is how a country thrives. That's why you see all these countries that are taking effect. They're thriving because they have so much money. They can build their airports and their schools and their hospitals and all the things we need. So you need that kind of thinking. And by the way, whether it's me or whether it's somebody else, you must have that kind of thinking. It's imperative. We cannot continue to go on like this. Now if I decide to run and if I win -- thank you. I will not be raising taxes, but will be taking in billions of dollars from other countries and will be creating vast numbers of productive jobs, productive, and will rebuild our country. The United States will be great again. Thank you all very much. Thank you. Thank you."}