{"id":528,"author":"Donald Trump","title":"Speech: Donald Trump Addresses the CPAC Convention in Washington, DC","date":"2011-02-10","link":"https://factba.se/transcript/donald-trump-speech-washington-dc-february-10-2011","paragraphs":["Thank You. Wow. What a nice group. Beautiful. Thank you very much. Great to be here. You're hired. These are my people. This is beautiful. Thank you, darling. Let me begin by thanking CPAC for the opportunity to address so many of you today. It's a wonderful forum and an honor to be here.","Thank you very much. While I'm not, at this time, a candidate for the presidency, I will decide by June whether or not I will become one. And I will tell you, the reason that I'm thinking about it is that the United States has become a whipping post for the rest of the world. The world is treating us without respect.","They are not treating us properly. America -- America today is missing quality leadership and foreign countries have quickly realized this. It's for this reason that the United States is becoming the laughingstock of the world. Now whether we like it or don't like it, that's what's happening. I deal with people from China.","I deal with people from Mexico. They cannot believe what they're getting away with. I've said on numerous occasions that countries like China, like India, South Korea, Mexico, and the OPEC nations, view our leaders as weak and ineffective and have repeatedly taken advantage of them to the tune of hundreds of billions of dollars a year.","When they talk about raising your taxes, they talk about -- I think raised the taxes on some of these countries that are taking advantage of the United States. Over the years, I participated in many battles and have really almost come out very, very victorious every single time. I've beaten many people and companies and I've won many wars.","I have fairly but intelligently earned many billions of dollars which, in a sense, was both a scorecard and acknowledgement of my abilities. During my lifetime, I'm all a little different, right? A little different than what you've been hearing. During my lifetime, I've always been told that a person of great accomplishment and achievement can not become a politician or run for political office because there are too many enemies, both very smart and not so smart strewn along this highway to success.","People who have been in wars and this is war. Life is pleasant but it can be war. People who have been in wars even the most successful of them leave themselves open to great criticism from the many that they've beaten and those that have watched the battles. The fact is, this theory of a very successful person running for office is rarely tested because most successful people don't want to be scrutinized or abused.","And that's what happens. If you see it, that's what happens. And this is why we don't have the kind of people that we should have running for office. Unfortunately, or have -- This is the kind of person that the country needs and they need it now, We don't have time to wait 25 years and get the right -- This country is in serious trouble.","We need it now. Our -- Our current president came out of nowhere, came out of nowhere. In fact, I'll go a step further the people that went to school with them. They don't even know -- They never saw him. They don't know who he is. Crazy. With no track record and I will tell you he's got nothing to criticize.","You have no record can't be criticized. Wonderful guy, he's a nice man but there was no record. Nothing to criticize. He didn't go in wars. He didn't go into battles, he didn't beat this one, that one. Have enemies all over the place. Nobody knew who the hell he was. He's now our president. He's our president.","But he is our president. Business Week magazine, which is now Bloomberg Businessweek, said, in a vote of its read -- Thank you very much. Said and a vote of its readers that Donald Trump was the world's most competitive business person. I don't know if that's true enough but that's what the reader said.","With Bill Gates being No. 2 and Warren Buffett being No. 3, Steve Forbes stated that I was one of the greatest entrepreneurs in the history of free trade. That's an important word free trade. Because we don't have free trade we don't have free trade. We don't have fair trade and I'm a fair-trade believer.","I love open markets but not when China's manipulating their currency. Not when all of these other factors are taking place. Thank you. And I can tell you, I'm a big buyer of products. I build buildings and other things and so many of those products unfortunately come from China, and other countries, but China.","We are rebuilding China. We're rebuilding China. You go to China right now they're building the biggest airports in the world, the greatest airports the best everything. And they're doing it because we buy so much of their product. And the reason we buy their product is because they're -- they're currency is so low and they have it artificially so low that it makes it almost impossible for our companies to compete.","Now I'll tell you one thing that's very important, our companies make a better product. That's very important to know. We make a better product. So we're Steve Forbes and with the Business Week statement: Considering the shape the United States is in right now, we need a competitive person we need a highly competent person or we're going to have very, very serious trouble very quickly.","I've said on numerous occasions that we should watch China and OPEC because, by the way, worse than China, worse than everyone, OPEC. They are truly ripping us and you know, I wrote it down, coming over here today. One of my people in the car said, \"oh my gosh. Look at that four -- \" he actually didn't use the word gosh but I'm going to use it $4.54 a gallon for gas right on the sticker.","Four fifty-four for gas. It's going to go much higher, folks, get used to it. Because we have nobody that calls up OPEC and they're only there because of us. We protect them. We have nobody that calls up OPEC and say, \"That price better get lower, and it better get lower fast.\" We have nobody that doesn't. They have a free rein.","They have a free rein and it's amazing. You know the other day there was a small leak in the Alaska pipeline. I said, \"Watch. OPEC will announce an increase.\" They did, just a small leak, lasted like half a day. They announced an increase. Anytime there's a problem. Now Egypt, they had the whole situation in Egypt.","People in the square, OPEC announced increase. There was a -- any time there's a little problem, they announced, and nobody says anything. Nobody says it's unwarranted. Anyway, so you have to watch OPEC. You have to tell OPEC, \"Folks, those prices are coming down and they're coming down fast. And we're not going to be paying seven and eight and $9, which, believe me, in a year or two from now you're going to be paying that.","Assures you're sitting there because we have nobody to speak to him. How about this. This morning I'm leaving New York and Germany is buying The New York Stock Exchange. Now you believe it? I thought I was kidding I said, \"Is this April Fool's Day?\" Germany, a major company in Germany is buying The New York Stock Exchange.","How about the Somali pirates? Now you know that doesn't really pertain to us. How simple would that be if we had a good admiral Well give me one good admiral and a couple of good ships. We'd blast them out of the water so fast. So I have a reputation for telling it like it is. I'm known for my candor.","I've had a lot of great victories and I may be willing to put that to work. I mean, I wish still, frankly, I wish there was a candidate that I saw that would be fantastic because I love what I'm doing. In fact, I have a great club that's 15 minutes away. By the way, Ron Paul cannot get elected him.","I'm sorry to say. Sorry. And you know what else I like Ron Paul. I think he's a good guy. But honestly, he has just zero chance of getting elected. You have to win an election. And I can tell you this, if I run and if I win, this country will be respected again. This country will be respected again.","I can tell you that. I graduated from the Wharton School of Finance, which is the best business school, in my opinion. But I graduated from the Wharton School of Finance as well as military school. Both of those educational backgrounds have come into play to shape my personal and business relationship with what I do, who I do it with.","There are tactics and strategies involved in any form of leadership and I'm well acquainted with both. I'm also well acquainted with winning and that's what this country needs now. Winning. Just very briefly, I'm pro-life, I'm against gun control. I agree with your previous speaker, and I will fight to end Obamacare and replace it. Replace it with something that makes sense for people in business and not bankrupt the country.","If I decide to run I will not be raising taxes. We'll be taking in hundreds of billions of dollars from other countries that is screwing us. We'll be creating vast numbers of productive jobs. And -- Thank you very much. And we'll rebuild our country so that we can be proud. Our country will be great again. Thank you very much it's an honor. Thank you. Thank you."],"text":" Thank You. Wow. What a nice group. Beautiful. Thank you very much. Great to be here. You're hired. These are my people. This is beautiful. Thank you, darling. Let me begin by thanking CPAC for the opportunity to address so many of you today. It's a wonderful forum and an honor to be here. Thank you very much. While I'm not, at this time, a candidate for the presidency, I will decide by June whether or not I will become one. And I will tell you, the reason that I'm thinking about it is that the United States has become a whipping post for the rest of the world. The world is treating us without respect. They are not treating us properly. America -- America today is missing quality leadership and foreign countries have quickly realized this. It's for this reason that the United States is becoming the laughingstock of the world. Now whether we like it or don't like it, that's what's happening. I deal with people from China. I deal with people from Mexico. They cannot believe what they're getting away with. I've said on numerous occasions that countries like China, like India, South Korea, Mexico, and the OPEC nations, view our leaders as weak and ineffective and have repeatedly taken advantage of them to the tune of hundreds of billions of dollars a year. When they talk about raising your taxes, they talk about -- I think raised the taxes on some of these countries that are taking advantage of the United States. Over the years, I participated in many battles and have really almost come out very, very victorious every single time. I've beaten many people and companies and I've won many wars. I have fairly but intelligently earned many billions of dollars which, in a sense, was both a scorecard and acknowledgement of my abilities. During my lifetime, I'm all a little different, right? A little different than what you've been hearing. During my lifetime, I've always been told that a person of great accomplishment and achievement can not become a politician or run for political office because there are too many enemies, both very smart and not so smart strewn along this highway to success. People who have been in wars and this is war. Life is pleasant but it can be war. People who have been in wars even the most successful of them leave themselves open to great criticism from the many that they've beaten and those that have watched the battles. The fact is, this theory of a very successful person running for office is rarely tested because most successful people don't want to be scrutinized or abused. And that's what happens. If you see it, that's what happens. And this is why we don't have the kind of people that we should have running for office. Unfortunately, or have -- This is the kind of person that the country needs and they need it now, We don't have time to wait 25 years and get the right -- This country is in serious trouble. We need it now. Our -- Our current president came out of nowhere, came out of nowhere. In fact, I'll go a step further the people that went to school with them. They don't even know -- They never saw him. They don't know who he is. Crazy. With no track record and I will tell you he's got nothing to criticize. You have no record can't be criticized. Wonderful guy, he's a nice man but there was no record. Nothing to criticize. He didn't go in wars. He didn't go into battles, he didn't beat this one, that one. Have enemies all over the place. Nobody knew who the hell he was. He's now our president. He's our president. But he is our president. Business Week magazine, which is now Bloomberg Businessweek, said, in a vote of its read -- Thank you very much. Said and a vote of its readers that Donald Trump was the world's most competitive business person. I don't know if that's true enough but that's what the reader said. With Bill Gates being No. 2 and Warren Buffett being No. 3, Steve Forbes stated that I was one of the greatest entrepreneurs in the history of free trade. That's an important word free trade. Because we don't have free trade we don't have free trade. We don't have fair trade and I'm a fair-trade believer. I love open markets but not when China's manipulating their currency. Not when all of these other factors are taking place. Thank you. And I can tell you, I'm a big buyer of products. I build buildings and other things and so many of those products unfortunately come from China, and other countries, but China. We are rebuilding China. We're rebuilding China. You go to China right now they're building the biggest airports in the world, the greatest airports the best everything. And they're doing it because we buy so much of their product. And the reason we buy their product is because they're -- they're currency is so low and they have it artificially so low that it makes it almost impossible for our companies to compete. Now I'll tell you one thing that's very important, our companies make a better product. That's very important to know. We make a better product. So we're Steve Forbes and with the Business Week statement: Considering the shape the United States is in right now, we need a competitive person we need a highly competent person or we're going to have very, very serious trouble very quickly. I've said on numerous occasions that we should watch China and OPEC because, by the way, worse than China, worse than everyone, OPEC. They are truly ripping us and you know, I wrote it down, coming over here today. One of my people in the car said, \"oh my gosh. Look at that four -- \" he actually didn't use the word gosh but I'm going to use it $4.54 a gallon for gas right on the sticker. Four fifty-four for gas. It's going to go much higher, folks, get used to it. Because we have nobody that calls up OPEC and they're only there because of us. We protect them. We have nobody that calls up OPEC and say, \"That price better get lower, and it better get lower fast.\" We have nobody that doesn't. They have a free rein. They have a free rein and it's amazing. You know the other day there was a small leak in the Alaska pipeline. I said, \"Watch. OPEC will announce an increase.\" They did, just a small leak, lasted like half a day. They announced an increase. Anytime there's a problem. Now Egypt, they had the whole situation in Egypt. People in the square, OPEC announced increase. There was a -- any time there's a little problem, they announced, and nobody says anything. Nobody says it's unwarranted. Anyway, so you have to watch OPEC. You have to tell OPEC, \"Folks, those prices are coming down and they're coming down fast. And we're not going to be paying seven and eight and $9, which, believe me, in a year or two from now you're going to be paying that. Assures you're sitting there because we have nobody to speak to him. How about this. This morning I'm leaving New York and Germany is buying The New York Stock Exchange. Now you believe it? I thought I was kidding I said, \"Is this April Fool's Day?\" Germany, a major company in Germany is buying The New York Stock Exchange. How about the Somali pirates? Now you know that doesn't really pertain to us. How simple would that be if we had a good admiral Well give me one good admiral and a couple of good ships. We'd blast them out of the water so fast. So I have a reputation for telling it like it is. I'm known for my candor. I've had a lot of great victories and I may be willing to put that to work. I mean, I wish still, frankly, I wish there was a candidate that I saw that would be fantastic because I love what I'm doing. In fact, I have a great club that's 15 minutes away. By the way, Ron Paul cannot get elected him. I'm sorry to say. Sorry. And you know what else I like Ron Paul. I think he's a good guy. But honestly, he has just zero chance of getting elected. You have to win an election. And I can tell you this, if I run and if I win, this country will be respected again. This country will be respected again. I can tell you that. I graduated from the Wharton School of Finance, which is the best business school, in my opinion. But I graduated from the Wharton School of Finance as well as military school. Both of those educational backgrounds have come into play to shape my personal and business relationship with what I do, who I do it with. There are tactics and strategies involved in any form of leadership and I'm well acquainted with both. I'm also well acquainted with winning and that's what this country needs now. Winning. Just very briefly, I'm pro-life, I'm against gun control. I agree with your previous speaker, and I will fight to end Obamacare and replace it. Replace it with something that makes sense for people in business and not bankrupt the country. If I decide to run I will not be raising taxes. We'll be taking in hundreds of billions of dollars from other countries that is screwing us. We'll be creating vast numbers of productive jobs. And -- Thank you very much. And we'll rebuild our country so that we can be proud. Our country will be great again. Thank you very much it's an honor. Thank you. Thank you."}