{"id":338,"author":"Barack Obama","title":"Selma March 50-Year Anniversary Address","date":"2015-03-07","link":"https://americanrhetoric.com/speeches/barackobama/barackobamaselma50anniversarymarch.htm","paragraphs":["We are Lewis and Clark and Sacajawea, pioneers who braved the unfamiliar, followed by a stampede of farmers and miners, and entrepreneurs and hucksters. That?s our spirit. That?s who we are.","We are Sojourner Truth and Fannie Lou Hamer, women who could do as much as any man and then some. And we?re Susan B. Anthony, who shook the system until the law reflected that truth. That is our character.","We?re the immigrants who stowed away on ships to reach these shores, the huddled masses yearning to breathe free -- Holocaust survivors, Soviet defectors, the Lost Boys of Sudan. We?re the hopeful strivers who cross the Rio Grande because we want our kids to know a better life. That?s how we came to be.","We?re the slaves who built the White House and the economy of the South. We?re the ranch hands and cowboys who opened up the West, and countless laborers who laid rail, and raised skyscrapers, and organized for workers? rights.","We?re the fresh-faced GIs who fought to liberate a continent. And we?re the Tuskeegee Airmen, and the Navajo code-talkers, and the Japanese Americans who fought for this country even as their own liberty had been denied.","We?re the firefighters who rushed into those buildings on 9/11, the volunteers who signed up to fight in Afghanistan and Iraq. We?re the gay Americans whose blood ran in the streets of San Francisco and New York, just as blood ran down this bridge.","We are storytellers, writers, poets, artists who abhor unfairness, and despise hypocrisy, and give voice to the voiceless, and tell truths that need to be told.","We?re the inventors of gospel and jazz and blues, bluegrass and country, and hip-hop and rock and roll, and our very own sound with all the sweet sorrow and reckless joy of freedom.","We are Jackie Robinson, enduring scorn and spiked cleats and pitches coming straight to his head, and stealing home in the World Series anyway.","We are the people Langston Hughes wrote of who ?build our temples for tomorrow, strong as we know how.? We are the people Emerson wrote of, ?who for truth and honor?s sake stand fast and suffer long;? who are ?never tired, so long as we can see far enough.?","Those who hope in the Lord will renew their strength. They will soar on wings like eagles. They will run and not grow weary. They will walk and not be faint."],"text":"We are Lewis and Clark and Sacajawea, pioneers who braved the unfamiliar, followed by a stampede of farmers and miners, and entrepreneurs and hucksters. That?s our spirit. That?s who we are. We are Sojourner Truth and Fannie Lou Hamer, women who could do as much as any man and then some. And we?re Susan B. Anthony, who shook the system until the law reflected that truth. That is our character. We?re the immigrants who stowed away on ships to reach these shores, the huddled masses yearning to breathe free -- Holocaust survivors, Soviet defectors, the Lost Boys of Sudan. We?re the hopeful strivers who cross the Rio Grande because we want our kids to know a better life. That?s how we came to be. We?re the slaves who built the White House and the economy of the South. We?re the ranch hands and cowboys who opened up the West, and countless laborers who laid rail, and raised skyscrapers, and organized for workers? rights. We?re the fresh-faced GIs who fought to liberate a continent. And we?re the Tuskeegee Airmen, and the Navajo code-talkers, and the Japanese Americans who fought for this country even as their own liberty had been denied. We?re the firefighters who rushed into those buildings on 9/11, the volunteers who signed up to fight in Afghanistan and Iraq. We?re the gay Americans whose blood ran in the streets of San Francisco and New York, just as blood ran down this bridge. We are storytellers, writers, poets, artists who abhor unfairness, and despise hypocrisy, and give voice to the voiceless, and tell truths that need to be told. We?re the inventors of gospel and jazz and blues, bluegrass and country, and hip-hop and rock and roll, and our very own sound with all the sweet sorrow and reckless joy of freedom. We are Jackie Robinson, enduring scorn and spiked cleats and pitches coming straight to his head, and stealing home in the World Series anyway. We are the people Langston Hughes wrote of who ?build our temples for tomorrow, strong as we know how.? We are the people Emerson wrote of, ?who for truth and honor?s sake stand fast and suffer long;? who are ?never tired, so long as we can see far enough.? Those who hope in the Lord will renew their strength. They will soar on wings like eagles. They will run and not grow weary. They will walk and not be faint."}