{"id":414,"author":"Barack Obama","title":"Joint Press Conference with President Raul Castro","date":"2016-03-21","link":"https://americanrhetoric.com/speeches/barackobama/barackobamaraulcastropresser.htm","paragraphs":["President Raul Castro: [As interpreted.] Mr. President Barack Obama, we are pleased to welcome you on this, the first visit of a President of the United States of America to our country in 88 years.","We have observed that in the 15 months that have passed since the decision was made to establish our diplomatic relations, we have obtained concrete results. We were able to resume direct postal exchanges and we signed an agreement to resume commercial flights.","We have signed two memorandums of understanding on the protection of the environment and maritime areas, and another one to secure the safety of sea navigation. Today, another one will be signed on cooperation of the area of agriculture. At the moment, another set of bilateral instruments are being negotiated to cooperate in such areas as counter narcotics, the safety of commerce, and travelers and health. About this last issue, we have agreed to deepen our cooperation in the prevention and treatment of transmissible diseases, such as Zika, and non-transmissible chronic diseases, cancer included.","This cooperation is beneficial not only for Cuba and the United States, but also for our hemisphere at large. Following the decisions made by President Obama to modify the application of some aspects of the blockade, Cuban enterprises and their American counterparts are working to identify possible commercial operations that could materialize in the still restrictive framework of existing regulations.","The fact is that some have already materialized, especially in the area of telecommunications -- an area in which our country already has a program designed on the basis of its priorities and the necessary technological sovereignty, one that can secure the appropriate (ph) views and the service of national interests.","Progress has also been made toward the acquisition of medicines, medical materiel and equipment for power generation and environmental protection, these among others. Much more could be done if the blockade were lifted.","We recognize the position of President Obama and his Administration against the blockade, and his repeated appeals to Congress to have it removed. The most recent measures adopted by his Administration are positive but insufficient. I had the opportunity to discuss with the President other steps that we think could be taken in order to remove restrictions that remain in force, and make a significant contribution to the debunking of the blockade.","This is essential, because the blockade remains in force and because it contains discouraging elements and intimidating effects and extra- territorial outreach.","I put forward to the President some examples on this, showing their negative consequences for both Cuba and other countries. The blockade stands as the most important obstacle to our economic development and the wellbeing of the Cuba people. That's why its removal will be of the essence to normalize bilateral relations. And actually, it will also bring benefits to the Cuban emigrants who wish the best for their families and their country.","In order to move forward towards normalization, it will also be necessary to return the territory illegally occupied by Guantanamo Naval Base. Since they stand as the two main obstacles, these issues were again dealt with in the editorial ran on March 9 by the official newspaper of the Communist Party of Cuba.","And again, only four days ago, in the press conference offered by our Foreign Minister Bruno Rodriguez, those pieces extensively reported by the media.","Other policies should also be abolished for normal relations to develop between the United States and Cuba. No one should intend to have the Cuban people renounce the destiny it chose in freedom and sovereignty, the same for which you have made enormous sacrifices.","We also discussed international issues, particularly those that could have an impact on regional peace and stability. We had thought to discuss other issues, but we did not have enough time. I had planned to raise our concern over the destabilization some are trying to promote in Venezuela, something which we consider to be counterproductive to the overall situation in the continent. I did not have the chance to raise with him, I'm raising it here.","Likewise, we talked about the ongoing peace process in Colombia and the effort to put an end to that conflict. There are profound differences between our countries that will not go away. Since we hold different concepts on many subjects such as political systems, democracy, the exercise of human rights, social justice, international relations and world peace and stability.","We defend human rights. In our view, civil, political, economic, social and cultural rights are indivisible, interdependent and universal. Actually, we find it inconceivable that a government does not defend and insure the right to health care, education, Social Security with provision and development, equal pay and the rights of children. We oppose political manipulation and double standards in the approach to human rights.","Cuba has much to say and show on this issue. That is why I have reiterated to the President our willingness to continue moving forward with the dialogue on this matter that was already initiated.","On December 17th, 2014, as we announced the decision to re- establish diplomatic relations, I said that we should learn the art of co- existing with our difference in a civilized manner. In my remarks to Parliament on July 15, 2015, I said changing everything that needs to be changed is the sovereign and exclusive concern of Cubans. The revolutionary government is willing to advance to a normalization of relations, for it is convinced that both countries can co-exist and cooperate in a civilized manner and for the mutual benefit regardless of existing and future differences and thus contribute to peace, security, stability, development and equity in our continent and around the world.","Today, I reaffirm that we should exercise the art of civilized co-existence, which involves accepting and respecting differences and preventing these from becoming the center of our relationship.","We should instead promote links that can benefit both our countries and peoples while focusing on those things that bring us closer and not on those that pull us apart. We agree that a long and complex path still lies ahead. But what is most important is that we have started taking the first steps to build a new type of relationship, one that has never existed between Cuba and the United States.","Actually, destroying a bridge can be an easy and quick undertaking. However, its solid reconstruction can prove a lengthy and challenging endeavor. After four failed attempts and giving proof of the will and perseverance, on September 2, 2013, American swimmer Diane Nyad managed to cross the Florida Strait swimming without an anti-shark cage to protect her.","To that exploit of conquering the geographical differences between our two countries. It was for that exploit that on August 30th, 2013, as the national anthems of Cuba and the United States were played she was presented with the Order of Sport Merit, a declaration awarded by the State Counsel. Such feat carries a powerful message.","One that should serve as an example to honor bilateral relations. For it confirms that if she could do it, then we can do it too. President Obama, I reiterate our appreciation for his visit and the willingness of the government of Cuba to continue moving forward in the well being of our countries.","Thank you very much."],"text":"President Raul Castro: Mr. President Barack Obama, we are pleased to welcome you on this, the first visit of a President of the United States of America to our country in 88 years. We have observed that in the 15 months that have passed since the decision was made to establish our diplomatic relations, we have obtained concrete results. We were able to resume direct postal exchanges and we signed an agreement to resume commercial flights. We have signed two memorandums of understanding on the protection of the environment and maritime areas, and another one to secure the safety of sea navigation. Today, another one will be signed on cooperation of the area of agriculture. At the moment, another set of bilateral instruments are being negotiated to cooperate in such areas as counter narcotics, the safety of commerce, and travelers and health. About this last issue, we have agreed to deepen our cooperation in the prevention and treatment of transmissible diseases, such as Zika, and non-transmissible chronic diseases, cancer included. This cooperation is beneficial not only for Cuba and the United States, but also for our hemisphere at large. Following the decisions made by President Obama to modify the application of some aspects of the blockade, Cuban enterprises and their American counterparts are working to identify possible commercial operations that could materialize in the still restrictive framework of existing regulations. The fact is that some have already materialized, especially in the area of telecommunications -- an area in which our country already has a program designed on the basis of its priorities and the necessary technological sovereignty, one that can secure the appropriate (ph) views and the service of national interests. Progress has also been made toward the acquisition of medicines, medical materiel and equipment for power generation and environmental protection, these among others. Much more could be done if the blockade were lifted. We recognize the position of President Obama and his Administration against the blockade, and his repeated appeals to Congress to have it removed. The most recent measures adopted by his Administration are positive but insufficient. I had the opportunity to discuss with the President other steps that we think could be taken in order to remove restrictions that remain in force, and make a significant contribution to the debunking of the blockade. This is essential, because the blockade remains in force and because it contains discouraging elements and intimidating effects and extra- territorial outreach. I put forward to the President some examples on this, showing their negative consequences for both Cuba and other countries. The blockade stands as the most important obstacle to our economic development and the wellbeing of the Cuba people. That's why its removal will be of the essence to normalize bilateral relations. And actually, it will also bring benefits to the Cuban emigrants who wish the best for their families and their country. In order to move forward towards normalization, it will also be necessary to return the territory illegally occupied by Guantanamo Naval Base. Since they stand as the two main obstacles, these issues were again dealt with in the editorial ran on March 9 by the official newspaper of the Communist Party of Cuba. And again, only four days ago, in the press conference offered by our Foreign Minister Bruno Rodriguez, those pieces extensively reported by the media. Other policies should also be abolished for normal relations to develop between the United States and Cuba. No one should intend to have the Cuban people renounce the destiny it chose in freedom and sovereignty, the same for which you have made enormous sacrifices. We also discussed international issues, particularly those that could have an impact on regional peace and stability. We had thought to discuss other issues, but we did not have enough time. I had planned to raise our concern over the destabilization some are trying to promote in Venezuela, something which we consider to be counterproductive to the overall situation in the continent. I did not have the chance to raise with him, I'm raising it here. Likewise, we talked about the ongoing peace process in Colombia and the effort to put an end to that conflict. There are profound differences between our countries that will not go away. Since we hold different concepts on many subjects such as political systems, democracy, the exercise of human rights, social justice, international relations and world peace and stability. We defend human rights. In our view, civil, political, economic, social and cultural rights are indivisible, interdependent and universal. Actually, we find it inconceivable that a government does not defend and insure the right to health care, education, Social Security with provision and development, equal pay and the rights of children. We oppose political manipulation and double standards in the approach to human rights. Cuba has much to say and show on this issue. That is why I have reiterated to the President our willingness to continue moving forward with the dialogue on this matter that was already initiated. On December 17th, 2014, as we announced the decision to re- establish diplomatic relations, I said that we should learn the art of co- existing with our difference in a civilized manner. In my remarks to Parliament on July 15, 2015, I said changing everything that needs to be changed is the sovereign and exclusive concern of Cubans. The revolutionary government is willing to advance to a normalization of relations, for it is convinced that both countries can co-exist and cooperate in a civilized manner and for the mutual benefit regardless of existing and future differences and thus contribute to peace, security, stability, development and equity in our continent and around the world. Today, I reaffirm that we should exercise the art of civilized co-existence, which involves accepting and respecting differences and preventing these from becoming the center of our relationship. We should instead promote links that can benefit both our countries and peoples while focusing on those things that bring us closer and not on those that pull us apart. We agree that a long and complex path still lies ahead. But what is most important is that we have started taking the first steps to build a new type of relationship, one that has never existed between Cuba and the United States. Actually, destroying a bridge can be an easy and quick undertaking. However, its solid reconstruction can prove a lengthy and challenging endeavor. After four failed attempts and giving proof of the will and perseverance, on September 2, 2013, American swimmer Diane Nyad managed to cross the Florida Strait swimming without an anti-shark cage to protect her. To that exploit of conquering the geographical differences between our two countries. It was for that exploit that on August 30th, 2013, as the national anthems of Cuba and the United States were played she was presented with the Order of Sport Merit, a declaration awarded by the State Counsel. Such feat carries a powerful message. One that should serve as an example to honor bilateral relations. For it confirms that if she could do it, then we can do it too. President Obama, I reiterate our appreciation for his visit and the willingness of the government of Cuba to continue moving forward in the well being of our countries. Thank you very much."}